[
  {
    "title": "Orissa HC slams Cuttack bank for holding back gratuity over a loan guarantee—reaffirms Section 4(6) is the only key to forfeit gratuity dues.",
    "description": "<p>The Orissa High Court, in a Division Bench ruling on September 20, 2025, emphatically reiterated that gratuity can only be forfeited under the precise conditions stipulated in Section 4(6) of the Payment of Gratuity Act, 1972. The court admonished the Cuttack Central Cooperative Bank Ltd. for unlawfully withholding a retired employee's gratuity over her role as a personal guarantor for a defaulted loan, underscoring that superannuation does not permit such set-offs.</p>\n\n<p>The case originated when a Deputy Manager, who retired in 2010 after superannuation with an unblemished record, was denied her gratuity. The bank justified its action by citing her liability as a guarantor for a loan that later went unpaid. This decision was consistently overturned by the Controlling Authority, the Appellate Authority, and a Single Bench of the Orissa High Court before reaching the Division Bench as a writ appeal.</p>\n\n<p>The High Court dismissed the bank's appeal, emphasizing that Section 4(6) of the Act, which begins with a non-obstante clause, permits forfeiture only to the extent of damage or loss suffered by the employer if the employee was \"terminated\" for a wilful act, omission, or negligence causing such damage. Retirement on superannuation, the court clarified, is the antithesis of termination for misconduct, thus eliminating the statutory trigger for forfeiture. The court further held that introducing a guarantor's civil liability into the Act would constitute an unauthorized judicial expansion of its scope, reinforcing that gratuity is a statutory right earned through service, not a security deposit for credit.</p>\n\n<p>Concluding that three statutory forums had already reached the same conclusion without perversity, irrationality, or exceeding statutory remit, the court found no grounds for interference. This judgment serves as a critical reminder to all employers that the provisions of Section 4(6) of the 1972 Act are the sole gateway for gratuity forfeiture, strictly limited to proven misconduct and not extendable to civil liabilities like loan guarantees. The bank was consequently ordered to release the gratuity forthwith.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/orissa-hc-gratuity-cannot-be-withheld-for-loan-guarantee.jpg"
  }
]