[
  {
    "title": "DoT Tightens Noose on Unused Transmitters, Issues Post Licence Disposal Playbook",
    "description": "<p>India's Department of Telecommunications (DoT) has issued a comprehensive guideline to resolve the ambiguity surrounding the disposal of wireless transmitting and receiving equipment upon the expiry of a Wireless Operating Licence (WOL). Effective immediately and applicable to all entities—private and public—possessing radiating hardware under WPC licenses, these stern guidelines establish clear accountability and strict timelines for equipment disposal, backed by the threat of prosecution under the Indian Telegraphy Act.</p>\n\n<p>The guidelines prescribe varying disposal periods depending on the manner of licence expiry. For licensee-initiated cancellations, a 90-day window is provided to scrap, return, transfer the apparatus, or secure a Non-Destructive Possession Licence (NDPL), with a \"deemed NDPL\" cover during this period. In cases of simple non-renewal, a 30-day period is allotted for disposal, requiring a disposal certificate upload within seven days of completion, also with a deemed NDPL. The most abrupt scenario, government-induced termination due to breach of conditions, allows only 15 days for hardware removal and surrender, reflecting a heightened focus on spectrum security. Retaining equipment for future experiments necessitates obtaining a regular NDPL before the existing licence lapses, as no deemed grace period is extended for long-term storage.</p>\n\n<p>Proof of disposal can be established by returning equipment to the original vendor or an authorised dealer, transferring it to another licensed entity with identical frequency clearance, or physically destroying it in the presence of a Wireless Monitoring Organisation (WMO) inspector or licensed dealer. Government laboratories may self-certify demolition but must inform WPC. Crucially, all disposed equipment, including circuit boards, batteries, and metal carcasses, must comply with the Environment Ministry's 2022 rules for telecom-specific e-waste, ensuring they reach only authorised recyclers.</p>\n\n<p>Non-compliance with these new directives will be treated as a wilful violation, leading to \"appropriate action\" by the DoT, which could include fines, black-listing, and criminal prosecution under wireless statutes. The new playbook definitively shifts the full lifecycle liability for every radio chip onto the licence-holder, emphasizing that experimental frequencies are temporary leases on public property, and equipment must be promptly removed once the licence tenure concludes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/dot-issues-strict-rules-for-disposing-wireless-equipment.jpg"
  },
  {
    "title": "Supreme Court Addresses Conflict Between Forest Rights Act and Forest Conservation Act on Tribal Housing",
    "description": "<p>In Sugra Adiwasi & Ors. v. Pathranand & Ors., the Supreme Court of India examined the intersection of the Forest Rights Act (FRA) and the Forest Conservation Act (FCA) concerning the construction of permanent housing for forest dwellers. The court acknowledged the conflict between recognizing the rights of tribal communities to adequate housing and the need to preserve forest ecology.</p>\n\n<p>The case arose from a dispute over whether forest dwellers could construct permanent homes on forest land without violating the FCA. Petitioners argued the FRA grants habitation rights, including durable housing, while the Union of India emphasized the FCA's role in forest preservation. The core legal issue was whether FRA-recognized construction could proceed despite FCA regulations.</p>\n\n<p>The Court analyzed both Acts, noting the FRA's limited \"notwithstanding\" clause doesn't explicitly authorize housing construction without FCA oversight. It reaffirmed that the FCA regulates, rather than prohibits, non-forest activities, emphasizing forest protection as a constitutional obligation. The court stressed the need for a \"convergent interpretation\" where both statutes coexist, protecting human and environmental interests.</p>\n\n<p>Acknowledging the State's duty to ensure minimum living conditions, the Supreme Court directed the Ministry of Environment, Forest and Climate Change and the Ministry of Tribal Affairs to formulate a regulatory mechanism enabling dwelling construction for forest dwellers, ensuring FCA compliance. This directive emphasizes inter-departmental coordination and a balanced approach, reflecting a commitment to both social justice and environmental stewardship.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-balances-forest-rights-and-conservation.jpg"
  },
  {
    "title": "A Breach Too Far: Court Exonerates Insurer After Agricultural Tractor Used for Wedding Procession",
    "description": "<p>A protracted legal battle spanning over two decades, stemming from a 2004 tractor accident, recently concluded with a significant judgment by the Madhya Pradesh High Court. The case centered on the New India Insurance Company's liability when an agricultural tractor, insured solely for farming purposes, was involved in an accident while transporting wedding guests (Baratis), resulting in injuries to two pedestrians.</p>\n\n<p>The incident occurred on May 29, 2004, when a speeding tractor collided with Shivram Chaudhary and Sukhlal Chaudhary, causing various injuries. The 3rd Additional Motor Accidents Claims Tribunal initially awarded compensation of ₹30,000 to Shivram and ₹10,000 to Sukhlal, directing the insurer to pay with the liberty to recover the amount from the vehicle's owner and driver (a \"pay and recover\" order).</p>\n\n<p>Aggrieved by the tribunal's decision, three appeals were filed: Shivram Chaudhary sought enhanced compensation, while the insurance company challenged its liability entirely. The insurer argued a fundamental breach of policy terms, citing that the tractor, insured for agricultural use, was illegally transporting passengers. Furthermore, the driver allegedly lacked a valid license. The claimants contended the awarded compensation was insufficient given their sustained injuries and economic losses.</p>\n\n<p>The High Court, after meticulous examination, sided with the insurance company. It emphasized that the tractor's use for carrying wedding guests constituted a clear and fundamental deviation from its insured purpose, altering the risk profile significantly. Citing Supreme Court precedents, the court affirmed that insurers are not liable when vehicles are used in direct violation of core policy conditions, particularly when carrying unauthorized passengers. Consequently, the \"pay and recover\" doctrine was deemed inapplicable in this instance due to the deliberate and fundamental nature of the policy breach.</p>\n\n<p>While exonerating the insurance company, the High Court acknowledged the inadequacy of Shivram Chaudhary's original compensation. It enhanced his award to ₹50,000, factoring in his physical pain, medical expenses, and long-term impact on his livelihood. The final judgment directed the owner and driver of the tractor to jointly and severally deposit the full compensation amount, including the enhanced sum and interest, within 30 days. The insurance company was relieved of all liability, with provisions for refunding any amounts already deposited and recovering any sums paid to the claimant from the owner and driver.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/tractor-misuse-nullifies-insurance-mphcs-key-ruling.jpg"
  },
  {
    "title": "Family Members Have First Right to Buy Ancestral Property, Says Bombay High Court",
    "description": "<p>The Bombay High Court has affirmed the preferential right of family members to purchase ancestral property, particularly when it remains undivided, even if the selling co-parcener transfers their share to an outsider. This significant ruling arose from a dispute involving ancestral agricultural lands in Beed district, Maharashtra, where certain members of a joint Hindu family (Rathod family) sold portions of undivided property to external purchasers without offering it to the other co-parceners (Selukar family). The plaintiffs, the Selukar family, invoked Section 22 of the Hindu Succession Act, 1956, to assert their right of pre-emption, a claim previously upheld by the Trial Court.</p>\n\n<p>Justice Shailesh P. Brahme's analysis established that the properties were indeed undivided joint family holdings, confirming the plaintiffs and the original sellers as co-parceners. The Court clarified that while Section 22 specifically references Class I heirs, in the context of undivided joint family property, the right of pre-emption extends to all co-parceners sharing a common ancestral interest. A pivotal aspect of the judgment was the ruling that a separate declaration to set aside the sale deeds was not required; title automatically vests in the plaintiffs upon their deposit of the purchase consideration, as per Order XX Rule 14 of the Code of Civil Procedure. The High Court also upheld the lower court's decision to extend the payment timeline, recognizing that appellate proceedings had effectively stayed the original decree. Furthermore, the Court rejected the purchasers' reliance on Section 44 of the Transfer of Property Act, as they had not sought partition.</p>\n\n<p>Ultimately, the High Court dismissed both appeals, thereby confirming the concurrent findings of the Trial Court and the First Appellate Court. The plaintiffs were directed to deposit the purchase price, along with 6% simple interest, within ninety days. This decision is crucial as it reinforces the pre-emptive rights of co-parceners in undivided ancestral property, streamlining the process by removing the necessity of first canceling sale deeds and providing clarity on the application of Section 22 in such scenarios. It also highlights the judiciary's discretion to adjust timelines for decree execution when appeals delay proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-family-has-first-right-to-buy-ancestral-property.jpg"
  },
  {
    "title": "Supreme Court: Non-Resident Companies Liable to Tax in India Even Without Permanent Office",
    "description": "<p>The Supreme Court of India recently delivered a significant judgment in the case of Pride Foramer S.A. v. Commissioner of Income Tax, clarifying that non-resident companies can be deemed to be carrying on business in India even during periods of operational inactivity, thus remaining eligible for tax deductions and liable for tax on income accruing in India.</p>\n\n<p>The case involved Pride Foramer S.A., a French offshore oil drilling company, which experienced a lull in active contracts between 1993 and 1999. During this interim, despite operating from foreign offices and having no active projects, the company engaged in business correspondence, submitted bids, incurred various business-related expenses, and claimed deductions for these along with unabsorbed depreciation. The Income Tax Department, however, disallowed these claims, asserting that the company had ceased business operations during this inactive period.</p>\n\n<p>Reversing the High Court's decision, the Supreme Court affirmed the Income Tax Appellate Tribunal's view, distinguishing a \"lull\" from a \"cessation\" of business. The Court emphasized that a company's continuous intent and efforts to secure future contracts, such as submitting bids and maintaining business correspondence, demonstrate ongoing operations, irrespective of immediate contract acquisition. Crucially, the Court clarified that the absence of a permanent establishment or conducting business solely through foreign offices does not absolve a non-resident company from tax liability in India if income accrues or arises within the country. Consequently, the Court allowed the deduction of business expenses under Section 37 and permitted the carry-forward of unabsorbed depreciation under Section 32(2) of the Income Tax Act.</p>\n\n<p>This landmark judgment adopts a pragmatic and modern approach to assessing non-resident companies, reinforcing the principle of \"substance over form.\" It establishes that business continuity and entitlement to tax benefits are determined by a company's overarching conduct and intent, rather than merely by active contract periods or physical presence within India, thereby aligning with globalized trade dynamics.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-non-resident-companies-taxable-in-india-without-office.jpg"
  },
  {
    "title": "Section 17 or Article 226? Kerala High Court Slams the Door on Writ Route in SARFAESI",
    "description": "<p>The Kerala High Court, through a Division Bench, has unequivocally restated that borrowers cannot bypass the specialized statutory remedy under Section 17 of the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002 (SARFAESI Act) by directly filing a writ petition under Article 226 of the Constitution. This ruling emerged from a case involving a ₹16 lakh business loan from Kerala State Cooperative Bank, where a borrower sought the return of physically possessed mortgaged property on mere part-payment.</p>\n\n<p>The dispute arose after Jishith Kumar defaulted on a loan, leading the bank to classify his account as an NPA and subsequently take physical possession of the mortgaged property under Sections 13 and 14 of the SARFAESI Act. Despite having previously failed to honor a One Time Settlement (OTS) scheme facilitated by an earlier writ petition, the borrower filed a fresh writ, seeking restructuring and immediate release of the asset. A Single Judge initially directed the bank to return possession upon a payment of ₹4 lakh and an instalment plan, which the bank contested as exceeding judicial authority.</p>\n\n<p>The Division Bench, hearing the bank's appeal, meticulously examined the SARFAESI framework and numerous Supreme Court precedents. It concluded that the Single Judge's order effectively rewrote the contract and statute, and that the High Court, exercising writ jurisdiction, could not sit in appeal over a meticulously followed statutory process. The bench emphasized that the proper and sole avenue for the borrower to challenge the bank's actions after possession was taken was under Section 17 before the Debts Recovery Tribunal (DRT). It dismissed the argument that a bank's informal concession could override substantive statutory rights, affirming that equity follows the law.</p>\n\n<p>Consequently, the Division Bench set aside the Single Judge's judgment in its entirety and dismissed the writ petition as not maintainable. While reaffirming the judiciary's role in policing its own boundaries and prioritizing statutory discipline over judicial equity, the court clarified that its order does not prevent the borrower from approaching the DRT under Section 17 of the SARFAESI Act. This decision serves as a critical reminder for borrowers that the High Court is not the first forum for challenging SARFAESI proceedings, reinforcing the legislative intent of swift, non-interventionist recovery mechanisms for financial institutions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-no-writ-when-section-17-sarfaesi-remedy-exists.jpg"
  },
  {
    "title": "Dependents Beyond Legal Heirs Entitled to Compensation: MP High Court",
    "description": "<p>The Madhya Pradesh High Court, in a landmark decision in Smt. Saroj & Others v. Rajendra Prasad Patel & Others, significantly broadened the interpretation of \"legal representative\" under the Motor Vehicles Act, 1988. The case addressed whether individuals not strictly legal heirs, but demonstrably financially and emotionally dependent on the deceased, are entitled to compensation for a motor accident death. The High Court adopted a liberal and humanitarian approach, emphasizing that the Act is beneficial legislation designed to provide relief to victims and their dependents, transcending the technicalities of personal law.</p>\n\n<p>The case originated from a motor accident where Ramakant Patel died. His brother's widow, Smt. Saroj, and her daughter filed a claim, asserting that Ramakant had supported them financially and emotionally after her husband's demise. The Motor Accident Claims Tribunal rejected their claim, holding that as they were not legally wedded wife or biological child, they could not be legal heirs. However, the High Court overturned this, referencing the Supreme Court's ruling in N. Jayasree v. Cholamandalam MS General Insurance Co. Ltd., which states that \"legal representative\" is not confined to legal heirs but includes anyone demonstrating financial dependency, even without a formal marital relationship.</p>\n\n<p>The High Court affirmed that evidence clearly showed the deceased supported Smt. Saroj and her daughter, thus qualifying them as dependents and \"legal representatives\" under Section 166 of the Act. This judgment marks a progressive development in accident compensation jurisprudence, acknowledging the evolving social realities where dependency and familial bonds may extend beyond conventional definitions of marriage or heirship. It underscores that substantive justice should prioritize proven dependency and loss over rigid adherence to formal relationships, ensuring the compassionate intent of the Motor Vehicles Act is upheld.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/mp-hc-expands-legal-representative-in-accident-claims.jpg"
  },
  {
    "title": "Arms Act, 1959: Renewal is the Norm, Refusal the Exception, Rules Madras High Court",
    "description": "<p>The Madras High Court, in a significant ruling by its Madurai Bench, has clarified that while possessing a firearm is a regulated privilege under the Arms Act, 1959, the renewal of an existing licence, especially after peaceful use, should be considered the norm. Refusal of renewal, the Court asserted, must be based on explicit, rational, and case-specific findings, shifting the burden from the applicant to the licensing authority to provide compelling reasons.</p>\n\n<p>This judgment arose from a petition filed by Magudapathi, an ordinary citizen who held a smooth bore gun licence since 2021 for crop protection and sport, which had been routinely renewed once. His application for a second renewal in 2024 was denied by the District Magistrate cum District Collector, Dindigul, solely on the grounds that Magudapathi was facing prosecution under Section 304A of the Indian Penal Code for a fatal motor vehicle accident. The Collector deemed this a threat to \"public safety,\" prompting Magudapathi to challenge the decision in the High Court.</p>\n\n<p>Justice G.R. Swaminathan, examining Sections 13, 14, and 15 of the Arms Act, 1959, highlighted Section 15(3), which mandates that a licence \"shall, unless the licensing authority for reasons to be recorded in writing otherwise decides, be renewable.\" The Court emphasized that this provision converts the initial privilege into an expectancy of renewal, which can only be defeated by reasons that meet the standards of Section 14, pertaining to refusal. The High Court found the Collector's justification \"woefully insufficient,\" stating that a prosecution for negligent driving (Section 304A IPC) is distinct from firearm-related misconduct, nor does it indicate an individual is of unsound mind or unfit as per Section 14. Furthermore, the Court reiterated that while alternative remedies exist, it can intervene via writ jurisdiction when an impugned order is patently illegal.</p>\n\n<p>Consequently, the High Court quashed the Collector's order and directed the renewal of Magudapathi’s gun licence for five years, subject to standard conditions. This ruling serves as a crucial reminder that administrative discretion in weapon licensing tightens once a citizen has demonstrated trustworthy conduct, safeguarding individual expectation and ensuring a principled application of the Arms Act against arbitrary denials based on unrelated criminal proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-renewal-the-rule-refusal-the-exception-arms-act-1959.jpg"
  },
  {
    "title": "Rajasthan HC: Assignment under section 5 SARFAESI survives even if NPA tag quashed, guarantors can’t reopen decade-old ARC deal.",
    "description": "<p>The Rajasthan High Court, Jodhpur Bench, recently delivered a significant ruling affirming that a debt assignment under Section 5 of the SARFAESI Act, 2002, maintains its validity even if the Non-Performing Asset (NPA) classification, which triggered subsequent enforcement actions, is later quashed. In Harendra Singh Rathore & Ors. v. State Bank of India & Ors., Justice Rekha Borana refused to undo a 2014 debt assignment by SBI to Alchemist Assets Reconstruction Co., emphasizing that invalidating the NPA tag affects only Section 13 enforcement actions, not the independent prior sale of the loan under Section 5.</p>\n\n<p>This decade-long legal battle originated from a ₹24 crore debt incurred by Hotel Gaudavan Pvt. Ltd. in 2008, guaranteed by its director-shareholders. After the account became an NPA and was put up for sale, SBI assigned the debt to Alchemist ARC in 2014. Despite borrowers' attempts to challenge the proceedings through various forums, including a DRT ruling in 2015 that declared the original NPA classification illegal, the debt's ownership remained with the ARC. The guarantors subsequently sought to declare the 2014 assignment void, arguing that the quashing of the NPA rendered all subsequent actions, including the assignment, invalid.</p>\n\n<p>The High Court dismissed the guarantors' petition, primarily citing the principle of res judicata, as identical pleas had been rejected multiple times by various judicial bodies, up to the Supreme Court. The court reiterated that while Section 13 of the SARFAESI Act requires an NPA declaration for enforcement, Section 5, which deals with the transfer of financial assets, does not. Therefore, the 2015 DRT order invalidating the NPA only impacted possession proceedings, not the earlier, distinct assignment deed. Relying on the Supreme Court's ICICI Bank v. Official Liquidator of APS Star Industries judgment, the court affirmed that a debt is an asset transferable by a bank without borrower consent, irrespective of the NPA tag's correctness. The court also noted the availability of alternative statutory remedies for challenging recovery orders.</p>\n\n<p>This ruling provides crucial clarity and reassurance for lenders and Asset Reconstruction Companies. It firmly establishes that a bank's right to assign its loan under Section 5 of the SARFAESI Act is an independent power, not contingent on the ultimate fate of its internal NPA classification or the successful execution of Section 13 enforcement measures. Once a debt is assigned, courts will generally uphold the finality of that contract, strengthening the framework for managing and resolving bad assets within the financial system.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-upholds-sarfaesi-assignment-despite-npa-quash.jpg"
  },
  {
    "title": "IBC and Homebuyers Protection",
    "description": "<p>The article details the evolving landscape of homebuyers' rights under India's Insolvency and Bankruptcy Code (IBC). A pivotal 2018 amendment recognized real estate allottees as financial creditors, granting them participation and voting rights in the Committee of Creditors (CoC) during Corporate Insolvency Resolution Processes (CIRP). This move followed significant protests by homebuyers, who were initially excluded from meaningful engagement, leading to earlier regulatory adjustments by the Insolvency and Bankruptcy Board of India (IBBI) to facilitate their claims. Courts have consistently held that delays in property handover constitute a default under the IBC, necessitating developers to either deliver or return funds.</p>\n\n<p>Despite this progress, the Supreme Court's validation of the 2018 amendment in Pioneer Urban Land and Infrastructure Ltd. v. Union of India (2019) categorized homebuyers as unsecured creditors. This classification has been criticized for limiting their recovery prospects and decision-making power in comparison to secured financial institutions, which typically dominate the CoC. Practical administration reveals ongoing inequities, including the exclusion of homebuyers who fail to file claims on time and a significant disparity in interest rates, with homebuyers receiving a capped 8% per annum while lenders impose much higher rates. Regulatory measures, such as IBBI's Regulation 4-E, further empower project lenders by requiring substantial CoC approval for possession, potentially exacerbating homebuyer suppression.</p>\n\n<p>The Real Estate (Regulation and Development) Act (RERA), 2016, complements the IBC by mandating transparency, timely project completion, and offering recourse for delays. However, a deeper integration of these frameworks is needed. Legal scholarship and emerging jurisprudence advocate for elevating homebuyers to secured creditor status, citing their proprietary interest in specific flats and the statutory debt arising from non-delivery under RERA. While innovative judicial solutions like 'Reverse CIRP' have emerged to protect possession rights, a definitive consensus on granting homebuyers secured status remains elusive.</p>\n\n<p>Recent trends from 2023-2025 indicate some positive shifts, with the Supreme Court acknowledging verified claims for flat possession and urging the inclusion of unfiled but recorded claims. Nevertheless, systemic challenges persist, fueled by fragmented homebuyer groups, procedural complexities, opaque valuations, and the financial dominance of project lenders. Comprehensive reforms are crucial, including enhancing homebuyers' voting power, legally recognizing their secured status, equalizing interest rates, and empowering regulators to enforce transparency and penalize malfeasance, ultimately ensuring homebuyers' constitutional right to shelter is effectively upheld within the insolvency framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibc-and-homebuyers-evolving-rights-and-legal-protections.jpg"
  },
  {
    "title": "Orissa HC slams Cuttack bank for holding back gratuity over a loan guarantee—reaffirms Section 4(6) is the only key to forfeit gratuity dues.",
    "description": "<p>The Orissa High Court, in a Division Bench ruling on September 20, 2025, emphatically reiterated that gratuity can only be forfeited under the precise conditions stipulated in Section 4(6) of the Payment of Gratuity Act, 1972. The court admonished the Cuttack Central Cooperative Bank Ltd. for unlawfully withholding a retired employee's gratuity over her role as a personal guarantor for a defaulted loan, underscoring that superannuation does not permit such set-offs.</p>\n\n<p>The case originated when a Deputy Manager, who retired in 2010 after superannuation with an unblemished record, was denied her gratuity. The bank justified its action by citing her liability as a guarantor for a loan that later went unpaid. This decision was consistently overturned by the Controlling Authority, the Appellate Authority, and a Single Bench of the Orissa High Court before reaching the Division Bench as a writ appeal.</p>\n\n<p>The High Court dismissed the bank's appeal, emphasizing that Section 4(6) of the Act, which begins with a non-obstante clause, permits forfeiture only to the extent of damage or loss suffered by the employer if the employee was \"terminated\" for a wilful act, omission, or negligence causing such damage. Retirement on superannuation, the court clarified, is the antithesis of termination for misconduct, thus eliminating the statutory trigger for forfeiture. The court further held that introducing a guarantor's civil liability into the Act would constitute an unauthorized judicial expansion of its scope, reinforcing that gratuity is a statutory right earned through service, not a security deposit for credit.</p>\n\n<p>Concluding that three statutory forums had already reached the same conclusion without perversity, irrationality, or exceeding statutory remit, the court found no grounds for interference. This judgment serves as a critical reminder to all employers that the provisions of Section 4(6) of the 1972 Act are the sole gateway for gratuity forfeiture, strictly limited to proven misconduct and not extendable to civil liabilities like loan guarantees. The bank was consequently ordered to release the gratuity forthwith.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/orissa-hc-gratuity-cannot-be-withheld-for-loan-guarantee.jpg"
  }
]