[
  {
    "title": "The Capture Of Nicolás Maduro And International Law: Sovereignty, Force, And The Limits Of Power",
    "description": "<p>The hypothetical capture of Venezuelan President Nicolás Maduro by United States forces would represent a profound challenge to international law, despite being framed as a domestic law-enforcement action. This operation would directly violate core principles of state sovereignty, the prohibition on the use of force, and the absolute personal immunity afforded to sitting heads of state under customary international law.</p>\n\n<p>Article 2(4) of the UN Charter prohibits states from using force against another's territorial integrity, a principle reaffirmed by the International Court of Justice (ICJ). Exceptions like self-defense or Security Council authorization would not apply, as transnational criminal conduct doesn't constitute an \"armed attack.\" Furthermore, customary international law, as affirmed by the ICJ in Arrest Warrant, grants heads of state absolute immunity from foreign criminal jurisdiction. A unilateral armed seizure on foreign soil is akin to extraordinary rendition, not legitimate law enforcement, creating international responsibility irrespective of domestic prosecution.</p>\n\n<p>Such an operation, involving the forcible capture of a sitting head of state, could be deemed an act of aggression, profoundly interfering with a state’s political independence. While not every unlawful use of force escalates into war, this could be classified as aggression, especially within a wider pattern of coercive conduct. Historical parallels, like the U.S. capture of Manuel Noriega, are not legal precedents; that invasion was widely condemned by the UN General Assembly for violating sovereignty. Isolated, condemned state actions do not establish new customary international law or justify future violations.</p>\n\n<p>Venezuela's legal avenues would include proceedings before the ICJ (facing jurisdictional hurdles without U.S. consent), engaging the UN Security Council or General Assembly for political condemnation, or implementing proportionate diplomatic and economic countermeasures. Ultimately, such an act fundamentally undermines the UN Charter and risks eroding the international legal order by normalizing unilateral assertions of power over established legal constraints, blurring the line between law enforcement and armed coercion.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/capture-of-nicolas-maduro.jpg"
  },
  {
    "title": "The Delhi High Court Judgement On Domain Name Fraud: An Analysis Of Dabur India Limited V. Ashok Kumar",
    "description": "<p>The Delhi High Court, in Dabur India Limited v. Ashok Kumar, delivered a significant ruling against pervasive online domain name fraud and digital impersonation. The case exposed how weak identity verification mechanisms allow fraudsters to register domain names closely resembling well-known brands, like Dabur, and create cloned websites. These fraudulent sites deceive the public into paying \"registration fees\" for fake distributorships, franchises, or job opportunities, only to vanish and resurface with new, slightly altered domains, making traditional legal remedies ineffective.</p>\n\n<p>The court observed the widespread, organised nature of this fraud, affecting numerous companies beyond Dabur, with over 1,100 infringing domains identified where registrant details were often false or masked. Justice Pratibha M Singh acknowledged that domain names are critical commercial indicators and that such systematic deception, operating at scale and speed, necessitates structural solutions beyond isolated injunctions.</p>\n\n<p>To address these vulnerabilities, the Court mandated e-KYC verification for domain name registrants to introduce accountability and traceability. It also directed measures to tackle banking system weaknesses exploited by fraudsters. Crucially, the ruling granted Dabur a dynamic plus injunction, allowing the company to tackle future deceptive domain variants without instituting fresh lawsuits. This judgment marks a pivotal shift from reactive adjudication to preventive regulation, strengthening enforcement for rights holders and offering greater protection to consumers by addressing the fraud at its source: the domain registration process.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/domain-name-fraud-and-e-kyc-mandate.jpg"
  },
  {
    "title": "Remand And The Duty Of Fresh Decision: Supreme Court Clarification",
    "description": "<p>In RattanIndia Power Limited vs MSEDCL (2025), the Supreme Court clarified crucial aspects concerning remand proceedings, appellate finality, and the computation of carrying costs, particularly regarding compounding interest. RattanIndia sought compensation for 'Change in Law' events under a Power Purchase Agreement (PPA), with the dispute centering on the application of Late Payment Surcharge (LPS) rates and whether compounding interest should apply.</p>\n\n<p>The Court held that a remand for fresh consideration does not freeze the legal position; adjudicatory bodies must apply prevailing law, as the \"lis\" remains active during the remand period. It deemed MSEDCL's failure to cross-appeal APTEL's grant of carrying costs at LPS rates as making that aspect final and unchallengeable.</p>\n\n<p>Regarding compounding interest, the SC clarified that while LPS rates applied, compounding is not automatic. It requires a specific factual assessment, such as whether the affected party incurred financing costs with monthly rests. The Court found APTEL erred by denying compounding on the erroneous assumption that the previous remand order precluded such consideration, rather than on factual merit.</p>\n\n<p>Consequently, the SC partly allowed the appeal, remanding the matter to APTEL for a fresh factual determination on compounding interest. This judgment reinforces that remand proceedings are not static, requiring adjudicatory bodies to consider evolving legal principles. It also underscores the finality of unchallenged appellate findings and adopts a nuanced approach to restitution, requiring a factual basis for compounding interest, rather than automatic application.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/remand-orders-duty-of-fresh-decision.jpg"
  },
  {
    "title": "Bollywood vs South Industry: How Each Industry Navigates Legal Challenges",
    "description": "<p>India's Bollywood and South Indian film industries, though creative powerhouses, navigate unique legal challenges stemming from their distinct filmmaking processes and business cultures. Bollywood, a star-driven industry known for adapting international stories, life rights, and books, has historically faced criticism for unauthorized adaptations and complex intellectual property disputes. Its music rights landscape is contentious, often involving multiple labels and composers, leading to prolonged litigation. Contractual conflicts over remuneration and exclusivity, often lacking standardized agreements, frequently escalate to formal courts, establishing precedents but causing significant delays.</p>\n\n<p>The South Industry, conversely, prioritizes original, culturally rooted, hero-centric narratives and regional remakes. It emphasizes proper IP licensing, as seen with franchises like Baahubali, and features a more streamlined music rights environment with fewer dominant labels. Its tighter producer-actor networks, often rooted in regional connections, facilitate internal mediation through bodies like the Telugu Film Chamber of Commerce, leading to faster, industry-specific resolutions that prioritize preserving professional relationships over lengthy court battles.</p>\n\n<p>Both industries confront the complexities of digital platforms, battling persistent piracy, territorial licensing disputes, and ownership conflicts with streaming services. While Bollywood's reliance on formal legal processes offers rigor and establishes valuable precedents, Tollywood's emphasis on arbitration and industry-mediated settlements provides speed and flexibility. Ultimately, success lies in combining these strengths—the rigor of formal processes with the efficiency of internal mediation—to prevent disputes, safeguard creative work, and ensure fair compensation in an evolving global and digital landscape.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bollywood-south-legal-challenges.jpg"
  },
  {
    "title": "Shared Custody Does Not Dilute Maintenance Obligations: Delhi High Court",
    "description": "<p>The Delhi High Court recently ruled that a husband's obligation to maintain his wife and minor child is not diminished by shared custody arrangements. This significant judgment clarifies that maintenance is a statutory right, rooted in dignity and dependency, distinct from custodial agreements, and reinforces a settled principle often misunderstood in family law.</p>\n\n<p>The case arose from a husband appealing an interim maintenance order, arguing his liability should be reduced as he bore expenses for one child in his custody, while the other resided with the mother. The Court rejected this plea, affirming that incurring costs for one child does not absolve his duty to support the wife and the other dependent child. It upheld the order, directing him to pay ₹17,500 per month.</p>\n\n<p>The Court's reasoning emphasized that maintenance under Section 125 CrPC is a statutory duty to prevent destitution and ensure dignity, not a negotiable benefit. It clearly distinguished custody, governing physical care, from maintenance, addressing financial dependency, asserting they cannot be conflated. Shared custody does not imply equal financial capacity or justify a mechanical division of maintenance, which must instead be determined through a holistic assessment of earning capacity, resources, and actual dependency. Crucially, a child's right to maintenance was recognized as independent and paramount, irrespective of custodial arrangements.</p>\n\n<p>This ruling has crucial implications, preventing the misuse of shared custody as a ground to reduce or avoid maintenance and providing clear guidance to Family Courts. It reinforces that financial support is based on need and capacity, not \"custodial arithmetic,\" thereby strengthening financial protection for dependent spouses and children. The judgment underscores that maintenance law is a safeguard for welfare and social justice, not a negotiable liability subject to private calculations.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/shared-custody-no-reduce-maintenance.jpg"
  },
  {
    "title": "The Inalienability Of Ownership: A Jurisprudential Analysis Of Tenancy And Title Preservation In India",
    "description": "<p>Indian property law definitively establishes that long-term possession, such as tenancy, does not automatically confer ownership rights. This fundamental principle is upheld by the Transfer of Property Act (TPA) 1882, the Indian Evidence Act 1872, and consistent Supreme Court rulings. Ownership, defined as an exhaustive \"bundle of rights\" including disposal, is distinct from a lease, which merely grants a limited \"right to enjoy\" the property. Even a perpetual lease does not transfer absolute title, and tenants are legally obligated to return the property to the landlord.</p>\n\n<p>A crucial legal barrier to tenants claiming ownership is the doctrine of estoppel, codified in Section 116 of the Indian Evidence Act. This prevents tenants from denying their landlord's title during the tenancy. The maxim \"Once a tenant, always a tenant\" signifies that a tenant's status remains unchanged by the passage of time or non-payment of rent, unless legally altered by a new contract.</p>\n\n<p>Furthermore, the doctrine of adverse possession, which requires \"hostile, open, and continuous\" occupation for 12 years, does not apply to tenants, as their possession is \"permissive,\" not hostile. Recent Supreme Court judgments, including Jyoti Sharma v. Vishnu Goyal (2025), have unequivocally reaffirmed that decades of occupation do not convert tenancy into ownership, upholding the \"cardinal estoppel.\"</p>\n\n<p>While state Rent Control Acts provide statutory protections to tenants, these confer personal rights to occupy, not proprietary interests. The Model Tenancy Act, 2021, aims to formalize rental agreements and expedite landlord repossession. Indian jurisprudence consistently safeguards absolute ownership, ensuring that the contractual nature of tenancy remains a steadfast barrier to acquiring title through mere duration of stay.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/adverse-possession-title.jpg"
  },
  {
    "title": "India’s Insurance Law Reforms 2025: An Overview Of The Insurance 2.0 Framework",
    "description": "<p>India's Sabka Bima Sabki Raksha (Amendment of Insurance laws) Bill, 2025, or \"Insurance 2.0 Framework,\" introduces comprehensive reforms to modernize the sector. This legislative intervention aims to achieve \"Insurance for all,\" boost capital availability, enhance regulatory efficiency, improve governance standards, and strengthen policyholder protection. The reforms seek to reposition India within the global insurance ecosystem by addressing structural constraints like foreign ownership limits and rigid transaction frameworks.</p>\n\n<p>Key reforms include increasing Foreign Direct Investment (FDI) in Indian insurers to 100% from the previous 74%, designed to unlock foreign capital and scale operations. To attract global reinsurers, the net owned fund requirement for foreign reinsurance branches is significantly reduced to INR 1,000 crore. The Bill also streamlines corporate actions by raising the IRDAI approval threshold for share transfers from 1% to 5% and expands the Mergers & Amalgamations framework to allow non-insurance business integration, facilitating group restructuring.</p>\n\n<p>The framework lays the groundwork for composite insurance licenses, potentially allowing insurers to operate across life, health, and general segments, fostering diversification. Regulatory flexibility is enhanced, empowering IRDAI to prescribe general commission caps, replacing product-specific limits. The definition of \"insurance business\" is expanded to include value-added and ancillary services. Governance is strengthened by broadly prohibiting directors or officers from serving simultaneously in other insurers of the same class, banking, or investment companies, preventing conflicts of interest.</p>\n\n<p>Policyholder protection is bolstered through enhanced data collection requirements and formal mechanisms for accessing policy and claims data with consent. The reforms formally recognize new intermediaries, such as Managing General Agents (MGAs) and insurance repositories, promoting specialized participation and niche product development. Operational efficiency is improved via one-time registration for intermediaries (replacing three-year renewals), formal recognition of online premium payments, and mandatory corporate naming conventions.</p>\n\n<p>These reforms signify a structural recalibration of India's insurance sector, combining market liberalization with strengthened regulatory oversight. Their successful implementation, dependent on clear and consistent regulations, is crucial for deepening insurance penetration, promoting sustainable growth, and reinforcing India's position as a competitive and well-regulated insurance market.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indias-insurance-2-0-framework.jpg"
  },
  {
    "title": "No Automatic Consumer Liability For Brand Ambassadors: Kerala High Court On Unfair Trade Practices",
    "description": "<p>The Kerala High Court, in a significant judgment in Actor Mohanlal Vishwanath vs. State of Kerala and Anr., clarified that celebrity endorsers cannot be automatically held liable in consumer complaints alleging unfair trade practices or deficiency of service solely based on their appearance in advertisements. The ruling emphasizes that liability under consumer law must be anchored to statutory mandate and direct transactional involvement.</p>\n\n<p>The case stemmed from a complaint against actor Mohanlal, who was the brand ambassador for Manappuram Finance. Complainants, purportedly influenced by advertisements featuring Mohanlal, availed a gold loan but later alleged they were charged a higher interest rate than advertised. Consequently, they impleaded Mohanlal as an opposite party in their consumer complaint, attributing his involvement solely to his endorsement of the company. The District and State Consumer Commissions had previously upheld the maintainability of the complaint against him.</p>\n\n<p>The High Court overturned these decisions, asserting that a direct legal nexus between the endorser and the consumer transaction is crucial for imposing liability in cases of unfair trade practice or service deficiency. The court found no direct link between Mohanlal and the loan transaction, noting that assurances regarding interest rates were attributed to the finance company, not to the endorser's independent representations. It underscored that mere \"endorser\" status does not automatically create liability for service deficiencies.</p>\n\n<p>The judgment further elucidated that Section 21 of the Consumer Protection Act, 2019, provides a specific, self-contained mechanism for addressing misleading advertisements, including provisions for due diligence defenses for endorsers. Therefore, liability for deficiency of service properly rests with the service provider. While the complaint against Mohanlal was deemed not maintainable, the complainants retain their remedies against the finance company and are at liberty to pursue claims concerning misleading advertisements under Section 21 before the competent authority. This ruling draws a clear doctrinal boundary, ensuring liability aligns with transactional involvement rather than mere association.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/consumer-liability-celebrity-endorser.jpg"
  },
  {
    "title": "From Fortuity To Equality: SC Declares Post-Death Widowhood No Bar To Claim Under Sections 21 & 22, Hindu Adoptions & Maintenance Act",
    "description": "<p>The Supreme Court of India, in Kanchana Rai v. Geeta Sharma & Uma Devi v. Geeta Sharma, has decisively ruled that a daughter-in-law widowed after her father-in-law's death is a \"dependant\" under Section 21(vii) of the Hindu Adoptions & Maintenance Act, 1956 (HAMA) and can claim maintenance from his estate under Section 22. This judgment, delivered by Justices Pankaj Mithal and S.V.N. Bhatti, effectively removes the temporal coincidence of widowhood as a precondition, reinforcing HAMA's overarching mission to protect vulnerable relatives.</p>\n\n<p>The case originated from the estate of Dr. Mahendra Prasad. His daughter-in-law, Geeta Sharma, became a widow after Dr. Prasad's demise and sought maintenance. The Family Court initially dismissed her petition, interpreting \"any widow of his son\" in Section 21(vii) narrowly to exclude widows whose husbands survived the father-in-law. The High Court reversed this, stating the expression was not temporally qualified. Appellants Kanchana Rai and Uma Devi argued for a narrower reading, citing testamentary freedom and contending that Section 19's personal obligation on the father-in-law extinguished upon his death.</p>\n\n<p>The Supreme Court affirmed the High Court's decision, emphasizing that the legislature's omission of \"predeceased\" in Section 21(vii) was deliberate. A restrictive interpretation, the Court reasoned, would violate Article 14 by creating an irrational classification lacking a rational nexus to the Act's protective objective and Article 21 by threatening the right to life with dignity. The Court stressed that social welfare legislation like HAMA prevails over testamentary autonomy, and Section 22 establishes an enduring charge on the estate, reflecting heirs' pious obligation to uphold the deceased's moral duties. The appeals were dismissed, reinstating the direction for the Family Court to quantify Geeta Sharma's maintenance, underscoring that wills cannot override the fundamental economic safety net guaranteed to statutory dependants.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/post-death-widowhood-hama-maintenance.jpg"
  },
  {
    "title": "When Identity Becomes Commodity: Personality Rights In The Digital Age",
    "description": "<p>The digital age and artificial intelligence have dramatically increased the commercial exploitation of personal identity in India, propelling the significance of personality rights—an individual's right to control the commercial use of their name, likeness, and voice. Despite a surge in cases involving unauthorized use, deepfakes, and AI-generated content, India currently lacks a dedicated statutory framework, compelling affected individuals to rely on fragmented legal provisions.</p>\n\n<p>Indian courts have incrementally developed personality rights from constitutional principles, tort law, and intellectual property. Landmark judgments like Justice K.S. Puttaswamy v. Union of India affirmed privacy as a fundamental right, laying the groundwork for identity control. Subsequent cases such as D.M. Entertainment and Titan Industries recognized the independent commercial value inherent in a celebrity's persona. Recent rulings involving Amitabh Bachchan, Anil Kapoor, and Aishwarya Rai Bachchan have issued injunctions against the misuse of names, images, voices, and even mannerisms, particularly when enhanced by AI technologies. The Kamal Haasan case further introduced \"John Doe\" injunctions, offering pre-emptive protection against anticipated digital exploitation.</p>\n\n<p>However, judicial protection for personality rights has limits. The Siddiqua Begum Khan v. Union of India case (Shah Bano) unequivocally established that personality rights, including privacy and reputation, are personal to an individual and extinguish upon death. This ruling rejected posthumous claims by legal heirs, highlighting a distinct contrast with the robust protection afforded to living individuals.</p>\n\n<p>Currently, remedies against deepfakes and AI-driven identity misuse are piecemeal, drawing upon copyright law, trademark law, and select sections of the Information Technology Act, 2000, alongside administrative advisories from MeitY. This regulatory vacuum underscores an urgent need for comprehensive legislation to directly address consent, commercial exploitation, and AI-driven replication of personality in the digital age, moving beyond reactive judicial pronouncements.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/personality-rights-in-digital-age.jpg"
  },
  {
    "title": "The Great Indian Bustard Judgment: Redefining Corporate Social Responsibility As Environmental Duty",
    "description": "<p>The Supreme Court's landmark judgment in M.K. Ranjitsinh & Others v. Union of India has fundamentally redefined Corporate Social Responsibility (CSR) in India, transforming it from a mechanism of voluntary welfare into a mandatory Corporate Environmental Responsibility (CER). Delivered in response to the critically endangered Great Indian Bustard (GIB), this ruling establishes CSR as a constitutional and fiduciary obligation, integrating ecological preservation with corporate economic activities.</p>\n\n<p>The litigation stemmed from the precipitous decline of the GIB, primarily due to collisions with overhead power lines from energy projects. While an earlier interim order restricted such lines, the Union Government sought modification citing renewable energy commitments. The Court then appointed an Expert Committee, whose recommendations form the basis of this judgment.</p>\n\n<p>The Court's reasoning is rooted in constitutional duties (Articles 48A, 51A(g)), Companies Act provisions (Sections 135, 166), and environmental principles like Polluter Pays. It categorically states that corporate profit is partly owed to the society and environment enabling its generation, asserting that \"Social Responsibility\" must inherently include \"Environmental Responsibility.\" Directors' fiduciary duties now explicitly encompass environmental protection, shifting from shareholder primacy to a broader stakeholder view.</p>\n\n<p>The judgment approves revised GIB priority conservation areas (14,013 sq. km. in Rajasthan, 740 sq. km. in Gujarat). Within these zones, it prohibits new renewable energy projects and new overhead power transmission lines (except 11 KV and below). For existing high-voltage lines, it directs an action plan for undergrounding or installing bird diverters. It also mandates intensified in-situ conservation efforts, linking them directly to CSR funding. This ruling ensures that economic development respects ecological limits, positioning corporations as trustees of ecosystems and obligating them to constitutional stewardship, not merely charity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/csr-as-environmental-duty-gib-case.jpg"
  },
  {
    "title": "From Choice To Compliance: Regulating Live-In Relationships In India’s Emerging Legal Order",
    "description": "<p>Indian constitutional law previously treated live-in relationships as private matters, intervening only for protection, not permission, upholding adult autonomy under Article 21. Landmark judgments like Lata Singh and S Khushboo emphasized non-interference, refusing to criminalize cohabitation and warning against using criminal law for social morality. Legal protections, such as those \"in the nature of marriage,\" were welfare-driven, triggered by vulnerability, and did not mandate registration. This approach reflected a deliberate constitutional design focused on liberty through non-intervention.</p>\n\n<p>However, this judicial settlement is unravelling, marking a decisive shift towards state regulation. Uttarakhand’s Uniform Civil Code (2025) transforms live-in relationships into registrable legal events, requiring couples to notify the State, disclose personal details, and formally record termination, with criminal penalties for non-compliance. Justified as protection, this regime preemptively presumes risk, acting as a licensing mechanism for intimacy. This contravenes the Puttaswamy judgment's emphasis on decisional autonomy and proportionality; a right conditioned on disclosure becomes permission, not an inherent liberty.</p>\n\n<p>Further, Section 69 of the Bharatiya Nyaya Sanhita 2023 criminalizes sexual relations obtained by \"deceitful means,\" specifically including unfulfilled promises of marriage. This provision risks conflating emotional uncertainty with dishonest intent at a relationship's inception, a distinction Indian courts previously maintained. It invites retrospective reconstruction of intent, potentially converting private relational history and relationship breakdowns into penal liability, a task for which criminal law is ill-suited due to its demand for certainty.</p>\n\n<p>Ironically, existing welfare mechanisms like maintenance and domestic violence remedies continue to operate without requiring registration or criminal complaints, creating a \"constitutional schizophrenia\" where the State simultaneously trusts and distrusts adults. This emerging framework, though framed as protective, revives moral governance through bureaucratic and criminal means. It replaces autonomy with audit, recasts relational uncertainty as criminal deceit, and risks transforming personal failure into penal liability. This shift raises fundamental questions about privacy, proportionality, and the constitutional limits of state power, signaling that constitutional liberty might be quietly rewritten if intimacy requires declaration for protection and choice must be justified to avoid punishment.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/live-in-relationships-in-india.jpg"
  },
  {
    "title": "Unilateral Appointments on Trial: The Supreme Court’s Reaffirmation of Arbitrator Neutrality",
    "description": "<p>The Supreme Court of India, in Bhadra International (India) Pvt. Ltd. & Ors. v. Airports Authority of India, significantly reaffirmed the mandatory nature of Section 12(5) of the Arbitration and Conciliation Act, 1996. This judgment strictly prohibits unilateral arbitrator appointments by parties with a controlling interest, reinforcing the foundational principles of neutrality, independence, and equality in arbitral proceedings, consistent with post-2015 arbitration jurisprudence.</p>\n\n<p>The dispute arose from licence agreements where the Airports Authority of India (AAI) appointed a sole arbitrator, despite its Chairman (who made the appointment) falling under the Seventh Schedule's ineligibility criteria. The appellants, initially participating in proceedings, later challenged the appointment under Section 12(5) during Section 34 applications.</p>\n\n<p>The Court examined three critical issues: the arbitrator's ineligibility under Section 12(5), whether the appellants waived this right, and if the challenge was maintainable at the Section 34 stage. It held that Section 12(5), with its non-obstante clause, renders such unilateral appointments void ab initio, as the AAI Chairman was statutorily ineligible to appoint an arbitrator.</p>\n\n<p>Crucially, the Court ruled that waiver of Section 12(5) requires an \"express agreement in writing\" entered into after disputes have arisen. Mere participation, silence, or a \"no objection\" recorded in procedural orders is insufficient to waive this mandatory statutory protection. Furthermore, such fundamental ineligibility constitutes a de jure inability under Section 14(1)(a), meaning the challenge can be raised at any stage, including Section 34 proceedings, as it invalidates the entire arbitral process.</p>\n\n<p>By allowing the appeals and setting aside the award, the Supreme Court emphasized that party autonomy must yield to statutory safeguards ensuring fairness and eliminating perceived bias. This robust ruling fortifies the credibility of Indian arbitration, cautioning practitioners and contracting parties to ensure arbitration clauses and appointment mechanisms strictly adhere to statutory requirements to prevent the nullification of proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/unilateral-arbitrator-appointments.jpg"
  },
  {
    "title": "Unjust Enrichment Post-Resolution: Justice Sundaresan Holds Award-Creditor Cannot Keep Money that No Longer Exists in Law",
    "description": "<p>The Bombay High Court, in a significant ruling by Justice Somasekhar Sundaresan in Reliance Naval & Engineering Ltd. v. Afcons Infrastructure Ltd., addressed the intersection of arbitration and insolvency law. The judgment held that an award-creditor, having withdrawn a court deposit, must return the funds if the underlying claim is subsequently extinguished by an approved resolution plan under the Insolvency & Bankruptcy Code (IBC), citing unjust enrichment.</p>\n\n<p>The case involved Reliance Naval, a corporate debtor, against whom an arbitral award of ₹49.11 crores was passed in favor of Afcons Infrastructure. While challenging the award, Reliance deposited ₹12.76 crores in court, which Afcons withdrew after furnishing a bank guarantee, thus making the withdrawal conditional. Subsequently, Reliance entered corporate insolvency resolution, and its approved plan reduced Afcons' claim to a symbolic Re. 1, extinguishing the original debt and providing a \"clean slate\" to the corporate debtor. Reliance then sought the return of the withdrawn amount.</p>\n\n<p>Reliance argued that the finality of the resolution plan extinguished Afcons' entitlement, making the money, as a corporate debtor's asset, revert to the resolution applicant. Afcons countered that the money ceased to be Reliance's asset post-withdrawal and that the bank guarantee protected its interest.</p>\n\n<p>Justice Sundaresan ruled that upon approval of the resolution plan, Afcons' claim, deemed a \"debt\" under IBC, stood statutorily expunged. Continued retention of the withdrawn sum would therefore constitute unjust enrichment. The Court clarified that the custodia legis principle merely regulates the fund's physical location, not its beneficial ownership. When the award's substratum vanished, the condition for withdrawal failed, necessitating restoration of the money. However, the Court rejected Reliance's claim for interest, deeming it a new cause of action beyond the scope of an interim application in an infructuous Section 34 petition.</p>\n\n<p>Consequently, Afcons was directed to re-deposit the sum, failing which its bank guarantee would be invoked. This decision reaffirms that an approved resolution plan overrides pre-existing adjudicatory labels, and funds held in court are not immune from the IBC's statutory waterfall mechanism, ultimately reverting to the corporate debtor's revitalized assets.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/unjust-enrichment-after-ibc-resolution.jpg"
  },
  {
    "title": "Unauthorized Promotion And Promoter Liability Under RERA: “Coming Soon” Is Still Advertising",
    "description": "<p>The Real Estate Regulatory Authority (RERA), Bihar, imposed a penalty on M/s Alphabet Infra Pvt. Ltd. for advertising its \"One World, Brahmapura Railway Colony\" project prior to obtaining statutory registration, a direct contravention of Section 3(1) of the Real Estate (Regulation and Development) Act, 2016. RERA initiated proceedings after promotional materials for the unregistered project appeared.</p>\n\n<p>The Authority affirmed that the Act’s comprehensive definition of \"advertisement\" (Section 2(b)) includes all promotional efforts, such as \"Coming Soon\" displays, intended to solicit interest. It dismissed the respondent's defense that \"Alphapet Infra\" was merely a brand label, not the promoter, and that the signs were for identification. RERA clarified that liability under Section 3 applies to any entity involved in promoting an unregistered project, regardless of such distinctions.</p>\n\n<p>RERA underscored that project registration is a mandatory, threshold obligation to ensure transparency and consumer protection, which cannot be negated by claims of preliminary registration steps or subsequent remorse. Consequently, a penalty of ₹1,00,000 was levied under Section 59(1). This ruling solidifies RERA's \"bright-line rule\" that no advertising or promotional activity is permissible before a project is duly registered, emphasizing the critical need for strict compliance from all real estate developers and their affiliates.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rera-penalise-pre-registration-promo.jpg"
  },
  {
    "title": "IP Insights: How The DLI Scheme Is Shaping India’s Semiconductor IP Ecosystem",
    "description": "<p>The Design Linked Incentive (DLI) Scheme, a key initiative under India's Semicon India Programme by MeitY, strategically aims to bolster the domestic semiconductor ecosystem by fostering the creation, ownership, and commercialization of indigenous Intellectual Property (IP). Recognizing semiconductor design as the most IP-intensive segment of the chip value chain, the DLI Scheme ensures that valuable IP generated with public support remains anchored within India, reducing reliance on foreign technologies and advancing technological sovereignty.</p>\n\n<p>The scheme provides financial incentives, covering up to 50% of eligible design expenditure and 30% for product deployment, alongside crucial access to Electronic Design Automation (EDA) tools and prototyping infrastructure. It is open to Indian startups, MSMEs, domestic companies, and research institutions. While beneficiaries retain IP ownership, the scheme mandates IP generation and patent filings within India, balancing private rights with national accountability.</p>\n\n<p>Since its launch in 2021, the DLI Scheme has shown significant progress. It has supported over 50 beneficiaries, leading to the development of 28 IPs/SoCs, over 100 patent filings, and more than 10 silicon tape-outs. Success stories include Vervesemi Microelectronics with its motor-control chips and 10 patents, InCore Semiconductors developing indigenous RISC-V processor IPs, Netrasemi's indigenously designed 12nm AI SoC, Aheesa Digital Innovations' fiber-broadband solutions, and AAGYAVISION's radar-on-chip solutions. These achievements demonstrate the scheme's effectiveness in translating indigenous design capabilities into market-ready semiconductor products.</p>\n\n<p>In conclusion, the DLI Scheme represents a strategic shift towards IP-led semiconductor growth. By lowering entry barriers and mitigating financial risks for innovators, it significantly contributes to India’s objectives of technological self-reliance and enhanced competitiveness in the global semiconductor design landscape.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indian-dli-scheme-for-semiconductor.jpg"
  },
  {
    "title": "Financial Interest Is Not Consent: Limits on Impleading Non-Signatories in Arbitration",
    "description": "<p>The jurisprudence on impleading non-signatories in arbitration, especially post-Cox and Kings Ltd. v. SAP India Pvt. Ltd., emphasizes a balance between expanding arbitral jurisdiction and preventing its indiscriminate use. The Himachal Pradesh High Court, in Indian Institute of Technology, Mandi v. Central Public Works Department & Anr., reinforced that mere financial interest or project ownership does not constitute consent to arbitrate.</p>\n\n<p>The case involved IIT Mandi, which entered an MoU with CPWD for construction. CPWD then independently contracted a private contractor, with this contract containing an arbitration clause. When disputes arose between CPWD and the contractor, IIT Mandi sought impleadment in the arbitration, arguing a direct financial interest as any award against CPWD would ultimately be borne by IIT Mandi under their MoU. IIT Mandi contended that denial would violate natural justice and cited Supreme Court rulings on non-signatory binding. The contractor opposed, highlighting IIT Mandi's non-signatory status and lack of involvement in their contract.</p>\n\n<p>Both the arbitrator and the High Court rejected IIT Mandi's application. The High Court affirmed that arbitration is fundamentally consensual. IIT Mandi was not a signatory to the construction contract or its arbitration clause, and its MoU with CPWD was a distinct agreement. The Court ruled that financial consequences arising from a separate agreement do not automatically grant a non-signatory procedural rights in an unrelated arbitral proceeding. No express or implied consent by IIT Mandi to arbitrate with the contractor was found.</p>\n\n<p>This judgment signifies that the expansion of arbitration to non-signatories is an exception, not the rule. Courts will guard against transforming arbitration into multi-party civil litigation based solely on indirect financial implications. It cautions project owners and government bodies that downstream financial liability does not inherently confer arbitral procedural rights unless supported by clear contractual intent and conduct. Consent, whether express or implied, remains the cornerstone of arbitral jurisdiction; financial interest alone is legally insufficient.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/financial-interest-not-consent.jpg"
  },
  {
    "title": "From Builder Control to Resident Empowerment: The New Occupancy Certificate Framework",
    "description": "<p>The Maharashtra Government has enacted a significant reform, empowering housing societies to directly apply for Occupancy Certificates (OCs), addressing a critical issue where developers often failed to secure them. An OC is crucial for legal occupation, confirming a building's compliance with essential services. Historically, developers held exclusive rights to apply, frequently leading to misuse of power and leaving residents in Mumbai and MMR vulnerable to legal, financial, and redevelopment risks due to uncertified properties.</p>\n\n<p>Under the new initiative, over 25,000 buildings, including those under BMC, MHADA, and SRA, can now seek full or partial OCs, either jointly or independently. A six-month window offers penalty waivers for timely applications, though premiums apply for utilized additional FSI. This policy aims to simplify compliance for over 10 lakh residents by offering premium discounts and easing administrative hurdles. It fundamentally shifts control from developers to residents, acknowledging that many buildings are already occupied and tax-paying, while still upholding safety and structural integrity checks.</p>\n\n<p>This reform streamlines redevelopment for older properties, provides an alternative compliance route for projects outside RERA, and significantly boosts marketability and title certainty—factors vital for lenders, buyers, and insurers. Although it doesn't imply legal amnesty and applications may be rejected for major non-compliances, it empowers societies to collectively resolve long-standing issues. The move is expected to enhance buyer confidence, mitigate conflicts, and ultimately elevate housing standards across Maharashtra, marking a pivotal step towards lawful regularization and seamless urban development.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/maharshtra-new-occupancy-certificate.jpg"
  },
  {
    "title": "IBBI's Hybrid Regime for CIRP Compliance",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has introduced a hybrid regime for Corporate Insolvency Resolution Process (CIRP) compliance through its December 2025 circular. This follows the May 2025 update to CIRP forms and a temporary late fee exemption until December 31, 2025. The new circular operationalizes an OTP-authenticated \"Modification Utility\" on the IBBI portal, enabling Insolvency Professionals (IPs) to self-correct errors in previously filed forms without resorting to formal amendment routes. Corrections made before a form's statutory due date incur no penalty. However, modifications submitted after the due date are treated as new, delayed submissions, incurring a fee.</p>\n\n<p>Concurrently, the circular reactivates delayed filing levies from January 1, 2026, lifting the earlier suspension. For any form whose due date fell on or before December 31, 2025, but is ultimately submitted (whether original, corrected, or updated) on or after January 1, 2026, IPs must pay ₹500 per form per month of delay, exclusive of GST. This fee is automatically computed and collected electronically. An IP correcting a timely 2025 filing in 2026 will pay this fee, which attaches to the calendar month of the eventual re-upload. This regime combines procedural facilitation with economic deterrence, incentivizing early rectification and ensuring both accuracy and punctuality in CIRP filings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-allows-cirp-corrections-without-penalty-until-dec-31.jpg"
  },
  {
    "title": "Landmark Judgments in Arbitration (2025)",
    "description": "<p>The year 2025 witnessed several significant rulings in arbitration law across Indian courts. The Supreme Court notably affirmed that parties' conduct and correspondence can bind them to an unsigned arbitration agreement, rejecting attempts to escape terms based on a lack of signature. It also clarified that High Courts cannot review their Section 11 orders appointing arbitrators once the process has substantially progressed, upholding the principle of minimal judicial interference. Regarding the determination of governing law for arbitration agreements without explicit choice, the Court adopted the \"closest and most real connection\" test, generally linking it to the underlying contract's governing law. Furthermore, the Supreme Court ruled against appointing an arbitrator for non-parties to a contract under Section 11 and established the maintainability of writ petitions against Micro, Small and Medium Enterprises Development Act (MSMED Act) orders if the council acts without jurisdiction or violates natural justice.</p>\n\n<p>The Bombay High Court held that disputes arising from an ancillary agreement, even without an arbitration clause, could be referred to arbitration if the main agreement contains one, and confirmed that bilateral fraud allegations are arbitrable. Conversely, it ruled that disputes concerning the enforcement of mortgage rights are non-arbitrable due to involving rights in rem. The Court also permitted the partial setting aside of an arbitral award, specifically removing personal liability imposed on Designated Partners of an LLP while affirming the award against the LLP itself.</p>\n\n<p>The Delhi High Court, in its rulings, clarified that an exclusive jurisdiction clause in an agreement prevails over subsequent communications merely designating a different arbitration venue, asserting that the designated seat governs jurisdiction. It also declined to re-refer a claim to arbitration under Section 11 when a previous tribunal had already found no evidence to support it, preventing re-agitation of conclusively decided matters. Crucially, the Delhi High Court granted an anti-arbitration injunction in a foreign-seated arbitration, emphasizing its power to intervene in \"blatantly vexatious, unconscionable, oppressive\" proceedings or those violating public policy, such as an arbitrator's non-disclosure of a conflict of interest.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/landmark-arbitration-judgements-2025.jpg"
  },
  {
    "title": "My Face, My Voice: The Constitutional, Commercial, And Enforcement Dimensions Of AI-driven IP",
    "description": "<p>The Delhi High Court's interim order in Ranganathan Madhavan v G Filmz Studioz & Ors marks a landmark moment for personality rights, artificial intelligence, and platform liability in India. This ruling decisively reaffirms an individual's sovereign control over the commercial and moral value of their face and voice in the era of synthetic media.</p>\n\n<p>Actor R. Madhavan sued multiple defendants, including platforms like Meta and Google, for unauthorized exploitation of his name, image, likeness, and voice. These personal attributes, asserted as distinctive identifiers and valuable commercial assets, were used in AI-generated deepfakes, morphed pornographic content, and unauthorized merchandise. Platforms were included to facilitate enforcement.</p>\n\n<p>The court established Madhavan's persona as both a proprietary and dignitary interest, rooted in constitutional Articles 19 and 21, performers' moral rights under the Copyright Act, and common law. It protects these rights from unauthorized commercial gain and recognizes that obscene deepfakes infringe upon dignity.</p>\n\n<p>Crucially, the court distinguished AI-generated commercial exploitation from legitimate expressive uses. It ruled that AI-enabled personality cloning for deceptive advertising or pornographic content falls squarely outside fair dealing or free speech protections, considering AI an exacerbating factor in such infringements.</p>\n\n<p>The comprehensive interim relief restrains all identified and unknown infringers from using Madhavan's persona via any technology, including AI. A multi-layered enforcement strategy mandates video platforms to remove content, domain registrars to suspend infringing websites, merchandising platforms to delist products, and social media platforms to effect takedowns and disclose infringer details. This strategy assigns compliance costs to intermediaries and aids in identifying anonymous infringers.</p>\n\n<p>This judgment integrates personality rights as a robust economic interest, akin to a trademark, while firmly linking it to constitutional dignity. It offers a hybrid of property, privacy, and anti-defamation norms, establishing a technologically aware, commercially grounded, and constitutionally infused model for personality rights in India, setting a significant precedent for the digital self.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/my-face-my-voice-delhi-hc-on-ai-deepfakes-and-ip-rights.jpg"
  },
  {
    "title": "From Possession to Katha: KRERA Clarifies Developer’s Role in Title Completion",
    "description": "<p>The Karnataka Real Estate Regulatory Authority (KRERA) has issued a landmark ruling, directing a Bengaluru developer to facilitate katha (municipal property tax record) transfer to allottees within 30 days. This judgment, in Somashekar HG & Prakruti M v. Kavitha Ramreddy concerning project \"AQUATOWNN\", reinforces that post-sale title documentation is an enforceable obligation for promoters under the Real Estate (Regulation and Development) Act, 2016, not merely a formality.</p>\n\n<p>The dispute arose from buyers' grievance of undue delay in katha mutation, despite an express undertaking in the indemnity bond and sale deed. These contractual documents explicitly stipulated the developer's responsibility to transfer/mutate e-katha within 60 days of sale deed registration. KRERA held that these covenants established a positive duty on the promoter to facilitate the mutation process. The Authority clarified that Section 17(1) of RERA views \"title completion\" as a trinity encompassing registered conveyance, occupancy certificate, and katha in the allottee's favour.</p>\n\n<p>While mandating specific performance for katha transfer, KRERA rejected the buyers' plea for EMI compensation. The Authority stated that RERA's remedial architecture, though pro-consumer, cannot create liabilities for ancillary financial outgoings absent explicit contractual stipulations. The order thus crystallises three key propositions: an indemnity bond under RERA constitutes an enforceable undertaking, katha facilitation is integral to title completion, and compensation for monetary fallout must be rooted in explicit contractual terms. This ruling aims to standardize katha hand-over mechanisms, reinforcing promoter accountability and guiding both developers and buyers on contractual safeguards and regulatory expectations.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/krera-on-katha.jpg"
  },
  {
    "title": "No Forced Possession in Delayed Projects: REAT Jaipur Clarifies Scope of Refund Rights",
    "description": "<p>The Real Estate Appellate Tribunal, Jaipur (REAT), in Satish Sharma v. VVA Developers Pvt. Ltd., has significantly clarified allottees' refund rights under the RERA Act. This pivotal ruling underscores that project delay, non-execution of an Agreement for Sale, and arbitrary unit substitution decisively favor the allottee, even when promoters claim partial project completion.</p>\n\n<p>The case originated from an allottee who booked a unit in 2013 and paid over 10% of the consideration, yet no Agreement for Sale was ever executed. Faced with prolonged delays and subsequent offers of different units after partial project completion, the allottee sought a full refund. The Regulatory Authority initially directed the promoter to either offer possession (with interest adjustment) or provide a refund minus 10% administrative charges if the allottee declined possession.</p>\n\n<p>REAT Jaipur modified this order, unequivocally stating that a promoter's failure to execute an Agreement for Sale (a breach of RERA Sections 13(1) and 13(2)) is a serious statutory violation, which prevents them from imposing contractual deductions like administrative charges. The Tribunal affirmed an allottee's unconditional right to a full refund with interest under Section 18(1) if possession is not delivered within the stipulated timeframe. Crucially, REAT ruled that refund rights are not diminished by partial project completion, belated possession offers, or unilateral substitution of units without the allottee's express consent. Allottees cannot be compelled to accept a unit never originally allotted to them.</p>\n\n<p>Consequently, the REAT directed the promoter to refund the entire deposited amount of ₹6,47,212 with applicable interest, without any deductions, within 45 days. This decision reinforces RERA's core objective to protect homebuyers from promoter non-compliance, strengthening the jurisprudence around remedies for delayed projects and statutory breaches.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/reat-jaipur-refund-rights-project.jpg"
  },
  {
    "title": "Arbitral Tribunal Alone Decides Who May Invoke Arbitration, Supreme Court Reiterates",
    "description": "<p>The Supreme Court dismissed appeals, reaffirming the arbitral tribunal's authority to decide substantive questions like whether a single consortium member may invoke arbitration. The Court held such questions fall under Section 16 of the Arbitration and Conciliation Act, 1996, limiting judicial scrutiny under Section 11(6) to merely confirming the prima facie existence of an arbitration agreement.</p>\n\n<p>The case stemmed from an APGENCO EPC tender, where Tecpro, a consortium member, unilaterally invoked arbitration after entering Corporate Insolvency Resolution Process (CIRP). Appellants APGENCO and VA Tech argued the arbitration agreement mandated collective invocation, citing Tecpro's insolvency and leadership change. Tecpro countered that the consortium wasn't a juristic person and its agreement allowed individual representation upon insolvency.</p>\n\n<p>The Supreme Court underscored the policy of minimal judicial intervention, clarifying that the appellants conflated the \"existence\" of an arbitration agreement with Tecpro's \"entitlement\" or \"capacity\" to invoke it individually. Substantive issues, including consortium survival, consent requirements, and liquidation impact, are exclusively for the arbitral tribunal. The Court dismissed the appeals, upholding the High Court's tribunal appointment and remitting all substantive objections to the arbitrator under Section 16, reinforcing the principle of kompetenz-kompetenz.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/tribunal-decides-arbitration-invoke.jpg"
  },
  {
    "title": "Centralising Religious Dietary Certifications: An Analysis of the Food Safety and Standards (Amendment) Bill, 2025",
    "description": "<p>The Food Safety and Standards (Amendment) Bill, 2025 represents a pivotal shift in India's regulation of faith-based dietary certifications, particularly Halal. Addressing long-standing concerns regarding a lack of legal oversight, inconsistent standards, and unchecked private certification practices, the Bill seeks to bring these under a statutory, government-controlled framework.</p>\n\n<p>The legislation expands the Food Safety and Standards Authority of India (FSSAI)'s mandate, empowering it to regulate, grant, and monitor religious dietary certifications exclusively through government-notified agencies under the Union Ministry of Health and Family Welfare. Crucially, the Bill prohibits private organizations, trusts, or societies from issuing Halal certifications or collecting associated fees, centralizing this authority with designated government agencies and directing all fees to the Consolidated Fund of India. The scope of such certifications is strictly limited to food products for human consumption, with stringent penalties for contravention.</p>\n\n<p>A dedicated Committee on Certification of Religious Dietary Food Items is established to formulate and periodically update uniform national standards for all forms of religious dietary certifications, encompassing Halal, Kosher, and Jhatka. This committee ensures a balanced approach incorporating scientific expertise and inter-ministerial coordination, covering aspects like slaughter, processing, packaging, and labelling. The overarching intent is to enhance consumer confidence, ensure transparency, and uphold accountability within India's food safety regime by balancing respect for religious practices with public health and regulatory integrity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/religious-dietary-certifications.jpg"
  },
  {
    "title": "Arbitration At The Guillotine: Inside The Supreme Court’s 269 Page Judgement, UNCITRAL’s Evolution, SIAC-LCIA-HKIAC Perspectives, And The Road To The Arbitration And Conciliation Bill, 2024",
    "description": "<p>The Supreme Court's judgment in Harshbir Singh Pannu v. Jaswinder Singh critically examines how \"termination of arbitral proceedings\" has been weaponized in India. The Court's deep dive, tracing from the UNCITRAL Model Law to international institutional rules (SIAC, LCIA, HKIAC), reveals how India's fragmented statutory provisions in Sections 25, 30, 32, and 38 of the Arbitration and Conciliation Act, 1996, undermine the arbitral process.</p>\n\n<p>The case, stemming from a hospital partnership dispute, highlighted how fee recalibrations post-counterclaim, and subsequent termination orders under Section 38 for non-payment, can act as a \"procedural guillotine,\" effectively extinguishing valid claims without a merits adjudication. Unlike the clear, consolidated termination frameworks of international institutions, India's Act creates a fog of uncertainty regarding the tribunal's mandate and parties' recourse, diverging from UNCITRAL's intent for carefully delimited termination scenarios.</p>\n\n<p>Recognizing these systemic flaws, the Supreme Court, while partially vindicating the appellant, provided \"meaningful suggestions\" for legislative reform. The article argues the forthcoming Arbitration and Conciliation Bill, 2024, must: consolidate termination grounds into a single, comprehensive provision; establish a transparent, \"terms of reference\"-driven fee and deposit regime; and create an express statutory remedy against capricious termination orders.</p>\n\n<p>These reforms, supported by similar critiques in ASF Buildtech (jurisdiction) and Gayatri Balasamy (post-award control), are crucial to transform termination from a weapon into a calibrated safeguard. The Bill's success in translating these lessons will determine whether Indian arbitration achieves parity with leading global forums.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/arbitration-bill-2024.jpg"
  },
  {
    "title": "Digital Personal Data Protection Act 2025",
    "description": "<p>The Digital Personal Data Protection Act (DPDP Act) 2025, whose rules were notified on November 13, 2025, establishes a comprehensive framework for governing how organizations in India collect, use, store, and process the personal data of individuals, referred to as Data Principals. This legislation is crucial for enhancing data protection and privacy standards across the nation.</p>\n\n<p>The implementation of the DPDP Act is structured in phases. Following its notification as the effective date, subsequent stages will introduce the Consent Manager Ecosystem in Phase 2, culminating in full compliance and enforcement during Phase 3. To facilitate a smooth transition, the government has provided an 18-month lead time for most of the Act's provisions. The Act also specifies penalties for instances of non-compliance, reinforcing its commitment to robust data privacy.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/digital-personal-data-protection-act-2025-timelines-penalties.jpg"
  },
  {
    "title": "The Sovereign’s Gate: A Comprehensive Guide to India’s Visa Regime and OCI Framework (2025)",
    "description": "<p>India's immigration framework, governed by the 2025 Immigration and Foreigners Act, meticulously regulates entry as a \"profound legal event,\" balancing individual liberty and state sovereignty. Navigating this complex system requires precision and adherence to specific visa categories and protocols.</p>\n\n<p>The 2025 visa architecture prioritizes e-Visas for convenience. The e-Tourist Visa, for 166+ countries, covers recreation but has strict \"Continuous Stay\" limits; overstaying leads to severe penalties. The e-Business Visa permits commercial activities, strictly prohibiting employment. Other e-Visas include Medical and Conference types. A significant 2025 update is the mandatory e-Arrival Card, a digital health/itinerary declaration required 72 hours pre-boarding. For specific restricted purposes, the traditional Regular (Paper) Visa with physical submission and rigorous scrutiny is still necessary.</p>\n\n<p>Nations like Pakistan and China are \"Prior Reference Category\" (PRC) countries, requiring direct vetting by the Ministry of Home Affairs due to foreign policy. India offers purpose-specific visas (Employment, Journalist, Student, Film); applying for the incorrect category is a common error leading to rejection.</p>\n\n<p>The Overseas Citizen of India (OCI) Card is a vital framework for the Indian diaspora, granting life-long visa status but not dual citizenship. Eligibility is ancestral (applicant, parents, or grandparents being Indian citizens post-1950), with a strict exclusion for those with Pakistani or Bangladeshi past citizenship. OCI holders enjoy parity with resident citizens in most economic/financial matters but cannot vote, hold constitutional posts, or acquire agricultural land. Documentation requires strict adherence to format; former Indian citizens must provide a Surrender Certificate. OCI re-issuance rules were relaxed in 2025, removing the requirement with every passport renewal.</p>\n\n<p>Common pitfalls include misrepresenting intent (e.g., business on a tourist visa), failing to disclose criminal records, concealing Pakistani origin, or submitting poor-quality documents. Transparent and accurate declarations, alongside meticulous digital hygiene, are paramount. Ultimately, India's immigration laws act as a filter for intent, legality, and security, welcoming those who respect its sovereign rules.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-visa-oci-rules-2025-a-complete-legal-guide.jpg"
  },
  {
    "title": "Police Power versus Food Safety Officer Jurisdiction : Rajasthan High Court Clears the Air in Ravi v. State of Rajasthan",
    "description": "<p>The Rajasthan High Court, in Ravi v. State of Rajasthan, quashed an FIR and criminal proceedings involving food adulteration and misbranding under Sections 272, 273, and 420 of the Indian Penal Code (IPC) read with the Food Safety and Standards Act, 2006 (FSSA). The ruling re-established the primacy of the FSSA as a special law over general IPC provisions for identical conduct, emphasizing that once conduct is punishable under the more stringent FSSA, the general provisions of the IPC must yield.</p>\n\n<p>The petitioner argued that the FSSA, being a self-contained code with an \"over-riding effect\" under Section 89, supersedes IPC Sections 272 and 273 once an offence under FSSA Section 59 is made out. Furthermore, it was contended that only a qualified Food Safety Officer is authorized to investigate adulteration cases, not the police. The charge of cheating (IPC Section 420) was also contested due to the absence of allegations regarding inducement or wrongful loss to any purchaser. The State, conversely, argued that IPC offences retain independent identity and police are competent to investigate cognizable offences like IPC 420.</p>\n\n<p>Citing Supreme Court precedents (Ram Nath v. State of U.P. and Sushil Kumar Gupta v. State of West Bengal), the High Court affirmed that the FSSA, with its comprehensive and often more stringent provisions, overrides general IPC sections 272 and 273, thereby barring simultaneous prosecution. The court found no foundational facts for cheating under IPC 420 in the FIR, dismissing the charge. Crucially, it held that police investigation into adulteration contravenes the FSSA statutory scheme, which vests such powers exclusively in Food Safety Officers. Consequently, all proceedings from the FIR were quashed, though the competent food authority remains free to pursue remedies solely under the FSSA. This judgment reinforces that specific statutory codes with built-in safeguards take precedence over general criminal law for the same set of facts.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-on-fssa-override-of-ipc-powers.jpg"
  },
  {
    "title": "Restoring Dignity and Property: SC Rules on Mahr and Marriage Gifts",
    "description": "<p>The Supreme Court, in `Rousanara Begum v. S.K. Salahuddin`, has decisively reaffirmed a divorced Muslim woman’s non-negotiable economic rights. This landmark decision ensures her entitlement to property, money, and jewellery received at marriage, aligning with the Muslim Women (Protection of Rights on Divorce) Act, 1986. The ruling prioritizes securing dignity, equality, and financial protection, moving beyond technicalities to address women's vulnerabilities post-divorce.</p>\n\n<p>The Court clarified that a woman's ownership rights over such assets persist even after marriage ends. These gifts often serve as a woman's sole financial resource, offering critical economic security and personal dignity. The judgment reinforces Section 3 of the 1986 Act, interpreting it as social justice legislation grounded in constitutional values of equality, dignity, and autonomy (Article 21). It challenges patriarchal assumptions that absorb a woman's property into the marital household, protecting her from post-divorce vulnerability.</p>\n\n<p>The ruling emphasizes that legal interpretation must consider social realities and legislative intent, ensuring women's claims are not dismissed due to minor inconsistencies. It clarifies that the 1986 Act covers assets received \"before or at the time of marriage or after her marriage,\" aligning with Daniel Latifi principles for long-term financial stability. The Court instructs lower courts to adopt interpretations favoring women's empowerment and dignity. Ultimately, the decision reframes women as rights-bearing individuals with enforceable claims to property, reinforcing that a woman's property remains her own before, during, and after divorce. The SC overturned the High Court, directing the respondent to return assets with interest.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-reaffirms-mahr-and-marriage-gift-rights.jpg"
  },
  {
    "title": "Behaviour-Based Safety: The Leadership Strategy India Needs to Prevent Industrial Accidents",
    "description": "<p>India confronts a disturbing rise in industrial accidents, despite modern equipment and regulatory frameworks like the OSH Code 2020, which often foster administrative compliance over genuine safety leadership. The article underscores that true safety is a lived culture, not merely a presented metric, illustrated by an executive's silent gesture conveying, \"Safety is not something you present, it’s something you live.\"</p>\n\n<p>Behaviour-Based Safety (BBS) is posited as the critical strategy to transform safety from a compliance exercise into a core leadership value and shared organizational habit. Inspired by DuPont's pioneering 1960s BBS program, which evolved from over a century of safety commitment, the author shares personal success implementing BBS in India. BBS moves beyond rules and checklists to foster a robust safety culture.</p>\n\n<p>While effective BBS implementation requires thorough understanding, as many companies prematurely abandon efforts, it yields significant benefits. Tangible improvements manifest in production, quality, delivery, sustainability, and morale within 10-15 months. Intangible gains include a vibrant culture, increased employee ownership, teamwork, and a harmonious workplace.</p>\n\n<p>Ultimately, safety is presented as a fundamental leadership mindset. Leaders' visible commitment—demonstrated through curiosity on the shop floor, appreciation of safe behavior, and coaching—builds an \"invisible shield\" protecting people and assets. This shift from prescribed rules to lived practice, where leaders' actions shape belief, cultivates a culture of excellence, trust, and pride, making safety synonymous with effective leadership.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/behaviour-based-safety-leadership-to-prevent-accidents.jpg"
  },
  {
    "title": "Punjab & Haryana High Court Reaffirms Statutory Grace Period for Expired Driving Licences: Insurer Denied Recovery Rights",
    "description": "<p>The Punjab and Haryana High Court has reiterated that a formally expired driving license remains legally effective for the 30-day statutory grace period stipulated under Section 14(1) of the Motor Vehicles Act, 1988. This judgment, delivered on November 21, 2025, dismissed an appeal by National Insurance Company Limited, denying the insurer any right to recover compensation it had paid to accident victims.</p>\n\n<p>The dispute arose from an accident where the driver's license had expired on June 4, 2001, and the accident occurred on July 4, 2001, with renewal only on August 6, 2001. The insurer argued the driver was unlicensed, constituting a policy breach and entitling them to recovery. However, the vehicle owner contended that the accident, which happened at 10:45 a.m. on July 4, 2001, fell squarely within the 30-day grace period, which commenced on June 5, 2001, and expired at midnight on July 4, 2001.</p>\n\n<p>Justice Virinder Aggarwal, examining the provision's plain language, affirmed that the legislature explicitly defers the cessation of an expired license by thirty days. Citing precedents like State of Haryana & Anr. v. Karkor & Ors. and Oriental Insurance Co. Ltd. v. Smt. Santosh Kumari, the Court concluded that the driver was legally licensed at the time of the accident. Consequently, no breach of policy conditions occurred, and the insurer's plea for recovery was dismissed, affirming the Motor Accident Claims Tribunal's original award. This ruling emphasizes that the 30-day extension is a substantive continuation of license validity, necessitating insurers to factor this legislated continuum into their risk assessments.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/high-court-upholds-30-day-grace-for-expired-licences.jpg"
  },
  {
    "title": "CG-RERA Circular 139/2025: “Notarised” Contract Term Variations and the Sole Collection Account",
    "description": "<p>Chhattisgarh Real Estate Regulatory Authority (CG-RERA), through Circular No. 139 dated November 14, 2025, has translated Supreme Court's disapproval of opaque builder-buyer paperwork into practical directives. These immediate, transversal instructions apply to all project documentation and are framed as conditions precedent for lawful execution and registration.</p>\n\n<p>The circular introduces a \"notarisation\" protocol: any clause or deviation from the statutory Agreement for Sale (AFS) template (Rule 9's Annexure-A) must be \"notarised\" by the competent Revenue Authority before execution. This compulsory step ensures that additional covenants (e.g., penal interest, construction milestones, amenities promises) or bespoke riders, whether pre- or post-registration, are publicly attested. This closes the loophole of promoters later inserting supplementary sheets. Non-compliance will lead to penalties, including refusal or revocation of project registration.</p>\n\n<p>Parallel to this, the circular mandates that only the RERA Collection Account number must be displayed across all project documentation—including sale deeds, allotment letters, brochures, and website banners. Any reference to alternative bank accounts (escrow, partnership, or group company accounts) is strictly prohibited. This aims to funnel all payments into the Authority’s dashboard-integrated account, permitting real-time reconciliation and enhancing transparency. Promoters marketing inventory must purge alternative account numbers within seven days.</p>\n\n<p>By making every deviation publicly attested and every monetary destination uniquely identifiable, Circular 139 converts the AFS into a tightly scripted instrument. This directive serves as both a compliance accelerator for promoters and a consumer shield, giving practical teeth to RERA's promise of transparency and protection.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cg-rera-circular-139-new-notarisation-account-rules.jpg"
  },
  {
    "title": "Don’t Sell Me This Pen: RBI Prohibits Lending Service Providers From Playing Salesmen",
    "description": "<p>The Reserve Bank of India (RBI) issued comprehensive Digital Lending (DL) Directions, 2025 (effective May 8, 2025), to mitigate severe consumer protection risks like opaque pricing, aggressive collection, and data misuse in India's growing digital lending sector.</p>\n\n<p>A central reform is the \"salesman ban\" for Lending Service Providers (LSPs) from November 1, 2025. LSPs are now barred from biased promotions for preferred Regulated Entities (REs). Multi-lender platforms must display all matching loan offers objectively, avoiding \"dark patterns.\" REs assume full responsibility for fair market conduct. Lenders must provide complete upfront information, including a prominent Key Fact Statement (KFS) detailing APR and all charges for informed consent.</p>\n\n<p>The Directions formalize RE-LSP relationships via mandatory contracts, requiring REs to perform enhanced due diligence and periodic reviews. Crucially, REs remain entirely responsible and liable for all LSP actions, affirming that financial duty of care cannot be delegated. All customer complaints related to Digital Lending Applications (DLAs) must be handled directly by the RE.</p>\n\n<p>Strict data norms enforce minimization and explicit consent. DLAs cannot access sensitive mobile data (contacts, call logs); any temporary access, e.g., camera for KYC, needs explicit, audited consent. Borrowers can withdraw consent and request data deletion. All borrower data must be stored on Indian servers, with data processed abroad deleted and repatriated within 24 hours to enhance supervisory control.</p>\n\n<p>These DL Directions represent a significant shift toward a governance-heavy model, increasing compliance burdens and operational costs for both REs and LSPs. REs must invest in robust internal systems, while LSPs face marketing restrictions and strict data practices. The overarching goal is to boost consumer confidence and transparency by ensuring LSPs act as neutral aggregators, firmly embedding digital innovation within India's consumer protection framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-bans-lsp-sales-practices-under-digital-lending.jpg"
  },
  {
    "title": "Land Acquisition Arbitration and Writ Jurisdiction: Constitutional Limitations in the Wake of Suryadev Pathak vs. Union of India",
    "description": "<p>The Allahabad High Court's judgment in Suryadev Pathak vs. Union of India elucidates the jurisdictional limitations of constitutional courts when statutory remedies are available. The case stemmed from Suryadev Pathak, a landowner, seeking enhanced compensation for land acquired under the National Highways Act, 1956, for the Bharat Mala Scheme. Dissatisfied with the initial compensation, Pathak invoked the arbitration mechanism specified in Section 3G(5) of the Act.</p>\n\n<p>When the appointed arbitrator delayed rendering a decision for over two years, Pathak filed a writ petition under Article 226, alleging violations of his constitutional rights (Articles 14, 21, 300-A) and seeking expeditious resolution. The respondents countered, arguing that the High Court lacked jurisdiction as the Arbitration and Conciliation Act, 1996 (A&C Act), provides a comprehensive framework, including provisions for timeline extensions exclusively by designated civil courts, not constitutional courts.</p>\n\n<p>The High Court's analysis centered on the maintainability of writ jurisdiction when alternative statutory remedies exist, and the validity of mandating arbitration after statutory timelines expire. The court reasoned that upon the expiration of timelines prescribed by the A&C Act, specifically Section 29A, an arbitrator's mandate ceases. Consequently, any subsequent proceedings for timeline extensions must be adjudicated by competent civil courts, not through extraordinary writ jurisdiction, to prevent undermining legislative schemes and encouraging forum shopping.</p>\n\n<p>The court dismissed the writ petition, establishing three fundamental principles: arbitration under Section 3G(5) of the NH Act is governed by the A&C Act; constitutional courts cannot exercise writ jurisdiction where specific and efficacious statutory remedies exist; and only competent civil courts possess the authority to extend arbitration timelines after an arbitrator's mandate expires. This judgment reinforces the integrity of specialized legislative frameworks, emphasizing the primacy of statutory arbitration over extraordinary constitutional intervention in land acquisition disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/allahabad-hc-limits-writs-in-land-arbitration-case.jpg"
  },
  {
    "title": "Clock-Out Forever: How NCLT Told Ex-Workers That Missing the CIRP Deadline Means Missing the Money",
    "description": "<p>The National Company Law Tribunal (NCLT) Mumbai recently dismissed claims by former employees of Indo Global Soft Solutions and Technologies Pvt. Ltd., delivering a critical judicial pronouncement on the strict adherence to statutory timelines within the Corporate Insolvency Resolution Process (CIRP) under the Insolvency and Bankruptcy Code (IBC). Six former employees sought judicial intervention for unpaid salaries and dues, but their claims, submitted on October 25, 2023, were significantly past the initial deadline of May 4, 2022, and crucially, after the Committee of Creditors had already approved a resolution plan.</p>\n\n<p>The applicants contended ignorance of the CIRP process and deadlines. However, the NCLT unequivocally ruled that the public announcement made pursuant to IBC regulations constituted \"deemed knowledge.\" Further, their previous engagement with the Indian Institute of Insolvency Professionals contradicted their claims of unawareness. The Tribunal's decision was heavily influenced by Supreme Court precedents, which consistently emphasize the responsibility of stakeholders to remain vigilant and compliant with established IBC timelines.</p>\n\n<p>Dismissing the applications, the NCLT reinforced the fundamental principle that timely claims submission is paramount. It emphasized that entertaining such belated applications would contravene the essential spirit and structure of the IBC, potentially undermining the integrity and efficiency of the entire resolution process and prolonging it unnecessarily. This ruling serves as a definitive precedent, highlighting that all stakeholders, including employees, must exercise due diligence, remain informed, and be proactive in protecting their interests within the designated time frames, as claims of ignorance do not constitute valid grounds for exemption from statutory timelines.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclt-mumbai-late-cirp-claims-get-no-relief.jpg"
  },
  {
    "title": "India’s Four Labour Codes: A Transformational Reform for the Nation’s Workforce",
    "description": "<p>On November 21, 2025, the Government of India implemented four consolidated Labour Codes (on Wages, Industrial Relations, Social Security, and Occupational Safety, Health and Working Conditions), replacing 29 fragmented colonial-era laws. This historic reform modernizes India's labour ecosystem, aligns it with global standards, and aims to ensure social justice and protection for all workers.</p>\n\n<p>The previous labour framework was outdated, complex, and struggled to accommodate new employment forms like gig and platform work. It created significant compliance burdens for employers and left vast sections of the workforce, including informal, gig, platform, and contract workers, without uniform protections like minimum wages, social security, or formal appointment letters.</p>\n\n<p>The new codes introduce several core reforms: mandatory appointment letters for all workers, universal social security coverage (PF, ESIC) extending to gig and platform workers with portable Aadhaar-linked Universal Account Numbers, and a statutory National Floor Wage ensuring minimum pay. They mandate timely wage payments, provide free annual health check-ups for workers over 40, and permit women to work night shifts and in all occupations with consent and safety measures. Compliance is significantly simplified with a single registration, pan-India license, and single return system, while dispute resolution mechanisms are streamlined.</p>\n\n<p>These reforms offer substantial benefits across diverse categories: fixed-term employees now receive equal benefits and gratuity after one year; gig workers gain social security via aggregator contributions; and contract workers receive enhanced protections. The codes explicitly prohibit gender discrimination, ensure equal pay, and strengthen protections for youth, MSME workers, and those in hazardous industries. This comprehensive, pro-worker, pro-women, pro-youth, and pro-employment framework balances worker dignity and expanded social security with a more conducive environment for business growth and employment generation, supporting India's vision of Aatmanirbhar Bharat.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indias-labour-codes-a-new-era-for-workforce-reforms.jpg"
  },
  {
    "title": "CIRP Cannot Be Reopened Post CoC Approval, Rules NCLT",
    "description": "<p>The National Company Law Tribunal (NCLT), Mumbai Bench, has dismissed six belated claims from former employees of Indo Global Soft Solutions and Technologies Pvt. Ltd., reinforcing that the Corporate Insolvency Resolution Process (CIRP) cannot be reopened post-Committee of Creditors (CoC) approval of a resolution plan.</p>\n\n<p>The employees submitted their claims for unpaid salaries, PF, and other dues nearly eighteen months after the statutory deadline of May 4, 2022. Crucially, these claims were filed only after the CoC had twice approved a resolution plan and the Tribunal had already reserved orders on the second plan in August 2025.</p>\n\n<p>The NCLT's decision rested on three pillars: strict adherence to IBC timelines (Regulation 12(1) and 13(1B)), finding a lack of bona fides in the applicants' conduct, and upholding the necessity of procedural discipline and finality in CIRP. The Tribunal rejected arguments of ignorance, noting employees had previously engaged professionally regarding claim rejections. It also emphasized that personal hardships, while regrettable, cannot override mandatory statutory obligations.</p>\n\n<p>Citing Supreme Court precedents (RPS Infrastructure v. Mukul Kumar), the NCLT concluded that allowing such extremely delayed claims would derail the time-bound nature of the CIRP and erode commercial certainty. This ruling underscores that timeliness is a substantive cornerstone of the insolvency framework, preventing tactical disruptions and strengthening the integrity of the resolution process.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cirp-cant-be-reopened-after-coc-plan-approval-nclt.jpg"
  },
  {
    "title": "Preserving Truth In The Digital Era: Blockchain As The Next Guardian Of Evidence Integrity",
    "description": "<p>This article explores the transformative potential of blockchain technology in reforming India’s property registration system, as spotlighted by the Supreme Court’s Samiullah v. State of Bihar (2025) judgment. The Court invalidated Bihar’s restrictive requirement of mutation proof for property registration, reaffirming the legal distinction between registration and ownership. This pivotal ruling highlighted the urgent need for systemic reforms, positioning blockchain as a powerful solution for achieving transparent, tamper-proof, and conclusive land title records.</p>\n\n<p>Blockchain offers a decentralized ledger that guarantees the immutability, transparency, and security of property records. Every entry is cryptographically linked, making data practically tamper-proof once recorded. Integrating blockchain with cadastral maps and revenue records can enhance transparency, drastically reduce fraudulent practices, and lower property-related disputes. The technology's ability to provide a verifiable, time-stamped audit trail also strengthens institutional trust, simplifies title searches, and ensures long-term preservation of evidence, addressing concerns about centralized system vulnerabilities.</p>\n\n<p>Beyond land records, blockchain could safeguard court filings, government orders, and contracts, bridging the gap between technological capability and legal certainty. The Samiullah ruling signals a paradigm shift, inviting policymakers and technologists to develop a verifiable digital chain of custody. Embracing blockchain represents a pivotal moment in modernizing property law, securing the integrity of justice, and ensuring that truth in the digital age remains as unassailable as it is on paper.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/blockchain-and-evidence-integrity-supreme-courts-vision.jpg"
  },
  {
    "title": "Judicial Intervention And The Seat Of Arbitration: Balancing Autonomy And Justice In India",
    "description": "<p>The \"seat of arbitration\" traditionally defines the juridical home of proceedings and the supervising courts, typically limiting judicial interference. However, recent Indian cases illustrate an evolving landscape, demonstrating a nuanced approach where courts balance party autonomy with the need for justice-oriented flexibility.</p>\n\n<p>In Engineering Projects (India) Ltd. v. MSA Global LLC, the Delhi High Court granted an interim injunction, halting a Singapore-seated arbitration due to concerns over procedural fairness and arbitrator bias. This rare intervention signals that party autonomy is not absolute, allowing Indian courts to act as guardians of justice in extraordinary circumstances.</p>\n\n<p>Conversely, in Rhutikumari v. Zanmai Labs Pvt. Ltd., the Madras High Court granted interim relief concerning domestic cryptocurrency assets in a Singapore-seated arbitration. The court reasoned that intervention was justified because the cause of action and the property were located in India, highlighting a willingness to protect domestic interests.</p>\n\n<p>Together, these cases reveal an emerging hybrid model in Indian arbitration jurisprudence. While the courts of the chosen seat generally retain supervisory control, Indian courts may exercise exceptional, limited intervention. This intervention is applied either to safeguard procedural fairness and prevent irreparable harm (as seen in Engineering Projects) or to protect domestic assets and interests (as in Rhutikumari). This approach ensures that the seat doctrine provides predictability and autonomy without sacrificing justice, reflecting India's pragmatic integration of global norms with equitable safeguards.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/judicial-intervention-and-the-seat-of-arbitration-in-india.jpg"
  },
  {
    "title": "Unconditional Stay Only in Exceptional Cases: Supreme Court Clarifies Section 36(3)",
    "description": "<p>The Supreme Court of India, in Popular Caterers v. Ameet Mehta & Ors., clarified the principles governing the grant of stays on arbitral awards, particularly monetary ones, under Section 36(3) of the Arbitration and Conciliation Act, 1996. The Court set aside a Bombay High Court order that had granted an unconditional stay on the execution of a ₹4-crore arbitral award, deeming it an exceptional relief granted without justifying circumstances.</p>\n\n<p>The Bombay High Court had erroneously undertaken an extensive, premature merits review, finding the award's findings \"perverse\" at the interim stage. The Supreme Court emphasized that an unconditional stay is permissible only in truly exceptional situations, such as when an award is prima facie induced by fraud or corruption, or is patently illegal, non-existent, or wholly without jurisdiction. It noted that no such allegations were raised by the award debtors, and the High Court had failed to consider the protective purpose of Section 36(3) to secure the award holder.</p>\n\n<p>Consequently, the Supreme Court directed the award debtors to deposit the principal amount of ₹4 crore with the Bombay High Court within eight weeks, for investment in a fixed-deposit account. The stay on the award was made conditional upon this deposit. The Court also instructed the Bombay High Court to expedite the disposal of the pending Section 34 petitions within six months. This ruling reinforces India's pro-enforcement arbitration framework, restricts premature merits reviews at the interim stage, and prevents award debtors from frustrating enforcement through unwarranted unconditional stays, thereby safeguarding the interests of award holders.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-limits-unconditional-stays-on-arbitral-awards.jpg"
  },
  {
    "title": "The Scent Of Innovation: Reinventing Tyres For A Refreshing Driving Experience",
    "description": "<p>India's Trade Marks Registry has made a historic move by accepting Sumitomo Rubber Industries' application for an olfactory trademark—a floral rose fragrance for tyres. This landmark decision expands Indian intellectual property law to include sensory branding, moving beyond conventional visual marks.</p>\n\n<p>The journey to registration was marked by procedural controversy, with the Registry initially citing distinctiveness concerns, then abruptly shifting to claims of technological limitations in examining smell marks. Sumitomo, however, asserted that the Trade Marks Act mandates examination based on graphical representation and distinctiveness, not administrative system constraints.</p>\n\n<p>The applicant successfully demonstrated both inherent distinctiveness, due to the arbitrary nature of a rose scent on tyres, and acquired distinctiveness from decades of continuous use since 1995. They argued the mark is easily recognizable by the \"man of average intelligence and imperfect recollection.\" A significant hurdle, graphical representation, was overcome with a groundbreaking 7-dimensional vector model, developed with experts from IIIT Allahabad, meeting the clear, precise, and objective standards set by international precedents like Siekmann.</p>\n\n<p>Shri Pravin Anand, acting as amicus curiae, provided impartial expertise, emphasizing the mark's distinctiveness and the acceptability of such non-functional scent marks in other jurisdictions. The Registry's final reasoning adopted a flexible interpretation of graphical representation, accepting the scientific model, and recognizing the arbitrary nature and inherent distinctiveness of the rose scent. This progressive stance, influenced by global practices, ensures non-traditional marks are not excluded solely due to representational challenges if statutory criteria are met.</p>\n\n<p>This pioneering case, a testament to collaborative excellence spanning law and science, broadens intellectual property protections in India. It positions the nation among global leaders in recognizing smell as a powerful and unique brand identifier, paving the way for a new sensory dimension within trademark law.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-accepts-rose-scented-tyre-mark-a-trademark-milestone.jpg"
  },
  {
    "title": "India’s New Space Age: How A ₹1,000-Crore VC Fund And Indian Space Laws Are Powering The Next Frontier Of Start-Ups",
    "description": "<p>India's space sector is undergoing a profound transformation, shifting from state-led exploration to a market-driven ecosystem empowered by private startups. This new era is fundamentally driven by the operationalization of a ₹1,000-crore Space Venture Capital Fund and a robust, evolving legal framework, aiming to establish India as a global hub for space innovation.</p>\n\n<p>The fund, a joint initiative by IN-SPACe and SIDBI Venture Capital Ltd., provides crucial risk capital, targeting approximately 40 high-potential startups over five years with investments ranging from ₹10-60 crore. This financial impetus complements a comprehensive regulatory environment. Key policy pillars include the Indian Space Policy 2023, which opens the entire space value chain to private participation and redefines roles for ISRO (R&D) and IN-SPACe as a single-window authority. The anticipated Space Activities Bill will further solidify this legal framework, addressing licensing, liability, and intellectual property. Recent reforms in 2024 also permit significant Foreign Direct Investment, up to 100% in certain sub-sectors, attracting global capital and collaboration.</p>\n\n<p>These strategic initiatives are designed to propel India's space economy from its current US $8.4 billion to a projected US $44 billion by 2033. This growth is expected to foster innovation across launch systems, satellite manufacturing, data applications for various sectors, and in-space services. While challenges like the pending Space Activities Bill and clearer liability frameworks remain, this powerful synergy of capital and policy marks a pivotal moment, transforming India into a \"space-startup superpower\" driven by \"Law-enabled Innovation.\"</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indias-space-laws-and-vc-push-shaping-a-new-tech-frontier.jpg"
  },
  {
    "title": "Constitution Day 2025: Strengthening Democracy Through All Citizens, Especially Youth",
    "description": "<p>India commemorates Constitution Day on November 26, celebrating the adoption of its Constitution in 1949. This day underscores the nation's core principles: democracy, justice, liberty, equality, fraternity, dignity, and unity. It serves as a powerful reminder of the Constitution's paramount role in safeguarding democracy and fostering national unity and harmony.</p>\n\n<p>The Constitution's monumental creation was led by visionary Dr. B. R. Ambedkar, Chairman of the Drafting Committee, who ensured the embodiment of justice, liberty, equality, and fraternity, alongside protections against social discrimination like untouchability. Constitution Day honors these framers, presenting the document not just as a legal text but as a living guide upholding democratic governance and fundamental individual rights.</p>\n\n<p>The observance inspires citizens, especially youth, to engage actively with constitutional values through activities such as reading the Preamble, debates, and seminars. It highlights fundamental rights and duties, cultivating a strong commitment to the rule of law and social justice. Youth play a critical role in promoting cultural respect, community dialogues, and spreading awareness, thereby strengthening democracy and national unity.</p>\n\n<p>Facing challenges like social inequalities and communal tensions, Constitution Day acts as a vital call to action for all citizens. It particularly urges the youth to embrace their constitutional rights and duties, becoming guardians of democratic ideals. Their active participation is crucial to champion inclusivity, combat discrimination, and foster societal unity, ensuring the Constitution's vision endures and thrives for generations to come.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/constitution-day-2025-celebrating-indias-democratic-spirit.jpg"
  },
  {
    "title": "Streamlining Insolvency Appointments: IBBI’s Second (2025) Guidelines for Professionals",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) released its Second Guidelines (2025) to streamline the appointment of Insolvency Professionals (IPs) as Interim Resolution Professionals, Liquidators, Resolution Professionals, and Bankruptcy Trustees. Effective for a six-month cycle from January 1 to June 30, 2026, these guidelines aim to eliminate administrative delays by pre-assembling zonewise and benchwise panels, operationalizing specific sections of the IBC 2016.</p>\n\n<p>Eligibility for the panel requires no pending disciplinary proceedings or recent convictions, an unconditional expression of interest (Form A submitted by December 22, 2025), and an Authorisation for Assignment (AFA) valid until June 30, 2026. IPs must consent to serve any assigned role or debtor and declare their sector experience. The common panel for all four roles, compiled by December 31, 2025, is disaggregated zonewise/benchwise, sorted by ongoing assignments and registration chronology. Insolvency Professional Entities are exempt from zone restrictions, eligible for pan-India appointments.</p>\n\n<p>Crucially, consent to be on the panel is irrevocable, signifying an undertaking to accept appointments. Unjustified refusal leads to immediate panel removal and a six-month debarment. Professionals must also maintain their registration and AFA during the panel's validity. While the Adjudicating Authority retains flexibility to appoint outside the panel if warranted, these guidelines enhance transparency and accountability. They replace the May 2025 framework, ensuring faster and more predictable insolvency appointments from January 2026, with clear obligations for professionals.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-issues-new-2025-guidelines-for-faster-ip-appointments.jpg"
  },
  {
    "title": "Seven Day Cure Command: Supreme Court Halts NCLT Rejection for Skipping Section 7(5)(b) Notice",
    "description": "<p>The Supreme Court, in Civil Appeal No. 11766 of 2025, has definitively ruled that before rejecting a financial creditor's Section 7 petition under the Insolvency and Bankruptcy Code, 2016, the adjudicating authority must first issue a specific seven-day healing notice to the applicant under the second proviso to Section 7(5)(b). Failure to provide this direct notice constitutes a jurisdictional error. This landmark judgment stemmed from a dispute involving HDFC Bank Limited and the corporate debtor, Live-in Aqua Solutions Private Limited.</p>\n\n<p>The case highlighted a procedural lapse where HDFC Bank's petition contained defects, including an affidavit predating the verification date. The NCLT Registry refused registration after publishing a consolidated defect sheet, but no separate, specific seven-day notice under the Code's proviso was served directly to the bank. While the NCLAT later acknowledged the procedural error, the Supreme Court emphasized the mandatory nature of this notice, stating that a mere consolidated listing of defects is insufficient.</p>\n\n<p>The Supreme Court clarified that a defective affidavit is a curable irregularity, not a fatal flaw that renders the application non est. It reiterated that procedure should aid justice, not obstruct it. Although the NCLAT correctly identified the procedural lapse, the Supreme Court chided it for not directing the bank to file a fresh, compliant affidavit. Consequently, the Court mandated HDFC Bank to cure all defects, including filing a new affidavit, within seven days from the judgment date. Following this, the NCLT will proceed to decide the petition on its merits.</p>\n\n<p>This ruling underscores the imperative for tribunals to uphold procedural safeguards, branding the absence of the specific seven-day notice a jurisdictional flaw. It ensures that financial creditors are afforded a clear opportunity to rectify defects, reinforcing the principle of \"cure first, reject later\" within the IBC framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-restores-section-7-plea-over-missed-notice.jpg"
  },
  {
    "title": "IBBI (Insolvency Resolution Process for Personal Guarantors to Corporate Debtors) (Amendment) Regulations, 2025 Makes Accuracy and Punctuality Non-Negotiable for Resolution Professionals",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) introduced the (Amendment) Regulations, 2025, on November 20, 2025, to address chronic issues of late and inaccurate filings by Resolution Professionals (RPs) in the insolvency resolution process for personal guarantors. This crucial amendment, effective immediately, inserts a new Regulation 23 into the 2019 Regulations, fundamentally transforming best practices into statutory duties and aiming to enhance creditor confidence and accelerate judicial proceedings.</p>\n\n<p>Regulation 23 mandates strict procedural discipline. RPs are now legally obliged to file all prescribed Forms and their enclosures electronically on the IBBI's designated platform by specified deadlines, allowing no discretion. Furthermore, RPs must certify that all submitted information is true, complete, and not misleading, effectively ending any \"file-now-correct-later\" approach. Non-compliance triggers an automatic penalty of ₹500 per Form for each calendar month of delay, applicable to initial filings, corrections, or updates. Beyond monetary fines, the IBBI is empowered to refuse to issue or renew an RP's \"Authorisation for Assignment\" for failures related to filing, accuracy, or timeliness, posing a significant professional and existential threat. These reforms leverage a central digital platform and stringent penalties to ensure data integrity, compress timelines, and deliver faster outcomes for all stakeholders.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-2025-tightens-filing-rules-for-personal-guarantor-cases.jpg"
  },
  {
    "title": "Menstrual Leave Becomes a Legal Entitlement in Karnataka Workplaces: No Certificate, No Carry-Over",
    "description": "<p>On November 20, 2025, Karnataka's Labour Department issued Government Order No. LD 466 LET 2023, establishing menstrual leave as a binding statutory entitlement. This mandate grants women workers aged 18-52 one paid leave day per menstrual cycle, capped at twelve days annually. Significantly, it is self-certification based, eliminating the need for medical proof.</p>\n\n<p>The entitlement stemmed from extensive deliberations by a multi-stakeholder committee formed in January 2024, followed by public consultation that showed strong support. The order invokes five central and state labour statutes, ensuring pan-sectoral coverage for all registered establishments and women employees, including contractual and outsourced workers.</p>\n\n<p>Key features of the leave include its compensatory and wage-protected nature, with monetary liability resting solely on the employer. It cannot be offset against other leave types. A statutory cap of twelve days per calendar year applies, with unused leave lapsing monthly—it cannot be accumulated, encashed, or carried forward. Employees simply need to intimate their intention to avail the leave within the same month. The order took immediate effect on November 20, 2025, requiring establishments to update systems and face penalties for non-compliance. This marks a pivotal shift from discretionary welfare to a statutory right, emphasizing employee dignity and administrative simplicity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/karnataka-notifies-statutory-paid-menstrual-leave-for-women.jpg"
  },
  {
    "title": "SWIFT 2.0 Goes Live: FSSAI–CBIC Integration Reshapes Legal Architecture of Food-Import Clearance",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) and the Central Board of Indirect Taxes and Customs (CBIC) have jointly announced the pilot launch of SWIFT 2.0, an upgraded interface designed to integrate food-safety oversight with customs control. This new system embeds FSSAI’s Food Import Clearance System (FICS) directly into CBIC’s ICEGATE portal, replacing SWIFT 1.0 with a real-time, two-way data conduit. The initiative aims to compress regulatory clearance times, eliminate duplicative filings, and reinforce the Government's commitments to \"Ease of Doing Business\" and \"Digital India.\"</p>\n\n<p>The primary objective is to streamline food import processes by providing a single-window design where importers can obtain the FSSAI No-Objection Certificate directly through the SWIFT portal. This eliminates the need for parallel applications, thereby reducing human interface, shortening cargo dwell time, and lowering the cost of doing business, all while maintaining transparency and accountability within the system.</p>\n\n<p>The pilot phase is strategically confined to four high-volume inland container depots—Dadri, Star Track, Albatross, and Patparganj—selected based on cargo density, existing digital infrastructure, and the presence of accredited laboratories. This approach ensures early identification of systemic bottlenecks without disrupting the wider import ecosystem. Upon successful validation, SWIFT 2.0 will be rolled out nationally to all major food-import entry points, underscoring India’s commitment to efficient, transparent, and technology-driven food-import processes and a strengthened food-safety ecosystem.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/swift-2-0-integrates-fssai-and-cbic-for-faster-food-imports.jpg"
  },
  {
    "title": "IBBI (Insolvency Professionals) (Second Amendment) Regulations, 2025: An analysis",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) promulgated the Insolvency and Bankruptcy Board of India (Insolvency Professionals) (Second Amendment) Regulations, 2025, effective November 21, 2025. Issued under the Insolvency and Bankruptcy Code, 2016, these regulations introduce critical amendments to the existing framework governing Insolvency Professionals (IPs), aiming to enhance efficiency and accountability within the insolvency resolution process.</p>\n\n<p>A significant change is the insertion of Regulation 7B, establishing a quantitative ceiling on assignments. Individual IPs (not insolvency professional entities) are now restricted to a maximum of ten concurrent assignments, covering roles such as Interim Resolution Professional, Resolution Professional, and Liquidator. Within this limit, no more than three assignments can pertain to processes with admitted claims exceeding INR 1000 crore each. IPs exceeding these thresholds upon commencement are prohibited from accepting new assignments until their active portfolio falls below the prescribed limits.</p>\n\n<p>Furthermore, amendments to the Code of Conduct (First Schedule) include replacing \"the approval of the Board\" with \"the prior approval of the Adjudicating Authority\" in Clause 6, thereby transferring sanctioning power from the IBBI to the National Company Law Tribunal. Clause 22 has also been omitted. These amendments signify a shift from self-declared workload management to a hard statutory ceiling, designed to mitigate timeline slippages and enhance fiduciary oversight. Stakeholders are advised to audit existing mandates and integrate these revised thresholds into their operational frameworks to ensure regulatory compliance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-2025-insolvency-professionals-assignment-cap-explained.jpg"
  },
  {
    "title": "Detailed Analysis of the Digital Personal Data Protection Rules, 2025 (hereafter “Rules 2025”), which are the subordinate rules under the Digital Personal Data Protection Act, 2023 (“DPDP Act”) in India",
    "description": "<p>The Digital Personal Data Protection Rules, 2025 (Rules 2025) mark a crucial progression in India’s data protection framework, acting as subordinate legislation to the Digital Personal Data Protection Act, 2023 (DPDP Act). These rules are designed to operationalize the DPDP Act, integrating international good practices related to consent, breach notification, data minimization, and data erasure. The analysis evaluates these rules, considering their purpose, merits, concerns, implications of key provisions, and their practical impact across various stakeholder segments.</p>\n\n<p>The article also includes a comparative analysis of the Digital Personal Data Protection Rules, 2025 with the EU General Data Protection Regulation (GDPR), illustrating India's approach in the global data protection landscape.</p>\n\n<p>In conclusion, while the Rules 2025 aspire to elevate India's data protection regime to international standards, their success is largely contingent on several critical elements. These include the clarity of definitions, the establishment of realistic operational timelines, the strength and effectiveness of oversight institutions, and the judicious balancing of business practicality with individual rights protection. Proper implementation holds the potential to significantly enhance data protection in India's digital economy; conversely, inadequate execution risks leading to regulatory burdens, ambiguity, and a decline in trust.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/dpdp-rules-2025-explained-compliance-duties-and-key-risks.jpg"
  },
  {
    "title": "Ctrl+Alt+Regulate: AI’s Takeover Of Media And Its Legal Crossroads",
    "description": "<p>Artificial Intelligence is profoundly transforming the media industry globally, enhancing content creation, personalization, and moderation. While AI-generated scripts, synthetic voices, and hyper-personalized recommendations augment or replace human creativity, this rapid evolution introduces significant legal, ethical, and societal concerns. Urgent regulatory frameworks are needed to address issues of legality, fair use, and accountability.</p>\n\n<p>India's legal system is actively grappling with these challenges, particularly concerning freedom of expression versus content moderation. AI-enabled content, including deepfakes and algorithmic filtering, complicates constitutional rights, necessitating adaptations to laws like the IT Act 2000 and its evolving rules (IT Rules 2021 and subsequent amendments). Indian courts are balancing free speech with legitimate state interests, pushing back against overbroad government controls while also addressing AI misuse of individual likeness and persona rights.</p>\n\n<p>Deepfakes, which are realistic AI-generated or altered content often created without consent, pose a severe threat to truth, trust, and privacy. Indian courts are increasingly protecting celebrities' personality rights (name, voice, image) against unauthorized AI misuse, issuing orders for immediate content removal. Despite potential challenges in international enforcement, domestic legal actions are crucial for setting precedents, deterring local misuse, and influencing future legislation, underscoring the need for agile legal frameworks to combat synthetic media and algorithmic bias.</p>\n\n<p>Furthermore, the complexities of \"untraceable\" URLs present both privacy benefits and accountability challenges. India is proactively developing AI-based detection systems, such as \"Cyber Swachhta Kendra,\" and crafting technology-neutral principles to strengthen its cybersecurity infrastructure. The upcoming Digital India Act aims to modernize digital governance by balancing security, accountability, and fundamental rights, positioning India as a global model for secure, rights-based digital governance.</p>\n\n<p>Ultimately, India must foster thoughtful regulation, robust enforcement, and industry self-regulation to responsibly harness AI's potential in media. This includes evolving laws to protect individual rights, ensure transparency, and uphold public trust in digital content, without compromising ethical or legal standards.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ai-and-the-media-legal-challenges-on-the-new-frontier.jpg"
  },
  {
    "title": "Enforcing A 92-Year-Old Decree: The Supreme Court On Faith, Proof, And Possession",
    "description": "<p>In 2025, the Supreme Court of India resolved a 92-year-old temple dispute concerning Sangalappa Swamy, stemming from a 1933 compromise decree. The case involved the Kapadam and Kamatam families, both from the Kuruba community, who disputed hereditary rights to worship the deity and possess sacred items. The original decree mandated alternating idol possession, rotating ritual duties, a ₹2,000 payment from the Kamatams, and the appointment of trustees.</p>\n\n<p>Decades later, the Kapadam families initiated an execution petition, accusing the Kamatams of breaching the rotation agreement and unlawfully retaining the idols. The Kamatams argued that the 1933 decree's key conditions, including the payment and trustee appointments, were never implemented, and thus, the arrangement itself was never put into practice.</p>\n\n<p>The Supreme Court upheld the Andhra Pradesh High Court's decision, asserting that while the 1933 compromise decree was valid, its enforcement required concrete proof of violation. The Kapadams failed to provide evidence that the initial payment was made, trustees were appointed, or that the idols had ever rotated between the villages as per the decree. The Court emphasized that sentiment alone cannot enforce a decree; legal execution demands clear evidence of breach, with the burden of proof resting on the party seeking enforcement.</p>\n\n<p>This judgment highlights that religious and customary rights, though respected, must adhere to the same evidentiary standards as other legal claims. It underscores the critical importance for communities and trustees to maintain proper records and ensure transparency. The ruling serves as a vital lesson that justice, even in matters of profound devotion, fundamentally demands proof, ensuring that faith and law can coexist harmoniously through documented evidence.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-ends-92-year-old-temple-decree-dispute.jpg"
  },
  {
    "title": "Regulating The Machine Mind: AI, Privacy, And Intellectual Property Under India’s 2025 AI Governance Guidelines",
    "description": "<p>India's Ministry of Electronics & Information Technology (MeitY) released its AI Governance Guidelines in November 2025, establishing the nation's first comprehensive, yet currently voluntary, framework for responsible AI. These guidelines aim to balance promoting innovation with safeguarding fundamental rights, guided by the philosophy of \"innovation over restraint.\" They introduce \"Seven Sutras\" for ethical AI, mirroring global standards while addressing India's unique socio-economic context.</p>\n\n<p>A core focus is data privacy, explicitly tethering AI governance to the Digital Personal Data Protection Act (DPDP) 2023. This mandates privacy-by-design, explicit consent for personal data use, purpose limitation, and transparency about AI interaction. Data principals' rights (access, correction, erasure) must be honored, requiring robust data governance and provenance tracking from AI actors.</p>\n\n<p>For intellectual property, the Guidelines acknowledge the ambiguity of AI-generated works under existing copyright law, which presupposes human authorship. They signal a review of the Copyright Act, 1957, potentially introducing \"related rights\" and clarifying fair dealing exceptions for text and data mining (TDM) for AI training. A licensing framework and dataset provenance documentation are encouraged to mitigate legal risks for developers and protect creators.</p>\n\n<p>The framework also addresses liability and accountability, proposing clear definitions for AI actors (developers, deployers, users) and shared responsibility, with future amendments to the IT Act, 2000, anticipated. To combat deepfakes and harmful AI-generated content, the Guidelines emphasize content authentication through digital watermarks and unique identifiers, advocating for multi-stakeholder collaboration on global standards. India's approach takes a middle path between the EU's stringent regulation and the US's innovation-driven model, aiming for a pragmatic balance as these voluntary guidelines are poised to transition into binding legislation. Businesses are urged to prioritize lawful data collection, secure IP clearances, and operationalize ethical AI principles.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ai-privacy-and-copyright-under-indias-2025-governance-guidelines.jpg"
  },
  {
    "title": "IBBI Discussion Paper, 14 November 2025: Proposed Re-calibration of Valuation Architecture under the Insolvency and Bankruptcy Code, 2016",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has released a discussion paper addressing systemic issues in the valuation process, including non-uniform reports, divergent standards, an asset-centric definition of fair value, disproportionate costs for small debtors, and the absence of an integrated enterprise-level figure. These issues lead to litigation and reduced stakeholder confidence. The paper proposes five key amendments to subordinate legislation to enhance transparency, consistency, and predictability in fair and liquidation value determinations.</p>\n\n<p>Firstly, to improve consistency and auditability, the Board recommends an omnibus enabling clause to prescribe standardized report templates and obligatory documentation protocols via circulars for all insolvency proceedings. These templates will be modular, allowing for asset-class specific schedules while maintaining a common master format.</p>\n\n<p>Secondly, the paper proposes unifying valuation standards. It suggests replacing current references to \"internationally accepted valuation standards\" or the Companies (Registered Valuers and Valuation) Rules, 2017, with \"valuation standards as specified by the Board,\" thus granting the IBBI authority to promulgate a single, consistent standard.</p>\n\n<p>Thirdly, the definition of \"fair value\" is set to undergo a significant conceptual change. The revised definition will require valuers to estimate the corporate debtor's realizable value as an economic unit, incorporating tangible and intangible assets (e.g., brand, goodwill) and the synergistic premium of a going-concern transaction, rather than merely discrete assets.</p>\n\n<p>Fourthly, to mitigate the burden on small estates, the paper suggests a calibrated derogation allowing for the appointment of a single registered valuer per asset class for corporate debtors with an annual turnover not exceeding ₹500 crore or those qualifying as MSMEs. The Committee of Creditors retains discretion to mandate a second set with stated reasons.</p>\n\n<p>Finally, to synthesize individual asset-class estimates into a comprehensive enterprise-level figure, the paper introduces a \"Coordinator Valuer.\" This individual will integrate underlying valuations to furnish an Aggregate Fair Value (AFV) for the corporate debtor, with a mechanism for averaging AFVs and addressing significant deviations. An equivalent system is proposed for liquidation value.</p>\n\n<p>Stakeholder comments are invited on these proposals by December 7, 2025. If implemented, these amendments are expected to establish a rule-based, verifiable, enterprise-centric valuation architecture, thereby minimizing informational friction, curtailing litigation risk, and advancing the Code's objective of value maximization.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-proposes-major-overhaul-of-ibc-valuation-framework.jpg"
  },
  {
    "title": "SC Reaffirms That Counterclaims Are Maintainable Only Against Plaintiffs, Not Co-Defendants",
    "description": "<p>In a significant ruling, the Supreme Court of India in Sanjay Tiwari v. Yugal Kishore Prasad Sao & Ors. clarified that a counterclaim, as per Order VIII Rule 6A of the Code of Civil Procedure, 1908, can only be maintained against the plaintiff and not against a co-defendant. This decision reinforces procedural discipline and prevents the misuse of counterclaims to resolve disputes between co-defendants.</p>\n\n<p>The case originated from a suit for specific performance filed by Sanjay Tiwari (the plaintiff) against the first defendant concerning an alleged oral agreement for land sale. Following the first defendant's contention of non-joinder, defendants 2 and 3 were impleaded. Subsequently, defendants 2 and 3 filed a counterclaim against the first defendant, seeking conveyance of a portion of the same land based on their own alleged agreement. Both the Trial Court and the High Court allowed this counterclaim, reasoning that it would avoid multiplicity of proceedings. The plaintiff then appealed to the Supreme Court, arguing that a counterclaim cannot be raised against a co-defendant.</p>\n\n<p>The Supreme Court bench meticulously examined Order VIII Rule 6A CPC, emphasizing that a counterclaim is a defensive plea intended to be asserted by a defendant against the plaintiff to avoid multiple proceedings between these two parties. The Court highlighted that the provision does not envisage disputes between co-defendants. Citing previous judgments like Rohit Singh v. State of Bihar and J. Charitable Trust v. V.M.R. Janardana Iyengar, the Court affirmed that the scope of a counterclaim is strictly limited to claims against the plaintiff.</p>\n\n<p>Furthermore, the Supreme Court found the counterclaim by defendants 2 and 3 to be without substantive merit, noting inconsistencies in their claims, a lack of readiness and willingness to perform their part of the contract, and crucially, that the claim itself was time-barred, having been filed in 2006 for a cause of action that arose in 2002. The Court explicitly rejected the High Court's rationale that procedural efficiency could override statutory provisions governing counterclaims. Consequently, the Supreme Court allowed the appeal, setting aside the counterclaim of defendants 2 and 3 and remanding the original suit for specific performance to the Trial Court, with all other issues remaining open.</p>\n\n<p>This judgment serves as a vital precedent, underscoring that counterclaims must adhere strictly to the statutory framework and cannot be employed to resolve collateral disputes among co-defendants within the plaintiff's suit. It ensures that the judicial process maintains focus on the original cause of action and prevents the expansion of a suit's scope beyond its intended purpose.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-clarifies-counterclaims-apply-only-against-plaintiffs.jpg"
  },
  {
    "title": "Applying Sub-Limit to Wrong Procedure Amounts to Deficiency in Service, Rules Ernakulam Consumer Commission",
    "description": "<p>The District Consumer Disputes Redressal Commission, Ernakulam, has ruled against Future Generali India Insurance Company Ltd. and its affiliate, finding them guilty of deficiency in service and unfair trade practice. This judgment stems from the insurer's wrongful curtailment of a medical insurance claim by misapplying a policy sub-limit intended for urinary stone removal to a distinct surgical procedure for urethral stricture, causing financial and emotional distress to the complainant.</p>\n\n<p>The complainant, Lype P. Joseph, underwent Visual Internal Urethrotomy (VIU) for bulbar urethral stricture at Apollo Adlux Hospital, incurring expenses of ₹71,553/-. Despite this, the insurer approved only ₹35,000, citing a special condition (h) related to \"Urinary Stone (including DJ stent removal for the same stone).\" Joseph disputed this, providing medical documentation confirming VIU as a stricture-relieving procedure, not stone removal, but his appeals to the insurer were unsuccessful, leading him to file a complaint.</p>\n\n<p>Future Generali defended its decision, arguing that the treatment was related to urinary stone disease, referencing the complainant's history and an email description. However, the Commission found that the insurer had wrongly invoked the sub-limit. It referenced the discharge summary and doctor's certificate, which unequivocally stated that VIU treats urethral stricture. Applying the principle of contra proferentem, which dictates that ambiguities in policy clauses must favor the insured, and citing the Kerala High Court's stance on unjustified claim denials violating the right to life, the Commission concluded that the insurer's actions were arbitrary, medically unfounded, and constituted a deficiency in service and unfair trade practice.</p>\n\n<p>Consequently, the Commission directed the insurer to pay the remaining claim amount of ₹36,553 with 9% interest from the complaint date, along with ₹10,000 as compensation for mental agony and suffering, and an additional ₹10,000 for litigation costs. This landmark ruling underscores that insurance policies are intended as a safety net, not a barrier, emphasizing the insurer's ethical and legal obligation for transparent, medically sound, and good-faith claim assessments, thereby reinforcing consumer rights and fostering accountability within the insurance sector.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ernakulam-commission-fines-insurer-for-wrong-sub-limit-use.jpg"
  },
  {
    "title": "Madras HC Rules Technical Lapses Cannot Vitiate SARFAESI Auction Sale: A Guide to Rule 9 Validity",
    "description": "<p>The Madras High Court, in the case of M/s Lucky Footwear Components & Ors. v. Indian Bank & Ors., has affirmed that minor technical irregularities in the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002 (SARFAESI Act) auction process cannot invalidate a sale. The Division Bench emphasized that judicial interference under Article 227 of the Constitution is limited and requires borrowers to demonstrate substantial prejudice, fraud, or collusion to challenge a concluded auction successfully.</p>\n\n<p>The case involved M/s Lucky Footwear Components, which defaulted on financial facilities from Indian Bank, leading to SARFAESI recovery proceedings and a subsequent public auction. The borrowers challenged the auction through the Debts Recovery Tribunal (DRT), Debt Recovery Appellate Tribunal (DRAT), and finally the High Court under Article 227. The High Court meticulously examined and rejected the borrowers' contentions, including claims of inadequate sale notice period (confirming \"not less than fifteen days\" was met without requiring \"clear days\"), insufficient property description, and outdated valuation. The Court noted that valuation by an approved valuer was sufficient and that minor deviations from internal policies or directory guidelines would not invalidate an auction without proven material prejudice or undervaluation. Furthermore, the borrowers' earlier communication was deemed a request for extension, not a formal objection under Section 13(3A), and new issues like loan classification were not entertained as they were not raised previously.</p>\n\n<p>Ultimately, the Division Bench dismissed the Civil Revision Petition, upholding the validity of the auction and affirming the decisions of the lower tribunals. Relying on Supreme Court precedent, the Court reiterated that concluded auction sales are not to be interfered with lightly unless tainted by fraud, collusion, or gross underpricing. The judgment underscores that Article 227 jurisdiction is supervisory, not appellate, and does not permit reappreciation of factual findings unless they are perverse or contrary to law.</p>\n\n<p>This decision reinforces the finality and integrity of SARFAESI auctions, signaling to borrowers that challenges must be based on concrete evidence of fundamental illegality, fraud, or substantial prejudice rather than minor procedural deviations. For banks, the ruling provides assurance that compliance with statutory requirements and engagement of approved valuers will protect their recovery actions from undue judicial interference.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-upholds-sarfaesi-auction-despite-technical-lapses.jpg"
  },
  {
    "title": "Supreme Court: Decree Passed in Favour of Deceased Parties is a Nullity, Trial Court Decree Revived for Execution",
    "description": "<p>The Supreme Court of India has unequivocally ruled that a judicial decree passed in favor of deceased parties, without the mandatory substitution of their legal heirs, is a nullity in law. In the case of Vikram Bhalchandra Ghongade v. State of Maharashtra & Ors., the Court reinstated a trial court decree, asserting that such a defective appellate decree, rendered in violation of Order XXII of the Code of Civil Procedure, 1908 (CPC), is devoid of legal effect and cannot supersede a valid prior judgment. This significant decision underscores the critical importance of procedural compliance in maintaining the legitimacy of judicial outcomes.</p>\n\n<p>The dispute originated from a two-decade-old land allotment matter, where legal heirs of an ex-serviceman, Mr. Arjunrao Thakre, secured a trial court decree in 2006, challenging an illegal re-allotment of his land. During the subsequent first appeal filed by the opposing parties, two appellants died before the appeal was heard, and their legal heirs were never brought on record. Despite this procedural lapse, the First Appellate Court proceeded to modify the trial court decree. This led to a complex legal trajectory, with the Executing Court and Bombay High Court initially upholding the appellate decree, leading to the appeal before the Supreme Court.</p>\n\n<p>The Supreme Court, setting aside the lower court orders, definitively held that the first appellate decree was a nullity. Its rationale was based on the fact that the decree was rendered in an appeal where both appellants had passed away prior to the hearing, and their legal heirs were not substituted as mandated by Order XXII CPC. The Court clarified that Order XXII Rule 6 CPC, which allows proceedings to continue if a party dies after arguments conclude but before judgment, was inapplicable as the deaths occurred before the hearing commenced. Consequently, the void appellate decree could not modify or supersede the valid trial court decree, which was thus revived for execution.</p>\n\n<p>This landmark ruling in Vikram Bhalchandra Ghongade v. State of Maharashtra & Ors. serves as a robust reaffirmation of the indispensable nature of procedural compliance in judicial proceedings. The Court explicitly affirmed that a decree passed in favor of deceased litigants without heir substitution constitutes a jurisdictional defect, rendering the decree void ab initio and subject to challenge at any stage, even during execution. The decision clarifies the limited scope of Order XXII Rule 6 CPC and reinforces the fundamental principle that judicial outcomes must rest on procedural fairness and due process, affirming that the law does not recognize decrees pronounced in favor of the dead.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-decree-for-deceased-parties-void-trial-decree-revived.jpg"
  },
  {
    "title": "Supreme Court Split Multiplier Motor Accident Compensation 2025: Superannuation Not Exceptional Circumstance",
    "description": "<p>The Supreme Court of India has delivered a significant judgment, Preetha Krishnan & Ors. vs. United India Insurance Co. Ltd. & Ors. (2025 INSC 1293), decisively rejecting the controversial \"split multiplier\" concept in motor accident compensation calculations. Rendered on November 6, 2025, by Justices Sanjay Karol and Prashant Kumar Mishra, this ruling restores uniformity and certainty, stipulating that superannuation from service does not qualify as an exceptional circumstance warranting a reduction in compensation.</p>\n\n<p>The case originated from a 2012 accident that claimed the life of T.I. Krishnan, a 51-year-old Assistant Engineer. While the Motor Accidents Claims Tribunal initially awarded Rs. 44,04,912, the Kerala High Court subsequently introduced the \"split multiplier.\" It significantly reduced the compensation for loss of dependency, arguing that Krishnan's income would decrease by approximately 50% after his projected superannuation in four years. This approach, which led to a substantial reduction in the total compensation, was challenged by the claimants before the Supreme Court.</p>\n\n<p>The Supreme Court's analysis was anchored in foundational precedents such as Sarla Verma v. DTC and National Insurance Co. Ltd. v. Pranay Sethi, which established the structured framework for age-based multipliers and future prospects. Crucially, the Court reiterated the principle from Sumathi v. National Insurance Co. Ltd. that a split multiplier is only permissible in exceptional circumstances with specific recorded reasons, a condition that superannuation alone does not fulfill. The Court highlighted the pervasive inconsistency among High Courts in applying the split multiplier, emphasizing that such speculative calculations undermine the beneficial nature of the Motor Vehicles Act and the paramount need for uniformity and predictability in compensation awards.</p>\n\n<p>In its final decision, the Supreme Court set aside the High Court's application of the split multiplier. It recomputed the compensation by applying the correct multiplier of 11 (for ages 51-55), factoring in future prospects and standard deductions. This resulted in a total compensation of Rs. 47,76,794, an amount that exceeded the Tribunal's original award. The judgment, which applies prospectively, directs all High Courts and Motor Accident Claims Tribunals to cease using this flawed methodology, thereby ensuring consistent, uniform, and just compensation for victims' families nationwide.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-ends-split-multiplier-in-accident-awards.jpg"
  },
  {
    "title": "IBBI Tightens Transparency Norms: New Disclosure Templates for Resolution Applicants to Safeguard Section 32A Immunity",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has introduced a significant measure to enhance transparency and integrity in corporate insolvency resolution processes. Through a Discussion Paper released on 6 November 2025, the IBBI proposes mandatory disclosure templates for beneficial ownership and Section 32A eligibility for all Prospective Resolution Applicants (PRAs). This initiative aims to prevent the misuse of the \"clean slate\" immunity under Section 32A, which shields corporate debtors from prosecution for pre-insolvency offenses, by ensuring ineligible individuals with questionable backgrounds cannot acquire companies through opaque structures.</p>\n\n<p>This move stems from stakeholder feedback regarding the practical application of the Insolvency and Bankruptcy Code, 2016, and builds on the IBBI's prior emphasis in August 2025 for enhanced Section 32A disclosures. The proposed framework mandates amendments to Regulation 38 of the CIRP Regulations, compelling PRAs to submit a detailed beneficial ownership statement and a sworn affidavit on Section 32A eligibility. Crucially, the initiative aligns with the Reserve Bank of India’s updated Master Direction on Know Your Customer (KYC) norms, defining a \"beneficial owner\" as any natural person holding more than 10% ownership or control in companies, LLPs, and trusts, or over 15% in unincorporated bodies.</p>\n\n<p>The new disclosure requirements are detailed in two annexures. Annexure A outlines the beneficial ownership template, starting with basic corporate details and offering a streamlined disclosure path for listed entities that provide public filing links. For unlisted PRAs, it demands exhaustive details of natural person beneficial owners, including their nationalities, jurisdictions, percentage of control, identity documents, and a tier-wise ownership structure chart. Part IV of Annexure A requires a solemn declaration affirming the statement's accuracy and that no disclosed person is disqualified under Section 29A. Annexure B is a formal affidavit, to be sworn by the PRA’s authorized signatory, requiring an unequivocal declaration of eligibility for Section 32A immunity, a factual statement on prior connections to the corporate debtor, and confirmation that incoming management also meets Section 32A(1) criteria.</p>\n\n<p>The IBBI has invited public comments on these proposals until 16 November 2025, from a broad spectrum of stakeholders. These new norms are expected to significantly empower creditor committees to penetrate complex ownership structures, deter tainted promoters or shell companies from re-acquiring distressed assets, and facilitate inter-regulatory data sharing. Ultimately, this framework is anticipated to enhance the quality of resolution plans, fostering greater confidence among lenders and investors in India's distressed asset market.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-mandates-new-disclosure-templates-for-insolvency.jpg"
  },
  {
    "title": "Shock-Ready Factories: Telangana Draft Rules Add AED to Factory Medical Kit",
    "description": "<p>Telangana's Labour Employment Training & Factories Department has issued a preliminary notification (G.O.Rt.No.433, October 25, 2025) proposing a groundbreaking amendment to the Telangana Factories Rules, 1950. This draft rule aims to make Automatic External Defibrillators (AEDs) a mandatory component of Occupational Health Centres and Ambulance Rooms in factories, positioning Telangana as the first state in India to legally enforce such a requirement. The move addresses the critical gap in current factory medical facilities, which are often ill-equipped for sudden cardiac emergencies, where every minute lost drastically reduces survival chances.</p>\n\n<p>The initiative stems from a proposal highlighting the increasing vulnerability of even young workers to cardiac events in industrial settings. While AEDs are portable, user-friendly devices capable of restoring heart rhythm in the crucial minutes before professional medical help arrives, they are currently not specified in the existing equipment lists of Rules 61 and 64. The department determined that statutory compulsion, rather than advisory guidelines, is necessary to ensure the widespread placement and availability of these life-saving devices.</p>\n\n<p>The proposed amendment will add \"Automatic External Defibrillator\" as a new entry to Rule 61 and an additional item to Rule 64(3), covering factories employing 500 or more workers or engaged in hazardous processes. These factories will be required to procure and maintain AEDs at their own cost. In line with Section 115 of the Factories Act, the notification opens a 45-day public window for individuals, employers, trade unions, and other stakeholders to submit written objections or suggestions to the Director of Factories before the rule is finalized and enforced.</p>\n\n<p>If implemented, this proposal will significantly enhance worker safety, transforming factory medical rooms into more robust emergency response zones. For management, while incurring an upfront cost, the mandatory presence of AEDs could prove invaluable in averting fatalities, reducing costly litigation, and minimizing operational downtime resulting from medical emergencies. The 45-day consultation period is crucial for shaping this potentially life-saving legislation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/telangana-to-mandate-aeds-in-factory-medical-rooms.jpg"
  },
  {
    "title": "NCLAT Draws Red Line: CCI Can’t Police Patent Abuse, Only Patent Office Can",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) has delivered a significant ruling, asserting that the Competition Commission of India (CCI) lacks jurisdiction to police the abuse of patent rights, as this domain falls exclusively under the Patents Act. This decision emerged from an appeal filed by Mr. Swapan Dey against Vifor International (AG), a Swiss pharmaceutical giant, concerning its iron-deficiency injection, Ferric Carboxymaltose (FCM). The NCLAT emphatically stated that when the subject matter involves the exercise of patent rights, the Competition Act must yield to the specialized Patents Act, a stance with far-reaching consequences for intellectual property and competition strategies.</p>\n\n<p>Mr. Swapan Dey, CEO of a hospital, observed the high cost and limited availability of Vifor's patented FCM injectable, crucial for iron-deficient dialysis patients. Believing Vifor's pricing and restrictive licensing practices constituted an abuse of dominance under the Competition Act, he filed a complaint with the CCI. The CCI, however, closed the case in October 2022, finding no prima facie violation after examining Vifor's agreements and noting the patent's impending expiry. Aggrieved by this decision, Dey appealed to the NCLAT.</p>\n\n<p>During the appeal, Dey's counsel argued that the CCI had failed to properly assess the relevant market and the impact of restrictive licensing on market access and pricing. Vifor countered that the Patents Act, 1970, being a special and later legislation, provides a complete framework (Chapter XVI) for addressing unreasonable license terms or patentee abuse, thus superseding the general Competition Act. A critical precedent influencing the NCLAT's decision was the Delhi High Court's Ericsson judgment, subsequently upheld by the Supreme Court, which affirmed that the Patents Act prevails over the Competition Act when patent rights are in contention, leading to the quashing of CCI's investigations in that case.</p>\n\n<p>The NCLAT bench, acknowledging that the FCM patent had expired post-scrutiny, accepted Vifor's argument that the CCI's jurisdiction is ousted when the matter concerns the bona-fide exercise of a statutory patent right. This conclusion was grounded in Section 3(5) of the Competition Act, which protects \"reasonable conditions\" imposed by patent holders, and the comprehensive scheme of Chapter XVI of the Patents Act. The Tribunal clarified that if issues of affordability or public health arise from patented drugs, the correct recourse for complainants is to seek a compulsory license under Section 84 of the Patents Act, rather than pursuing a competition complaint. This ruling reinforces the principle that special laws take precedence over general laws in their specific domains, thereby delineating the boundaries of the CCI's authority in intellectual property matters and directing complainants towards the appropriate regulatory body for patent-related grievances.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclat-rules-cci-has-no-say-in-patent-abuse-disputes.jpg"
  },
  {
    "title": "ISO vs AOAC vs BIS: How the Latest FSSAI Amendment Will Speed Up Food Imports",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has introduced significant amendments to its import regulations with the publication of the Food Safety and Standards (Import) First Amendment Regulations, 2025, effective from May 1, 2026. This update aims to streamline India's food import clearance process by accelerating procedures and enhancing scientific adaptability, following a year-long consultative process.</p>\n\n<p>A key revision under Regulation 10(4)(b) addresses analytical testing methods. Previously, laboratories were restricted to FSSAI-issued analytical manuals. The amendment now allows laboratories to adopt any internationally accepted, validated method—such as AOAC, ISO, BIS, or Codex Alimentarius—if a specific testing parameter is not covered by FSSAI manuals. This change resolves a prior regulatory gap that often led to testing delays or the need for case-by-case dispensations.</p>\n\n<p>Furthermore, a critical new provision, sub-regulation 10(5), imposes a statutory timeline for analytical reports. From May 2026, all notified or referral laboratories must issue their findings in Form-2 within five calendar days of receiving a sample. This mandate, coupled with the expanded scope for testing methods, is expected to significantly shorten the average import clearance window and reduce demurrage costs for importers.</p>\n\n<p>Collectively, these amendments represent a modernization of India's food-safety architecture. By embracing globally recognized test methods and enforcing strict reporting timelines, FSSAI has achieved a balance between scientific rigor and trade facilitation, benefiting both consumer advocates and stakeholders in the food supply chain without compromising safety standards.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssais-2025-import-amendment-to-fast-track-food-clearances.jpg"
  },
  {
    "title": "No Toll for Police Help: Rajasthan HC Blocks Magistrate Bid to Load SARFAESI Section 14 With Pre-Deposit",
    "description": "<p>The Rajasthan High Court has delivered a significant ruling, setting aside a Chief Judicial Magistrate's (CJM) order that demanded a pre-deposit for police assistance under Section 14 of the SARFAESI Act, 2002. This decision prevents the introduction of an arbitrary financial hurdle into a summary remedy intended for speedy enforcement, clarifying that state assistance for securing physical possession is an enforcement obligation, not a chargeable service.</p>\n\n<p>The case arose when Tyger Home Finance Pvt. Ltd., after taking symbolic possession of a defaulted property in Alwar, sought the CJM's aid for physical possession with police support. The CJM, Alwar, issued the possession order but made it contingent on the financier depositing ₹6.34 lakh towards \"police expenses.\" This amount was deemed disproportionate to the outstanding loan and lacked any statutory backing or precedent, prompting the financier to challenge the condition before the Rajasthan High Court.</p>\n\n<p>Counsel for Tyger Home Finance argued that Section 14 of the SARFAESI Act is a remedial provision aimed at swift recovery, and it does not authorize secured creditors to pre-finance state machinery. They cited previous rulings that struck down similar deposit requirements. The State contended that the condition was pragmatic due to logistical costs but failed to provide statutory justification. Justice Ashutosh Kumar of the High Court unequivocally stated that \"there is no provision under Section 14 of the Act of 2002 which may authorize the learned Magistrate to direct the secured creditor to deposit any expenses of police assistance.\" The Court underscored that a Magistrate's duty, once satisfied with a lender's entitlement, is to facilitate enforcement without imposing financial gates, which would frustrate the Act's summary purpose.</p>\n\n<p>Consequently, the impugned condition in the CJM's order was set aside. The High Court directed Tyger Home Finance to approach the police directly and instructed the police authorities to comply with the original possession order \"at the earliest\" without insisting on any deposit. This judgment reinforces the critical principle that summary statutory remedies must remain free from extraneous pre-conditions, ensuring that Section 14 serves its intended purpose as a facilitator for lenders and not a mechanism for generating revenue from state services. It establishes a clear precedent that police assistance under Section 14 is an inherent part of the State's enforcement obligation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-nixes-police-deposit-in-sarfaesi-actions.jpg"
  },
  {
    "title": "CKYC Opens Digital Doors: New Relief for Differently-Abled Customers",
    "description": "<p>The Central KYC Records Registry (CKYCRR) announced a significant policy change on October 31, 2025, aimed at improving digital banking accessibility for millions of differently-abled individuals in India. This circular, effective November 14, 2025, makes three previously mandatory data fields optional for customers who identify as differently abled across banks, mutual funds, insurance companies, and fintech entities.</p>\n\n<p>Previously, differently-abled applicants were required to provide their exact medical impairment label, the precise percentage assigned by a certifying authority, and their Unique Disability ID (UDID) to complete digital onboarding. This stringent requirement created substantial barriers, forcing many to abandon digital channels due to missing UDIDs, outdated certificates, or a reluctance to disclose sensitive medical information, thereby defeating the objective of financial inclusion.</p>\n\n<p>Responding to regulatory feedback, CKYCRR has reclassified these three fields as optional. While institutions must still display these boxes in their interfaces, users can now leave them blank. The only remaining mandatory data point is a simple \"yes/no\" question confirming if the customer is differently abled, which allows for continued tracking of inclusion metrics without impeding the workflow. This adjustment signifies a crucial step towards reducing friction in digital financial services, allowing differently-abled individuals to open investment and other accounts with greater ease and dignity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ckyc-eases-kyc-rules-for-differently-abled-customers.jpg"
  },
  {
    "title": "Broken Assurances, Coerced Payments: Consumer Commission Fines IndiGo for Deficiency in Service",
    "description": "<p>The District Consumer Disputes Redressal Commission, Ernakulam, has issued a significant ruling against IndiGo Airlines, fining it for deficiency in service and unfair trade practices. This decision stems from a complaint filed by Mr. T.P. Salim Kumar, an IRS officer, who was wrongfully deboarded from his flight, subjected to broken assurances, and later publicly humiliated into making a coerced payment for services he was promised would be free.</p>\n\n<p>Mr. Kumar was deboarded due to an \"operational/technical issue\" and was promised a full refund, a confirmed seat on an earlier connecting flight, and complimentary rest and food facilities. IndiGo failed to honor these commitments; his rebooked flight was much later, and while he was directed to an airport lounge with assurances that all expenses would be covered, he was subsequently compelled to pay ₹2,150 for food and a beer under duress, facing public embarrassment and a threat of being denied boarding. IndiGo's subsequent offers of inadequate compensation were refused.</p>\n\n<p>IndiGo contested the complaint on procedural grounds, arguing misjoinder and lack of territorial jurisdiction based on a forum-selection clause. Substantively, the airline admitted offloading due to \"seat-availability constraint,\" claimed the lounge access was a \"goodwill gesture,\" and asserted that alcoholic beverages were \"expressly excluded\" from complimentary services, justifying the charge. However, the Commission dismissed IndiGo's procedural objections as \"hyper-technical,\" affirming Ernakulam's jurisdiction under the Consumer Protection Act, 2019, which supersedes one-sided contractual clauses.</p>\n\n<p>Crucially, the Commission found IndiGo's assurances regarding the connecting flight and lounge expenses to be \"uncontroverted.\" Applying the contra proferentem rule, it determined that IndiGo failed to prove any communication about the exclusion of alcoholic beverages, concluding that forcing the passenger to pay under threat of denied boarding constituted a clear \"deficiency in service\" and an \"unfair trade practice.\" Consequently, the Commission ordered IndiGo to refund the coerced ₹2,150 lounge payment and ₹626 for missed movie tickets, both with 9% annual interest. Additionally, IndiGo was directed to pay ₹1,00,000 as compensation for mental agony and inconvenience, and ₹20,000 towards the cost of proceedings, to be paid within 45 days.</p>\n\n<p>This judgment reinforces consumer rights, serving as a vital reminder to service providers, particularly airlines, that their responsibilities extend beyond mere technical compliance. The ruling underscores that statutory remedies under consumer protection laws cannot be circumvented by ambiguous contractual terms or \"hyper-technical\" defenses, thereby upholding passenger dignity and the \"relationship of trust\" inherent in air travel.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/consumer-commission-fines-indigo-for-coerced-payment.jpg"
  },
  {
    "title": "Won the Battle, Must Win the War: Rajasthan High Court Enforces United Kingdom GAFTA Award",
    "description": "<p>The Rajasthan High Court at Jaipur has ordered the enforcement of a London-seated GAFTA (Grain and Feed Trade Association) appeal award, effectively converting it into a decree of the Court. This judgment concludes a seven-year dispute involving an Austrian company, Kingsroad Handelsgesellschaft m.b.H., and an Indian entity, Raj Grow Impex LLP, over three container-loads of yellow peas. The ruling is significant for its reaffirmation of the narrow interpretation Indian courts apply to the \"public policy\" defense against foreign award enforcement.</p>\n\n<p>The dispute originated from three back-to-back contracts in September 2018 for Russian-origin yellow peas, brokered with a standard GAFTA arbitration clause. Following contentious issues over price, demurrage, and container free-time, Kingsroad initiated arbitration in London. The first-tier GAFTA tribunal upheld Kingsroad's claim in August 2020, a decision confirmed by the GAFTA Board of Appeal in September 2021. Raj Grow failed to challenge or set aside the award within the stipulated 28-day window in England.</p>\n\n<p>Subsequently, Kingsroad petitioned the Rajasthan High Court for the award's enforcement as a decree, execution against Raj Grow's assets, and costs. Raj Grow resisted enforcement, citing \"patent illegality\" and \"violation of Indian public policy.\" Their primary contention was that Kingsroad's direct payment of container detention charges to shipping lines outside India deprived Raj Grow of input GST credit, leading to revenue loss for the Indian government and thus offending fundamental Indian law, national interest, and morality.</p>\n\n<p>Justice Anoop Kumar Dhand, noting Raj Grow's prior inaction in the arbitration proceedings and abroad, emphasized that Section 48 of the Arbitration and Conciliation Act, 1996, mandates a skeletal inquiry, precluding a review of merits or re-appreciation of evidence. Drawing upon Supreme Court precedents like Vedanta, Avitel Post Studioz, and Shri Lal Mahal, the Court reiterated that \"public policy\" must be construed narrowly, limited to violations of fundamental Indian law, national interest, or basic notions of justice/morality. The Court found that a grievance regarding GST leakage, even if true, constituted a contractual accounting dispute already adjudicated, which neither shocked the conscience nor struck at the root of India's economic order, thus not meeting the stringent public policy threshold.</p>\n\n<p>As a result, the GAFTA Appeal Award was declared enforceable and converted into a decree of the Rajasthan High Court. Raj Grow has been directed to disclose all its assets within six weeks for execution proceedings, while Kingsroad is free to pursue attachment and sale. This judgment strongly reinforces India's pro-enforcement stance towards foreign arbitral awards, limiting merit-based objections and providing greater assurance to international award holders seeking realization of their claims in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-enforces-uk-gafta-award-limits-public-policy.jpg"
  },
  {
    "title": "Medical Devices Step Out of Legal Metrology (Packaged Commodities) Shadow: 2025 Amendment Ends Labelling Confusion",
    "description": "<p>The Legal Metrology (Packaged Commodities) Amendment Rules, 2025 has significantly revised the regulatory framework for medical device packaging, effectively exempting these products from the general consumer packaging regulations. This amendment, enacted under the Legal Metrology Act, 2009, resolves a decade-long conflict and overlap between the Legal Metrology rules and the specialized Medical Devices Rules, 2017 (under the Central Drugs Standard Control Organisation - CDSCO).</p>\n\n<p>The Central Government utilized its power to exempt specific package classes, making the Medical Devices Rules, 2017 the exclusive authority for all labelling declarations on medical device packages. This change is integrated by amending Rule 2(h) of the 2011 Packaged Commodities Rules, which now specifically carves out \"packages containing medical devices\" from the definition of a \"pre-packaged commodity.\" Consequently, previous requirements for precise typographic measurements (Rules 7(2) and 7(3)) are no longer applicable; instead, the 2017 Rules' focus on legibility and contrast will govern. Furthermore, Rule 33 clarifies that no Legal Metrology waivers or concessions apply where the Medical Devices Rules, 2017 are in effect, solidifying the medical device regime as the sole compliance pathway.</p>\n\n<p>This amendment addresses a history of jurisdictional confusion, conflicting court rulings, and operational burdens on manufacturers who previously had to comply with two distinct regulatory bodies. The operational impact for manufacturers is immediate, promising shorter artwork cycles, elimination of redundant dual-language stickers, and faster import clearances. For consumers, essential safeguards on safety, performance, and traceability remain intact, with the enforcement authority now solely under CDSCO. This regulatory adjustment represents a strategic \"de-harmonisation through harmonisation,\" aligning medical devices under a single, more specialized legal framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/medical-devices-exit-legal-metrology-labelling-rules.jpg"
  },
  {
    "title": "Registrar Has No Statutory Authority to Issue NOC for Redevelopment, Rules Bombay High Court",
    "description": "<p>The Bombay High Court has issued a significant ruling, asserting that the Registrar of Cooperative Societies lacks the statutory authority to issue a \"No Objection Certificate\" (NOC) for the redevelopment of cooperative housing societies. This judgment, delivered by Justice Amit Borkar, clarifies that such approvals have no legal basis under the Maharashtra Cooperative Societies Act, 1960, or its associated Rules, 1961. The Court unequivocally stated that the General Body of a cooperative housing society remains the ultimate and supreme authority for all redevelopment decisions, provided procedural compliance and transparency are maintained.</p>\n\n<p>The ruling stemmed from a challenge to an NOC granted by a District Deputy Registrar. The Court found no legal provision empowering the Registrar to approve or reject redevelopment decisions, deeming any such issuance ultra vires. Instead, the Court clarified that the Registrar's role, as per the Government Resolution dated 4 July 2019, is strictly supervisory. This involves nominating an Authorised Officer to attend Special General Meetings (SGMs) for developer selection, ensuring quorum, fair voting, and proper record-keeping, without exercising any power to veto or modify the society's decisions.</p>\n\n<p>Consequently, any NOC previously issued by the Registrar for redevelopment is legally invalid, and decisions lawfully made by the society's General Body remain enforceable. Justice Borkar directed all Registrars across the State to refrain from issuing or insisting upon such NOCs and mandated the Commissioner of Cooperation and the Principal Secretary, Cooperation Department, to issue a departmental circular reiterating these directives. Societies are still required to follow prescribed safeguards, including requesting an Authorised Officer and maintaining proper documentation for transparency.</p>\n\n<p>This landmark judgment significantly enhances the autonomy of cooperative housing societies, streamlines redevelopment processes by removing unnecessary administrative hurdles, and reinforces the General Body's decision-making authority. It is expected to foster faster, fairer, and more transparent redevelopment projects throughout Maharashtra by clearly defining the Registrar's role as purely supervisory rather than one of control or approval.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/registrar-lacks-power-to-approve-redevelopment-bombay-hc.jpg"
  },
  {
    "title": "Hindustan Unilever’s Ice Cream Division to Operate as Independent Entity: NCLT Clears Demerger into Kwality Wall’s (India) Limited",
    "description": "<p>The National Company Law Tribunal (NCLT), Mumbai, has approved the Scheme of Arrangement for the demerger of Hindustan Unilever Limited's (HUL) Ice Cream Business Undertaking into its wholly-owned subsidiary, Kwality Wall’s (India) Limited (KWIL). This significant corporate reorganization aligns with Unilever PLC's global strategy to separate its ice cream operations, positioning KWIL as an independent business entity.</p>\n\n<p>HUL's Ice Cream Business, which includes popular brands such as Kwality Wall’s, Cornetto, and Magnum, will now operate under KWIL. This move aims to provide focused management, tailored strategy, and greater flexibility for the ice cream division to pursue market opportunities independently. The scheme ensures continuity of shareholder value by granting HUL shareholders one KWIL share for every HUL share held, maintaining a 1:1 entitlement ratio.</p>\n\n<p>The NCLT approved the scheme after extensive review, confirming it was fair, reasonable, and fully compliant with all statutory and regulatory requirements. All necessary approvals from regulatory bodies, including SEBI, BSE, and NSE, were secured, and no objections were raised by stakeholders or authorities. The Tribunal affirmed that the demerger would benefit all stakeholders without prejudicing the interests of creditors or employees.</p>\n\n<p>This landmark demerger marks a strategic milestone for HUL. It paves the way for Kwality Wall’s (India) Limited to pursue focused growth in the frozen desserts and ice cream segment as a dedicated and independent company within the Unilever group in India. Concurrently, it allows HUL to consolidate resources and strategic efforts on its core fast-moving consumer goods (FMCG) portfolio, thereby enhancing overall value creation and operational efficiency. The NCLT's sanction underscores its role in facilitating transparent and compliant business realignments.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclt-clears-hul-ice-cream-demerger-into-kwality-walls.jpg"
  },
  {
    "title": "When Banking on Fraud-Reporting Backfires: Delhi HC Quashes Criminal Defamation Case Against Bank CEOs",
    "description": "<p>The Delhi High Court recently quashed a criminal defamation complaint filed by Rangoli International Pvt. Ltd. against the Managing Directors and senior officials of four public-sector banks. The company had accused the bankers of \"malicious slander\" after its ₹250-crore loan account was classified as \"fraud\" and reported on the RBI/CRILC portal. Justice Neena Bansal Krishna ruled in favor of the banks, emphasizing that classifying an account as fraud, when based on central-agency requests and internal investigations, does not constitute defamation.</p>\n\n<p>The genesis of the dispute was Rangoli International's consortium facility, which became a Non-Performing Asset (NPA) by March 2015. A CBI raid on Rangoli's premises in 2014, though not resulting in a charge-sheet against the company, prompted a forensic audit by the lenders. Following inconclusive audit reports, but concurrent letters from the CBI and RBI directing banks to examine the account for fraudulent activity, the banks conducted internal re-examinations. Discovering discrepancies such as bogus airway bills, the banks, adhering to RBI Master Directions on Fraud Classification, independently declared the account \"fraud\" and uploaded this status to the CRILC/FGM portal.</p>\n\n<p>The High Court's decision was anchored on several pivotal arguments. Firstly, it affirmed that the banks were discharging a statutory duty by reporting fraud as requested by regulatory bodies, thereby protected by Exception 9 to Section 499 IPC, which safeguards good-faith accusations made to lawful authorities. The publication was limited to regulatory portals, mitigating any intent to harm reputation. Secondly, the Court reiterated that a company, being a juristic person, inherently lacks the mens rea (criminal intent) essential for defamation under Sections 499/500 IPC. Moreover, vicarious criminal liability cannot be imposed on officers without an explicit statutory provision, which is absent in the IPC for defamation. The complaint also failed to demonstrate personal involvement or malicious intent from individual officials. Finally, the absence of prior sanction under Section 197 Cr.P.C. for public servants was noted, and the complaint itself was deemed an abuse of process aimed at coercing the banks.</p>\n\n<p>This landmark judgment provides crucial clarity, underscoring that reputational grievances cannot be escalated into criminal defamation without concrete proof of personal criminal intent. By reaffirming the mens rea barrier for juristic persons and highlighting the necessity of explicit vicarious liability provisions, the Delhi High Court has reinforced good-faith compliance by financial institutions against potential penal litigation. The ruling empowers lenders to adhere to mandatory and time-bound fraud reporting guidelines without the apprehension of unwarranted criminal charges.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-quashes-defamation-case-against-bank-ceos.jpg"
  },
  {
    "title": "Pay First, Recover Later: SC Reiterates Humanitarian Approach in Motor Accident Compensation",
    "description": "<p>In a landmark ruling, the Supreme Court of India, in K. Nagendra v. New India Assurance Co. Ltd., reaffirmed the victim-centric principle in motor accident compensation, holding that an insurer cannot deny compensation to accident victims due to technical policy breaches, such as a vehicle operating beyond its sanctioned route permit. This decision underscores the social justice intent of the Motor Vehicles Act, 1988, positioning motor insurance as a public welfare instrument rather than merely a private contract. The core of the judgment relies on the \"pay and recover\" doctrine, ensuring immediate compensation for victims while preserving the insurer's right to seek recovery from the vehicle owner for proven contractual violations.</p>\n\n<p>The case originated from a fatal motor accident involving a bus, owned by K. Nagendra and insured by New India Assurance Co. Ltd., which was allegedly plying outside its permitted route. While the Motor Accidents Claims Tribunal awarded compensation, the insurer challenged it, citing a fundamental breach of policy conditions. The central legal question before the Apex Court was whether a route permit violation absolves the insurer from third-party liability or if it must still compensate victims before seeking recovery from the vehicle owner.</p>\n\n<p>The Supreme Court emphatically stated that an insurer cannot escape liability to third parties solely because the vehicle operated outside its sanctioned route. It emphasized that the essence of compulsory insurance under the Motor Vehicles Act is to prevent victims from being left uncompensated due to technical defaults. The Court reiterated the \"pay and recover\" mechanism, directing the insurer to first disburse compensation to the victims and then recover the amount from the vehicle owner if the policy breach is established. This approach judiciously balances the protection of third-party rights with the insurer's contractual interests. While prioritizing victim compensation, the Court also clarified that the insurer's obligations are not unlimited, respecting contractual boundaries where liability clearly falls outside the agreed framework.</p>\n\n<p>Consequently, the Supreme Court upheld the High Court's decision, directing New India Assurance Co. Ltd. to pay the awarded compensation to the victims' dependents and subsequently recover the sum from the vehicle owner, K. Nagendra. This judgment reinforces the imperative of prompt compensation for accident victims, regardless of technical infractions, while also ensuring contractual accountability for vehicle owners who violate permit conditions. The ruling solidifies the integrity of India's motor accident compensation system by embodying both judicial empathy for victims and fairness for insurers.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-upholds-pay-and-recover-in-motor-accident-claims.jpg"
  },
  {
    "title": "Supreme Court Reaffirms Protection to Bona Fide Purchasers in VAT Transactions: Commissioner, Trade & Tax.",
    "description": "<p>The Supreme Court of India, in The Commissioner, Trade and Tax, Delhi v. M/s Shanti Kiran India (P) Ltd., has decisively reaffirmed protection for bona fide purchasing dealers under the Delhi Value Added Tax Act, 2004 (DVAT Act). The Court dismissed the Department's appeals, upholding the Delhi High Court's stance that Input Tax Credit (ITC) cannot be denied to genuine purchasers solely because the selling dealer, despite being registered at the time of transaction, subsequently defaulted on depositing the collected tax with the government. This ruling carries binding legal significance, reinforcing established interpretations and safeguarding genuine business transactions.</p>\n\n<p>The dispute originated from the Department's denial of ITC to purchasing dealers, including M/s Shanti Kiran India (P) Ltd., who had bought goods from validly registered sellers, paid VAT, and possessed proper tax invoices. The Department argued that since the selling dealers later had their registrations cancelled and failed to remit the collected VAT to the treasury, the corresponding ITC claimed by the purchasers was inadmissible.</p>\n\n<p>The Delhi High Court had previously \"read down\" Section 9(2)(g) of the DVAT Act, which stated that ITC would not be allowed if the tax payable by the selling dealer had not been deposited. The High Court reasoned that this provision should not penalize bona fide purchasing dealers acting in good faith without collusion or fraud. It emphasized that the Department's remedy lies against the defaulting seller, not the innocent buyer, to avoid rendering the provision arbitrary and unconstitutional.</p>\n\n<p>The Supreme Court concurred, finding no reason to interfere with the Delhi High Court's judgment. It observed that denying ITC in such circumstances would be unjustified, especially given its earlier confirmation of similar High Court reasoning. The Court concluded that the appeals lacked merit, thereby upholding the right of bona fide dealers to claim ITC.</p>\n\n<p>This concise yet impactful order holds substantial jurisprudential value. It clarifies the scope of Section 9(2)(g), ensuring that honest taxpayers are protected from the defaults of their sellers, provided they have conducted genuine transactions with registered dealers and possess valid documentation. The ruling aligns with broader principles of \"buyer protection\" seen in other indirect tax regimes, such as GST, strengthening the continuity of judicial thought favouring equity, proportionality, and constitutional fairness in tax administration. For businesses, it provides crucial clarity and reassurance that compliance obligations will not extend beyond what is reasonable and just.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-upholds-itc-rights-of-bona-fide-dealers.jpg"
  },
  {
    "title": "Supreme Court Clarifies: Redeemable Preference Shareholders Are Not Financial Creditors Under IBC",
    "description": "<p>The Supreme Court of India, in the case of EPC Constructions India Limited (Through Its Liquidator) v. Matix Fertilizers and Chemicals Limited, has definitively ruled that holders of Cumulative Redeemable Preference Shares (CRPS) are not to be treated as financial creditors under the Insolvency and Bankruptcy Code, 2016 (IBC). This landmark decision reinforces the statutory distinction between share capital and debt, asserting that preference shareholders are investors, not lenders, and their claims for redemption cannot constitute a \"financial debt\" to trigger insolvency proceedings under Section 7 of the IBC.</p>\n\n<p>The dispute originated from EPC Constructions India Limited (EPCC) converting outstanding receivables of ₹250 crore from Matix Fertilizers and Chemicals Limited into 8% CRPS. When Matix failed to redeem these shares due to a lack of profits or fresh issue proceeds, EPCC's liquidator filed an application under Section 7 of the IBC, contending that Matix had defaulted on a \"financial debt.\" Both the NCLT and NCLAT dismissed this petition, leading to the appeal before the Supreme Court.</p>\n\n<p>The Supreme Court's analysis highlighted several key points. It affirmed that preference shares constitute part of a company's share capital under the Companies Act, 2013, and do not represent loans. Therefore, even if redemption is due, failure to redeem does not transform shareholders into creditors. The Court emphasized that redemption under Section 55 of the Companies Act is contingent upon the availability of distributable profits or proceeds from a fresh issue of shares, which Matix lacked. Furthermore, the conversion of receivables into shares extinguished the original debt, making it a conscious equity investment rather than a disguised loan. The Court also rejected arguments based on accounting treatment classifying CRPS as \"unsecured loans,\" stating that accounting standards cannot override the legal nature of a transaction. Finally, it clarified that the \"commercial effect of borrowing\" test under Section 5(8)(f) of the IBC applies only to genuine debt transactions involving the disbursal and time value of money, which equity instruments like CRPS inherently lack.</p>\n\n<p>This ruling by the Supreme Court critically reinforces the distinction between equity and debt within corporate finance. It safeguards the IBC from being invoked as a mechanism for recovering equity investments and underscores that share capital retains its equity character until lawfully redeemed in accordance with the Companies Act. The judgment contributes to strengthening corporate governance by promoting investor discipline and preserving the integrity of corporate capital structures.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-redeemable-preference-shares-not-financial-debt.jpg"
  },
  {
    "title": "Delhi High Court Upholds Crocs’ Design and Brand Integrity in Questsole Dispute",
    "description": "<p>The Delhi High Court has issued an ex-parte ad-interim injunction in favor of Crocs Inc. and its subsidiary, affirming the protection of their extensive intellectual property rights against Sagar Doijode, trading as Questsole, and others. The suit, filed before the Delhi High Court, sought a permanent injunction for alleged infringement of Crocs' patents, trademarks, registered designs, and distinctive trade dress.</p>\n\n<p>Crocs alleged that Questsole was manufacturing, advertising, and selling footwear and shoe charms that were identical or deceptively similar to their products. Specifically, the defendants were accused of infringing Patent No. IN 271337, which covers the system for attaching decorative accessories (Jibbitz) to shoes, and of copying the registered design No. 349374-001 for Crocs' iconic clog-style footwear. Furthermore, Questsole was found to be using deceptive marks like “CROCKS,” “CROC,” and “JIBIT,” infringing Crocs' registered trademarks “CROCS” and “JIBBITZ.” The defendants also imitated Crocs’ distinctive trade dress, characterized by the clogs' unique bulbous shape, ventilation holes, and back strap design, and posted disparaging videos online.</p>\n\n<p>Justice Tejas Karia, after reviewing the evidence, determined that Crocs Inc. possessed substantial global goodwill, reputation, and valid intellectual property registrations. The Court observed that the defendants' actions, including the use of deceptively similar marks and designs, appeared to be a dishonest attempt to exploit Crocs’ established brand identity and create consumer confusion. A test purchase confirmed direct patent infringement, and the visual and structural resemblance between the defendants' products and Crocs' registered design and trade dress was deemed fraudulent imitation, leading to dilution of Crocs’ distinctiveness.</p>\n\n<p>Based on these findings, the Delhi High Court concluded that Crocs Inc. had established a prima facie case for interim relief, with the balance of convenience lying in its favor and a risk of irreparable harm if an injunction was not granted. Consequently, the Court restrained the defendants from using the infringing marks, manufacturing or selling products embodying Crocs' patented system, imitating its registered design, or copying the distinctive trade dress of Crocs’ geometric clogs. The matter is scheduled for further hearing on February 16, 2026.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-protects-crocs-ip-rights-against-questsole.jpg"
  },
  {
    "title": "Concealment of Free Seats Amounts to Unfair Trade Practice: Maharashtra Commission Finds Emirates Airlines Deficient in Service",
    "description": "<p>The Maharashtra State Consumer Disputes Redressal Commission, Mumbai, has ruled that Emirates Airlines engaged in deficiency of service and unfair trade practice by misleading passengers into paying for seat selection when free adjacent seats were available. This significant decision, stemming from the case of Emirates Airlines v. Dr. Keshab Nandy & Anr., upheld a District Forum's order compelling the airline to refund ₹7,200 with interest and provide compensation for mental agony and litigation costs. Notably, the ruling is one of the first judicial recognitions in India of \"dark patterns\"—deceptive online design practices that manipulate consumer choice—within consumer jurisprudence, highlighting a growing emphasis on transparency in digital consumer interactions.</p>\n\n<p>The case involved Dr. Keshab Nandy, a diabetic and hypertension patient, and his wife, Mrs. Meenu Pandey, who pre-booked adjacent seats online for ₹7,200 for a Mumbai-New York flight in 2017 to ensure Dr. Nandy received assistance. Upon arrival at the airport, they discovered numerous free adjacent seats that other passengers had availed without charge. This led them to allege that Emirates had falsely led them to believe paid pre-booking was the only option for guaranteed adjacent seating, constituting a deficiency in service and unfair trade practice under the Consumer Protection Act, 1986.</p>\n\n<p>Emirates Airlines contended that seat selection was an optional, voluntary, and non-refundable service, and that free selection was available 48 hours before departure. However, the Commission rejected this argument, finding that Emirates failed to disclose crucial information regarding the availability of free adjacent seats. It emphasized that the airline's online interface created a false impression of scarcity and compelled passengers like the complainants to make unnecessary payments, thereby violating the principles of transparency and informed consent.</p>\n\n<p>Ultimately, the State Commission dismissed Emirates' appeal, affirming the District Forum's directive for a refund of ₹7,200 with 9% interest from the complaint date, ₹10,000 for mental agony, and ₹10,000 for litigation costs. This ruling is a progressive affirmation of consumer rights in the digital age, expanding the scope of unfair trade practices to encompass manipulative online design and the omission of key information. It sends a clear message to airlines and digital service providers about the importance of transparency and fairness in all consumer interactions, both online and offline, to prevent consumer exploitation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/emirates-penalized-for-hiding-free-seats-dark-pattern-case.jpg"
  },
  {
    "title": "Security Cheques vs. Enforceable Debt: Delhi High Court Reiterates Limits of Section 138 NI Act",
    "description": "<p>The Delhi High Court, in the case of Sri Sai Sapthagiri Sponge Pvt. Ltd. v. State (GNCT of Delhi) & Anr., has delivered a significant judgment clarifying the boundaries of Section 138 of the Negotiable Instruments Act, 1881. The Court quashed multiple complaints, reiterating that cheques issued merely as security or for audit purposes do not constitute instruments issued in discharge of a legally enforceable debt, and thus do not attract criminal liability under the Act. The ruling also addressed critical jurisdictional and procedural flaws in the handling of cheque dishonour cases.</p>\n\n<p>A central point of the judgment was the distinction between security cheques and those issued for existing debt. The Court found that the Memorandum of Understanding (MoU) explicitly stated the cheques were issued \"for security purpose only\" and \"not for depositing into bank.\" This contractual clarity was pivotal, leading the Court to conclude that such cheques could not be treated as having been issued in satisfaction of a legally recoverable debt or liability, which is a prerequisite for invoking Section 138 NI Act.</p>\n\n<p>Furthermore, the High Court highlighted a significant jurisdictional error. The original complaints were filed in Bellary but later returned due to a lack of territorial jurisdiction, aligning with the Supreme Court's ruling in Dashrath Rupsingh Rathod. Subsequently, when the complaints were refiled in New Delhi, the Metropolitan Magistrate adopted the summoning orders previously issued by the Bellary court, instead of issuing fresh summons after due application of mind. The Court held that any proceedings, including summoning orders, conducted by a court lacking jurisdiction are \"non-est in law,\" rendering the adopted orders and all subsequent proceedings null and void.</p>\n\n<p>This decision from the Delhi High Court reinforces two critical legal principles: it safeguards businesses by clarifying that security cheques, when demonstrably not for a present debt, cannot lead to criminal liability under Section 138 NI Act; and it stresses the fundamental importance of procedural propriety and strict adherence to territorial jurisdiction in judicial proceedings. The judgment thereby strengthens the balance between commercial accountability and procedural fairness, preventing the criminalization of civil disputes in cheque transactions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-security-cheques-not-enforceable-under-ni-act.jpg"
  },
  {
    "title": "Supreme Court Clarifies Singur Land Return: Industrial Units Cannot Claim Relief Reserved for Displaced Farmers",
    "description": "<p>The Supreme Court of India overturned a Calcutta High Court order, clarifying that industrial and commercial entities cannot seek restoration of acquired land under judicial directions intended for dispossessed farmers. The ruling emphasizes that the relief granted in Kedar Nath Yadav v. State of West Bengal, which restored land to cultivators, was a socially remedial measure to protect vulnerable agricultural communities displaced by state acquisition, and should not be extended to industrial undertakings.</p>\n\n<p>The case originated from the Singur Project, where the West Bengal government acquired land for Tata Motors' Nano plant, including land owned by M/s Santi Ceramics Pvt. Ltd. Santi Ceramics accepted compensation for its land but later sought restoration based on the Kedar Nath Yadav ruling, which quashed the acquisition. While the High Court allowed the petition, the Supreme Court reversed this decision, stating that the remedy in Kedar Nath Yadav was specifically for disadvantaged farmers and not for commercial entities.</p>\n\n<p>The Supreme Court dismissed the writ petition filed by Santi Ceramics but granted limited relief regarding its factory structures and machinery. This judgment reinforces that judicial directions aimed at protecting vulnerable sections cannot be expanded to include commercial entities that benefited from the acquisition process. It underscores the distinction between public welfare remedies and private commercial claims, while upholding principles of waiver, estoppel, and finality in acquisition proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-limits-singur-land-return-to-farmers.jpg"
  },
  {
    "title": "Amazon Faces Consumer Commission Ruling Over Incorrect Laptop Delivery",
    "description": "<p>The District Consumer Disputes Redressal Commission (East Delhi) has ruled in favor of a consumer, directing Amazon Retail India Pvt. Ltd. and Appario Retail Pvt. Ltd. to issue a refund for delivering an incorrect and obsolete laptop model. This decision underscores the accountability of e-commerce platforms in ensuring accurate product delivery and transparent refund processes, emphasizing that internal \"Use Policy\" disclaimers cannot supersede consumer protections under the Consumer Protection Act, 2019.</p>\n\n<p>The case originated when Mr. Harjas Singh Sodhi ordered an HP Pavilion laptop from Amazon (sold by Appario Retail) but received an old IBM ThinkPad instead. Despite promptly reporting the issue, initiating a return, and complying with Amazon's procedures, his refund request was rejected under the claim that the returned item was \"lost in transit\" and that his account had exceeded refund limits per Amazon's internal policy.</p>\n\n<p>The Commission found Amazon Retail India Pvt. Ltd. and Appario Retail Pvt. Ltd. jointly and severally liable for deficiency in service. It directed them to refund ₹61,990 for the laptop, pay ₹10,000 in compensation for mental distress and inconvenience, and reimburse ₹5,000 for litigation costs, with an 11% annual interest on the total amount if compliance isn't met within 30 days. This ruling reinforces the responsibility of e-commerce platforms in managing logistics and refund processes and calls for transparent and verifiable systems to uphold consumer trust.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-consumer-court-orders-amazon-refund-for-wrong-laptop.jpg"
  },
  {
    "title": "Understanding the Greenhouse Gases Emission Intensity Target Rules, 2025: A Comprehensive Overview",
    "description": "<p>The Greenhouse Gases Emission Intensity Target Rules, 2025, introduced by the Indian government, aim to curb greenhouse gas emissions across key industrial sectors. Aligned with frameworks like the Carbon Credit Trading Scheme, these rules enforce emission reduction targets by focusing on emission intensity, promoting efficiency improvements without hindering economic growth. The rules provide comprehensive definitions, including terms like \"banked\" carbon credits, \"compliance year,\" and specific measurements for \"greenhouse gases emission intensity targets.\" Definitions also reference related legislation like the Environment Protection Act, 1986 and the Carbon Credit Trading Scheme, 2023, ensuring consistency across environmental policies.</p>\n\n<p>The rules establish specific emission intensity targets for sectors like Aluminium, Cement, Chlor-Alkali, and Pulp and Paper. These targets, outlined in the Schedule, provide a trajectory for emission intensity reductions. For instance, entities in the Aluminium sector face baseline GHG emission intensities with specific reduction targets for subsequent years. This structured approach fosters accountability and progress tracking.</p>\n\n<p>Obligated entities must achieve the emission intensity targets specified in the Schedule. Shortfalls require entities to surrender banked carbon credit certificates or purchase new ones. Registration on the designated portal under the Indian Carbon Market Framework and submission of required documentation are also mandatory. The Bureau of Energy Efficiency manages the issuance of carbon credit certificates, providing an incentive for emission reductions. The number of certificates issued is based on the difference between achieved and target emission intensities, multiplied by production units. Entities can bank these certificates for future use.</p>\n\n<p>Environmental compensation is imposed on obligated entities failing to meet the requirements. The Central Pollution Control Board sets the compensation at twice the average price of carbon credit certificates traded during the relevant compliance year's trading cycle. Payment must be made within 90 days, with additional penalties under the Environment Protection Act, 1986 for non-compliance. Collected funds are used for initiatives aligned with the Carbon Credit Trading Scheme, 2023.</p>\n\n<p>In conclusion, the Greenhouse Gases Emission Intensity Target Rules, 2025, offer a framework for reducing emissions in India, balancing regulatory stringency with practical implementation. Effective enforcement and stakeholder collaboration are critical to achieving national and international environmental goals.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/greenhouse-gases-emission-intensity-target-rules-2025.jpg"
  },
  {
    "title": "No Shortcut on Stamp Duty – Supreme Court Says Security Bonds by Debtors Are Mortgage Deeds",
    "description": "<p>The Supreme Court of India, in M/s Godwin Construction Pvt. Ltd. v. Commissioner, Meerut Division & Anr., clarified the classification of instruments for stamp duty under the Indian Stamp Act, 1899. The Court ruled that when a party executes a deed to secure its own obligations, it is classified as a mortgage deed under Article 40, regardless of being titled a \"Security Bond cum Mortgage Deed.\" This is based on the principle that the substance of the transaction prevails over its form.</p>\n\n<p>The case originated from a dispute where M/s Godwin Construction Pvt. Ltd. executed a \"Security Bond cum Mortgage Deed\" to the Meerut Development Authority (MDA) to secure development obligations, paying stamp duty under the \"Security Bond\" category. Authorities later deemed it a mortgage deed, demanding additional stamp duty. The Supreme Court, upholding lower court decisions, emphasized that Article 57 (Security Bond) applies only when a third-party surety guarantees another's obligations, as per Section 126 of the Indian Contract Act, 1872. Because the developer mortgaged its own property and no surety was involved, Article 40 (Mortgage Deed) was deemed applicable.</p>\n\n<p>The judgment reinforces that the true legal character of a document is determined by its operative terms and recitals, not merely its title. Where a party mortgages their own property to secure obligations, it constitutes a mortgage deed. This ruling offers clarity for developers, lenders, and authorities, minimizing ambiguity and ensuring consistent stamp duty assessment in real estate and financing transactions. It also underscores the importance of precise legal language in security documents to avoid future disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-security-bonds-by-debtors-are-mortgages.jpg"
  },
  {
    "title": "Statutory Stop-Watch Re-Set: Section 17(5) SARFAESI Act Comes Alive",
    "description": "<p>The Supreme Court, in the case of Indian Overseas Bank v. M/s Radhey Infra Solutions (Pvt.) Ltd., addressed the issue of delays in debt recovery proceedings under the SARFAESI Act. The court emphasized that the statutory timelines mandated by Section 17(5) of the Act must be strictly adhered to by Debt Recovery Tribunals (DRTs).</p>\n\n<p>The case arose from a borrower's application under Section 17(1) of the SARFAESI Act, which remained pending before the DRT, Dehradun, for an extended period without any extension orders or recorded reasons. The Supreme Court underscored that Section 17(5) requires DRTs to dispose of such applications within 60 days, extendable by a maximum of four months with written justification for each extension. The Court criticized the High Court's previous order for not enforcing the timeline.</p>\n\n<p>The Supreme Court directed the DRT, Dehradun, to immediately comply with Section 17(5) of the SARFAESI Act and dispose of the pending application expeditiously. This ruling serves as a reminder to all DRTs that the statutory timelines are not merely suggestive but are crucial for ensuring timely debt recovery and adjudication of borrower grievances, thereby reinforcing the importance of time in commercial matters.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-revives-section-175-sarfaesi-timeline.jpg"
  },
  {
    "title": "Rajasthan High Court Orders FSSAI to Frame Regulations on Genetically Modified Foods, Citing Right to Safe Food under Article 21",
    "description": "<p>The Rajasthan High Court, in the case of Kritesh Oswal & Ors. v. Union of India & Ors., has issued a significant directive compelling the Central Government and the Food Safety and Standards Authority of India (FSSAI) to promptly frame and notify regulations for genetically modified (GM) foods under Section 22 of the Food Safety and Standards Act, 2006. The Court emphasized that the current absence of such regulations constitutes a regulatory vacuum, posing substantial risks to public health and infringing upon the fundamental right to life and health guaranteed by Article 21 of the Constitution.</p>\n\n<p>This ruling emerged from a Public Interest Litigation highlighting the unregulated sale, import, and distribution of GM food products in India, particularly edible oils like soybean and canola, without requisite scientific evaluation of their health impacts. Petitioners argued that despite the FSS Act mandating a framework, FSSAI had failed to establish regulations, allowing GM ingredients into the market without proper oversight or safety standards. The petition also challenged the legality of merely labelling GM products under existing rules without a fundamental regulatory approval process.</p>\n\n<p>The Court underscored the State's affirmative duty under Article 47 to ensure safe nutrition, asserting that food security cannot undermine food safety. It invoked the precautionary principle, stressing that potential harm from unregulated GM foods necessitates robust oversight. Key findings included that the absence of regulations directly violates Article 21, that FSSAI is the sole competent authority for GM food regulation, and that consumers possess a fundamental right to know about GM ingredients in their food. The Court also deemed any prior approvals by the Genetic Engineering Appraisal Committee (GEAC) for GM foods as illegal and non-binding.</p>\n\n<p>Consequently, the Rajasthan High Court directed FSSAI to finalize and notify the GM food regulations within three months. Furthermore, it mandated that no GM food product, whether raw, processed, or as an ingredient, should be imported, manufactured, or sold in India without FSSAI approval and compliance with the new regulations, including specific labelling requirements. The judgment reinforces that food safety is a constitutional imperative deeply connected to human dignity, urging proactive governance to align scientific advancement with public welfare and constitutional values.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-orders-fssai-to-regulate-gm-foods-under-art-21.jpg"
  },
  {
    "title": "Housewife-Landlady’s Right to Seek Eviction for Husband’s Welfare: Delhi High Court Upholds Bona-Fide Requirement under Section 14(1)(e) of the Delhi Rent Control Act",
    "description": "<p>The Delhi High Court, in the case of Naveen Kumar v. Babita Jain, has issued a significant ruling affirming that a housewife who owns a tenanted property can legitimately seek eviction of a tenant if the premises are required for her husband's welfare or to enable him to start a business. This decision clarifies that familial obligations and spousal dependence fall within the ambit of \"for his own use\" as defined under Section 14(1)(e) of the Delhi Rent Control Act, 1958, emphasizing the gender-neutral application of rent control laws.</p>\n\n<p>The dispute arose when Mrs. Babita Jain, the landlady and a housewife, filed an eviction petition seeking possession of a tenanted shop for her husband to commence a dry-fruits business. The Additional Rent Controller granted the eviction, prompting the tenant to appeal to the Delhi High Court. The tenant argued that the landlady, as a housewife without an independent income, could not claim eviction for her husband's benefit and that the asserted need was fabricated.</p>\n\n<p>The High Court rejected the tenant's contentions, affirming that gender or occupation is immaterial in determining a bona-fide need. Citing the Supreme Court's judgment in Joginder Pal v. Naval Kishore Behal, the Court reiterated that \"for his own use\" must be interpreted liberally to include dependent family members. It held that a housewife possesses equal rights to seek eviction for the welfare or livelihood of her dependents, and to interpret the statute otherwise would amount to discrimination, violating Articles 14 and 15 of the Constitution. The Court found the landlady's claim genuine, noting the tenant's failure to provide evidence disproving the need or showing the husband's alternative employment.</p>\n\n<p>Ultimately, the Court upheld the Additional Rent Controller's finding that the landlady's need for the premises for her husband's business was genuine and bona fide. It dismissed the tenant's revision petition and recorded the tenant's undertaking to vacate the premises by May 30, 2026. This judgment underscores that familial welfare and economic dignity are central to the concept of bona-fide requirement, harmonizing the Delhi Rent Control Act with constitutional principles of gender neutrality and reinforcing that ownership rights and legal entitlements are independent of economic participation or employment status.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-housewife-can-seek-eviction-for-husbands-welfare.jpg"
  },
  {
    "title": "Bombay High Court Reiterates: Borrowers Cannot Demand One-Time Settlement as a Matter of Right",
    "description": "<p>In a significant ruling, the Bombay High Court (Nagpur Bench) in Ms. Archana Wani v. Indian Bank & Ors. affirmed that borrowers or guarantors do not possess a right to demand a One-Time Settlement (OTS), nor can courts compel banks to disclose internal settlement benchmarks or accept settlement proposals. The Court emphasized that loan recovery and settlement decisions fall squarely within the commercial wisdom of banks, which manage public funds and are bound by financial discipline. Judicial intervention under Article 226 of the Constitution is unwarranted, particularly when statutory remedies under the SARFAESI Act, 2002, and the Insolvency and Bankruptcy Code, 2016 (IBC), are available.</p>\n\n<p>The case involved Ms. Archana Wani, a guarantor for a defaulted loan of ₹62 crore, whose account was declared a Non-Performing Asset (NPA). After the bank initiated recovery proceedings under SARFAESI and IBC, Ms. Wani submitted multiple OTS proposals. These were rejected by the bank for not meeting its \"benchmark criteria,\" which the petitioner argued were arbitrarily withheld. She sought judicial intervention to compel the bank to disclose its standards and accept her proposal.</p>\n\n<p>The High Court meticulously reviewed the contractual obligations and statutory frameworks, concluding that a bank's decision on an OTS proposal is a purely commercial one based on internal policies and risk assessment. The Court reiterated that an OTS proposal does not confer any enforceable right upon the borrower, and banks are not statutorily obligated to disclose their internal benchmark parameters. Relying on established Supreme Court precedents, the Bench highlighted that compelling banks to settle on terms dictated by borrowers would undermine financial prudence and public interest. Consequently, the High Court dismissed the petition, reiterating that OTS schemes are discretionary concessions, not enforceable rights, and that negotiation, not entitlement, is the pathway to settlement. The interim stay on recovery was, however, continued for six weeks to allow the petitioner to explore alternate remedies.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-no-right-to-one-time-settlement-for-borrowers.jpg"
  },
  {
    "title": "Delhi High Court on Mental Cruelty: False Allegations, Vexatious Litigation and the Boundaries of Matrimonial Conduct",
    "description": "<p>The Delhi High Court in X v. Y upheld a divorce decree based on mental cruelty, reaffirming the definition of cruelty under Section 13(1)(ia) of the Hindu Marriage Act, 1955. The court dismissed the wife's appeal, emphasizing that a consistent pattern of false allegations, unsubstantiated criminal complaints, and vindictive litigation constitutes sufficient grounds for divorce due to the mental anguish inflicted on the other spouse.</p>\n\n<p>The case involved a marriage marred by extensive litigation, with the wife initiating numerous complaints, including those under Section 498A of the IPC and the Domestic Violence Act, most of which were later found to be baseless. The Family Court initially granted the divorce, citing the severe mental agony and social humiliation suffered by the husband due to the wife's actions.</p>\n\n<p>The High Court's decision highlighted that mental cruelty encompasses not only physical harm but also emotional distress caused by repeated baseless accusations, character assassination, and the misuse of legal provisions. While \"irretrievable breakdown of marriage\" is not a statutory ground for divorce, the court acknowledged that prolonged separation and loss of trust, in conjunction with demonstrated cruelty, support the dissolution of marriage. The judgment serves as a significant precedent, urging courts to recognize the psychological impact of relentless litigation and ensuring that legal remedies are not weaponized for personal vendettas within matrimonial disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-defines-mental-cruelty-in-matrimonial-disputes.jpg"
  },
  {
    "title": "DoT Tightens Noose on Unused Transmitters, Issues Post Licence Disposal Playbook",
    "description": "<p>India's Department of Telecommunications (DoT) has issued a comprehensive guideline to resolve the ambiguity surrounding the disposal of wireless transmitting and receiving equipment upon the expiry of a Wireless Operating Licence (WOL). Effective immediately and applicable to all entities—private and public—possessing radiating hardware under WPC licenses, these stern guidelines establish clear accountability and strict timelines for equipment disposal, backed by the threat of prosecution under the Indian Telegraphy Act.</p>\n\n<p>The guidelines prescribe varying disposal periods depending on the manner of licence expiry. For licensee-initiated cancellations, a 90-day window is provided to scrap, return, transfer the apparatus, or secure a Non-Destructive Possession Licence (NDPL), with a \"deemed NDPL\" cover during this period. In cases of simple non-renewal, a 30-day period is allotted for disposal, requiring a disposal certificate upload within seven days of completion, also with a deemed NDPL. The most abrupt scenario, government-induced termination due to breach of conditions, allows only 15 days for hardware removal and surrender, reflecting a heightened focus on spectrum security. Retaining equipment for future experiments necessitates obtaining a regular NDPL before the existing licence lapses, as no deemed grace period is extended for long-term storage.</p>\n\n<p>Proof of disposal can be established by returning equipment to the original vendor or an authorised dealer, transferring it to another licensed entity with identical frequency clearance, or physically destroying it in the presence of a Wireless Monitoring Organisation (WMO) inspector or licensed dealer. Government laboratories may self-certify demolition but must inform WPC. Crucially, all disposed equipment, including circuit boards, batteries, and metal carcasses, must comply with the Environment Ministry's 2022 rules for telecom-specific e-waste, ensuring they reach only authorised recyclers.</p>\n\n<p>Non-compliance with these new directives will be treated as a wilful violation, leading to \"appropriate action\" by the DoT, which could include fines, black-listing, and criminal prosecution under wireless statutes. The new playbook definitively shifts the full lifecycle liability for every radio chip onto the licence-holder, emphasizing that experimental frequencies are temporary leases on public property, and equipment must be promptly removed once the licence tenure concludes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/dot-issues-strict-rules-for-disposing-wireless-equipment.jpg"
  },
  {
    "title": "Supreme Court Addresses Conflict Between Forest Rights Act and Forest Conservation Act on Tribal Housing",
    "description": "<p>In Sugra Adiwasi & Ors. v. Pathranand & Ors., the Supreme Court of India examined the intersection of the Forest Rights Act (FRA) and the Forest Conservation Act (FCA) concerning the construction of permanent housing for forest dwellers. The court acknowledged the conflict between recognizing the rights of tribal communities to adequate housing and the need to preserve forest ecology.</p>\n\n<p>The case arose from a dispute over whether forest dwellers could construct permanent homes on forest land without violating the FCA. Petitioners argued the FRA grants habitation rights, including durable housing, while the Union of India emphasized the FCA's role in forest preservation. The core legal issue was whether FRA-recognized construction could proceed despite FCA regulations.</p>\n\n<p>The Court analyzed both Acts, noting the FRA's limited \"notwithstanding\" clause doesn't explicitly authorize housing construction without FCA oversight. It reaffirmed that the FCA regulates, rather than prohibits, non-forest activities, emphasizing forest protection as a constitutional obligation. The court stressed the need for a \"convergent interpretation\" where both statutes coexist, protecting human and environmental interests.</p>\n\n<p>Acknowledging the State's duty to ensure minimum living conditions, the Supreme Court directed the Ministry of Environment, Forest and Climate Change and the Ministry of Tribal Affairs to formulate a regulatory mechanism enabling dwelling construction for forest dwellers, ensuring FCA compliance. This directive emphasizes inter-departmental coordination and a balanced approach, reflecting a commitment to both social justice and environmental stewardship.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-balances-forest-rights-and-conservation.jpg"
  },
  {
    "title": "A Breach Too Far: Court Exonerates Insurer After Agricultural Tractor Used for Wedding Procession",
    "description": "<p>A protracted legal battle spanning over two decades, stemming from a 2004 tractor accident, recently concluded with a significant judgment by the Madhya Pradesh High Court. The case centered on the New India Insurance Company's liability when an agricultural tractor, insured solely for farming purposes, was involved in an accident while transporting wedding guests (Baratis), resulting in injuries to two pedestrians.</p>\n\n<p>The incident occurred on May 29, 2004, when a speeding tractor collided with Shivram Chaudhary and Sukhlal Chaudhary, causing various injuries. The 3rd Additional Motor Accidents Claims Tribunal initially awarded compensation of ₹30,000 to Shivram and ₹10,000 to Sukhlal, directing the insurer to pay with the liberty to recover the amount from the vehicle's owner and driver (a \"pay and recover\" order).</p>\n\n<p>Aggrieved by the tribunal's decision, three appeals were filed: Shivram Chaudhary sought enhanced compensation, while the insurance company challenged its liability entirely. The insurer argued a fundamental breach of policy terms, citing that the tractor, insured for agricultural use, was illegally transporting passengers. Furthermore, the driver allegedly lacked a valid license. The claimants contended the awarded compensation was insufficient given their sustained injuries and economic losses.</p>\n\n<p>The High Court, after meticulous examination, sided with the insurance company. It emphasized that the tractor's use for carrying wedding guests constituted a clear and fundamental deviation from its insured purpose, altering the risk profile significantly. Citing Supreme Court precedents, the court affirmed that insurers are not liable when vehicles are used in direct violation of core policy conditions, particularly when carrying unauthorized passengers. Consequently, the \"pay and recover\" doctrine was deemed inapplicable in this instance due to the deliberate and fundamental nature of the policy breach.</p>\n\n<p>While exonerating the insurance company, the High Court acknowledged the inadequacy of Shivram Chaudhary's original compensation. It enhanced his award to ₹50,000, factoring in his physical pain, medical expenses, and long-term impact on his livelihood. The final judgment directed the owner and driver of the tractor to jointly and severally deposit the full compensation amount, including the enhanced sum and interest, within 30 days. The insurance company was relieved of all liability, with provisions for refunding any amounts already deposited and recovering any sums paid to the claimant from the owner and driver.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/tractor-misuse-nullifies-insurance-mphcs-key-ruling.jpg"
  },
  {
    "title": "Family Members Have First Right to Buy Ancestral Property, Says Bombay High Court",
    "description": "<p>The Bombay High Court has affirmed the preferential right of family members to purchase ancestral property, particularly when it remains undivided, even if the selling co-parcener transfers their share to an outsider. This significant ruling arose from a dispute involving ancestral agricultural lands in Beed district, Maharashtra, where certain members of a joint Hindu family (Rathod family) sold portions of undivided property to external purchasers without offering it to the other co-parceners (Selukar family). The plaintiffs, the Selukar family, invoked Section 22 of the Hindu Succession Act, 1956, to assert their right of pre-emption, a claim previously upheld by the Trial Court.</p>\n\n<p>Justice Shailesh P. Brahme's analysis established that the properties were indeed undivided joint family holdings, confirming the plaintiffs and the original sellers as co-parceners. The Court clarified that while Section 22 specifically references Class I heirs, in the context of undivided joint family property, the right of pre-emption extends to all co-parceners sharing a common ancestral interest. A pivotal aspect of the judgment was the ruling that a separate declaration to set aside the sale deeds was not required; title automatically vests in the plaintiffs upon their deposit of the purchase consideration, as per Order XX Rule 14 of the Code of Civil Procedure. The High Court also upheld the lower court's decision to extend the payment timeline, recognizing that appellate proceedings had effectively stayed the original decree. Furthermore, the Court rejected the purchasers' reliance on Section 44 of the Transfer of Property Act, as they had not sought partition.</p>\n\n<p>Ultimately, the High Court dismissed both appeals, thereby confirming the concurrent findings of the Trial Court and the First Appellate Court. The plaintiffs were directed to deposit the purchase price, along with 6% simple interest, within ninety days. This decision is crucial as it reinforces the pre-emptive rights of co-parceners in undivided ancestral property, streamlining the process by removing the necessity of first canceling sale deeds and providing clarity on the application of Section 22 in such scenarios. It also highlights the judiciary's discretion to adjust timelines for decree execution when appeals delay proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-family-has-first-right-to-buy-ancestral-property.jpg"
  },
  {
    "title": "Supreme Court: Non-Resident Companies Liable to Tax in India Even Without Permanent Office",
    "description": "<p>The Supreme Court of India recently delivered a significant judgment in the case of Pride Foramer S.A. v. Commissioner of Income Tax, clarifying that non-resident companies can be deemed to be carrying on business in India even during periods of operational inactivity, thus remaining eligible for tax deductions and liable for tax on income accruing in India.</p>\n\n<p>The case involved Pride Foramer S.A., a French offshore oil drilling company, which experienced a lull in active contracts between 1993 and 1999. During this interim, despite operating from foreign offices and having no active projects, the company engaged in business correspondence, submitted bids, incurred various business-related expenses, and claimed deductions for these along with unabsorbed depreciation. The Income Tax Department, however, disallowed these claims, asserting that the company had ceased business operations during this inactive period.</p>\n\n<p>Reversing the High Court's decision, the Supreme Court affirmed the Income Tax Appellate Tribunal's view, distinguishing a \"lull\" from a \"cessation\" of business. The Court emphasized that a company's continuous intent and efforts to secure future contracts, such as submitting bids and maintaining business correspondence, demonstrate ongoing operations, irrespective of immediate contract acquisition. Crucially, the Court clarified that the absence of a permanent establishment or conducting business solely through foreign offices does not absolve a non-resident company from tax liability in India if income accrues or arises within the country. Consequently, the Court allowed the deduction of business expenses under Section 37 and permitted the carry-forward of unabsorbed depreciation under Section 32(2) of the Income Tax Act.</p>\n\n<p>This landmark judgment adopts a pragmatic and modern approach to assessing non-resident companies, reinforcing the principle of \"substance over form.\" It establishes that business continuity and entitlement to tax benefits are determined by a company's overarching conduct and intent, rather than merely by active contract periods or physical presence within India, thereby aligning with globalized trade dynamics.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-non-resident-companies-taxable-in-india-without-office.jpg"
  },
  {
    "title": "Section 17 or Article 226? Kerala High Court Slams the Door on Writ Route in SARFAESI",
    "description": "<p>The Kerala High Court, through a Division Bench, has unequivocally restated that borrowers cannot bypass the specialized statutory remedy under Section 17 of the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002 (SARFAESI Act) by directly filing a writ petition under Article 226 of the Constitution. This ruling emerged from a case involving a ₹16 lakh business loan from Kerala State Cooperative Bank, where a borrower sought the return of physically possessed mortgaged property on mere part-payment.</p>\n\n<p>The dispute arose after Jishith Kumar defaulted on a loan, leading the bank to classify his account as an NPA and subsequently take physical possession of the mortgaged property under Sections 13 and 14 of the SARFAESI Act. Despite having previously failed to honor a One Time Settlement (OTS) scheme facilitated by an earlier writ petition, the borrower filed a fresh writ, seeking restructuring and immediate release of the asset. A Single Judge initially directed the bank to return possession upon a payment of ₹4 lakh and an instalment plan, which the bank contested as exceeding judicial authority.</p>\n\n<p>The Division Bench, hearing the bank's appeal, meticulously examined the SARFAESI framework and numerous Supreme Court precedents. It concluded that the Single Judge's order effectively rewrote the contract and statute, and that the High Court, exercising writ jurisdiction, could not sit in appeal over a meticulously followed statutory process. The bench emphasized that the proper and sole avenue for the borrower to challenge the bank's actions after possession was taken was under Section 17 before the Debts Recovery Tribunal (DRT). It dismissed the argument that a bank's informal concession could override substantive statutory rights, affirming that equity follows the law.</p>\n\n<p>Consequently, the Division Bench set aside the Single Judge's judgment in its entirety and dismissed the writ petition as not maintainable. While reaffirming the judiciary's role in policing its own boundaries and prioritizing statutory discipline over judicial equity, the court clarified that its order does not prevent the borrower from approaching the DRT under Section 17 of the SARFAESI Act. This decision serves as a critical reminder for borrowers that the High Court is not the first forum for challenging SARFAESI proceedings, reinforcing the legislative intent of swift, non-interventionist recovery mechanisms for financial institutions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-no-writ-when-section-17-sarfaesi-remedy-exists.jpg"
  },
  {
    "title": "Dependents Beyond Legal Heirs Entitled to Compensation: MP High Court",
    "description": "<p>The Madhya Pradesh High Court, in a landmark decision in Smt. Saroj & Others v. Rajendra Prasad Patel & Others, significantly broadened the interpretation of \"legal representative\" under the Motor Vehicles Act, 1988. The case addressed whether individuals not strictly legal heirs, but demonstrably financially and emotionally dependent on the deceased, are entitled to compensation for a motor accident death. The High Court adopted a liberal and humanitarian approach, emphasizing that the Act is beneficial legislation designed to provide relief to victims and their dependents, transcending the technicalities of personal law.</p>\n\n<p>The case originated from a motor accident where Ramakant Patel died. His brother's widow, Smt. Saroj, and her daughter filed a claim, asserting that Ramakant had supported them financially and emotionally after her husband's demise. The Motor Accident Claims Tribunal rejected their claim, holding that as they were not legally wedded wife or biological child, they could not be legal heirs. However, the High Court overturned this, referencing the Supreme Court's ruling in N. Jayasree v. Cholamandalam MS General Insurance Co. Ltd., which states that \"legal representative\" is not confined to legal heirs but includes anyone demonstrating financial dependency, even without a formal marital relationship.</p>\n\n<p>The High Court affirmed that evidence clearly showed the deceased supported Smt. Saroj and her daughter, thus qualifying them as dependents and \"legal representatives\" under Section 166 of the Act. This judgment marks a progressive development in accident compensation jurisprudence, acknowledging the evolving social realities where dependency and familial bonds may extend beyond conventional definitions of marriage or heirship. It underscores that substantive justice should prioritize proven dependency and loss over rigid adherence to formal relationships, ensuring the compassionate intent of the Motor Vehicles Act is upheld.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/mp-hc-expands-legal-representative-in-accident-claims.jpg"
  },
  {
    "title": "Arms Act, 1959: Renewal is the Norm, Refusal the Exception, Rules Madras High Court",
    "description": "<p>The Madras High Court, in a significant ruling by its Madurai Bench, has clarified that while possessing a firearm is a regulated privilege under the Arms Act, 1959, the renewal of an existing licence, especially after peaceful use, should be considered the norm. Refusal of renewal, the Court asserted, must be based on explicit, rational, and case-specific findings, shifting the burden from the applicant to the licensing authority to provide compelling reasons.</p>\n\n<p>This judgment arose from a petition filed by Magudapathi, an ordinary citizen who held a smooth bore gun licence since 2021 for crop protection and sport, which had been routinely renewed once. His application for a second renewal in 2024 was denied by the District Magistrate cum District Collector, Dindigul, solely on the grounds that Magudapathi was facing prosecution under Section 304A of the Indian Penal Code for a fatal motor vehicle accident. The Collector deemed this a threat to \"public safety,\" prompting Magudapathi to challenge the decision in the High Court.</p>\n\n<p>Justice G.R. Swaminathan, examining Sections 13, 14, and 15 of the Arms Act, 1959, highlighted Section 15(3), which mandates that a licence \"shall, unless the licensing authority for reasons to be recorded in writing otherwise decides, be renewable.\" The Court emphasized that this provision converts the initial privilege into an expectancy of renewal, which can only be defeated by reasons that meet the standards of Section 14, pertaining to refusal. The High Court found the Collector's justification \"woefully insufficient,\" stating that a prosecution for negligent driving (Section 304A IPC) is distinct from firearm-related misconduct, nor does it indicate an individual is of unsound mind or unfit as per Section 14. Furthermore, the Court reiterated that while alternative remedies exist, it can intervene via writ jurisdiction when an impugned order is patently illegal.</p>\n\n<p>Consequently, the High Court quashed the Collector's order and directed the renewal of Magudapathi’s gun licence for five years, subject to standard conditions. This ruling serves as a crucial reminder that administrative discretion in weapon licensing tightens once a citizen has demonstrated trustworthy conduct, safeguarding individual expectation and ensuring a principled application of the Arms Act against arbitrary denials based on unrelated criminal proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-renewal-the-rule-refusal-the-exception-arms-act-1959.jpg"
  },
  {
    "title": "Rajasthan HC: Assignment under section 5 SARFAESI survives even if NPA tag quashed, guarantors can’t reopen decade-old ARC deal.",
    "description": "<p>The Rajasthan High Court, Jodhpur Bench, recently delivered a significant ruling affirming that a debt assignment under Section 5 of the SARFAESI Act, 2002, maintains its validity even if the Non-Performing Asset (NPA) classification, which triggered subsequent enforcement actions, is later quashed. In Harendra Singh Rathore & Ors. v. State Bank of India & Ors., Justice Rekha Borana refused to undo a 2014 debt assignment by SBI to Alchemist Assets Reconstruction Co., emphasizing that invalidating the NPA tag affects only Section 13 enforcement actions, not the independent prior sale of the loan under Section 5.</p>\n\n<p>This decade-long legal battle originated from a ₹24 crore debt incurred by Hotel Gaudavan Pvt. Ltd. in 2008, guaranteed by its director-shareholders. After the account became an NPA and was put up for sale, SBI assigned the debt to Alchemist ARC in 2014. Despite borrowers' attempts to challenge the proceedings through various forums, including a DRT ruling in 2015 that declared the original NPA classification illegal, the debt's ownership remained with the ARC. The guarantors subsequently sought to declare the 2014 assignment void, arguing that the quashing of the NPA rendered all subsequent actions, including the assignment, invalid.</p>\n\n<p>The High Court dismissed the guarantors' petition, primarily citing the principle of res judicata, as identical pleas had been rejected multiple times by various judicial bodies, up to the Supreme Court. The court reiterated that while Section 13 of the SARFAESI Act requires an NPA declaration for enforcement, Section 5, which deals with the transfer of financial assets, does not. Therefore, the 2015 DRT order invalidating the NPA only impacted possession proceedings, not the earlier, distinct assignment deed. Relying on the Supreme Court's ICICI Bank v. Official Liquidator of APS Star Industries judgment, the court affirmed that a debt is an asset transferable by a bank without borrower consent, irrespective of the NPA tag's correctness. The court also noted the availability of alternative statutory remedies for challenging recovery orders.</p>\n\n<p>This ruling provides crucial clarity and reassurance for lenders and Asset Reconstruction Companies. It firmly establishes that a bank's right to assign its loan under Section 5 of the SARFAESI Act is an independent power, not contingent on the ultimate fate of its internal NPA classification or the successful execution of Section 13 enforcement measures. Once a debt is assigned, courts will generally uphold the finality of that contract, strengthening the framework for managing and resolving bad assets within the financial system.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-upholds-sarfaesi-assignment-despite-npa-quash.jpg"
  },
  {
    "title": "IBC and Homebuyers Protection",
    "description": "<p>The article details the evolving landscape of homebuyers' rights under India's Insolvency and Bankruptcy Code (IBC). A pivotal 2018 amendment recognized real estate allottees as financial creditors, granting them participation and voting rights in the Committee of Creditors (CoC) during Corporate Insolvency Resolution Processes (CIRP). This move followed significant protests by homebuyers, who were initially excluded from meaningful engagement, leading to earlier regulatory adjustments by the Insolvency and Bankruptcy Board of India (IBBI) to facilitate their claims. Courts have consistently held that delays in property handover constitute a default under the IBC, necessitating developers to either deliver or return funds.</p>\n\n<p>Despite this progress, the Supreme Court's validation of the 2018 amendment in Pioneer Urban Land and Infrastructure Ltd. v. Union of India (2019) categorized homebuyers as unsecured creditors. This classification has been criticized for limiting their recovery prospects and decision-making power in comparison to secured financial institutions, which typically dominate the CoC. Practical administration reveals ongoing inequities, including the exclusion of homebuyers who fail to file claims on time and a significant disparity in interest rates, with homebuyers receiving a capped 8% per annum while lenders impose much higher rates. Regulatory measures, such as IBBI's Regulation 4-E, further empower project lenders by requiring substantial CoC approval for possession, potentially exacerbating homebuyer suppression.</p>\n\n<p>The Real Estate (Regulation and Development) Act (RERA), 2016, complements the IBC by mandating transparency, timely project completion, and offering recourse for delays. However, a deeper integration of these frameworks is needed. Legal scholarship and emerging jurisprudence advocate for elevating homebuyers to secured creditor status, citing their proprietary interest in specific flats and the statutory debt arising from non-delivery under RERA. While innovative judicial solutions like 'Reverse CIRP' have emerged to protect possession rights, a definitive consensus on granting homebuyers secured status remains elusive.</p>\n\n<p>Recent trends from 2023-2025 indicate some positive shifts, with the Supreme Court acknowledging verified claims for flat possession and urging the inclusion of unfiled but recorded claims. Nevertheless, systemic challenges persist, fueled by fragmented homebuyer groups, procedural complexities, opaque valuations, and the financial dominance of project lenders. Comprehensive reforms are crucial, including enhancing homebuyers' voting power, legally recognizing their secured status, equalizing interest rates, and empowering regulators to enforce transparency and penalize malfeasance, ultimately ensuring homebuyers' constitutional right to shelter is effectively upheld within the insolvency framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibc-and-homebuyers-evolving-rights-and-legal-protections.jpg"
  },
  {
    "title": "Orissa HC slams Cuttack bank for holding back gratuity over a loan guarantee—reaffirms Section 4(6) is the only key to forfeit gratuity dues.",
    "description": "<p>The Orissa High Court, in a Division Bench ruling on September 20, 2025, emphatically reiterated that gratuity can only be forfeited under the precise conditions stipulated in Section 4(6) of the Payment of Gratuity Act, 1972. The court admonished the Cuttack Central Cooperative Bank Ltd. for unlawfully withholding a retired employee's gratuity over her role as a personal guarantor for a defaulted loan, underscoring that superannuation does not permit such set-offs.</p>\n\n<p>The case originated when a Deputy Manager, who retired in 2010 after superannuation with an unblemished record, was denied her gratuity. The bank justified its action by citing her liability as a guarantor for a loan that later went unpaid. This decision was consistently overturned by the Controlling Authority, the Appellate Authority, and a Single Bench of the Orissa High Court before reaching the Division Bench as a writ appeal.</p>\n\n<p>The High Court dismissed the bank's appeal, emphasizing that Section 4(6) of the Act, which begins with a non-obstante clause, permits forfeiture only to the extent of damage or loss suffered by the employer if the employee was \"terminated\" for a wilful act, omission, or negligence causing such damage. Retirement on superannuation, the court clarified, is the antithesis of termination for misconduct, thus eliminating the statutory trigger for forfeiture. The court further held that introducing a guarantor's civil liability into the Act would constitute an unauthorized judicial expansion of its scope, reinforcing that gratuity is a statutory right earned through service, not a security deposit for credit.</p>\n\n<p>Concluding that three statutory forums had already reached the same conclusion without perversity, irrationality, or exceeding statutory remit, the court found no grounds for interference. This judgment serves as a critical reminder to all employers that the provisions of Section 4(6) of the 1972 Act are the sole gateway for gratuity forfeiture, strictly limited to proven misconduct and not extendable to civil liabilities like loan guarantees. The bank was consequently ordered to release the gratuity forthwith.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/orissa-hc-gratuity-cannot-be-withheld-for-loan-guarantee.jpg"
  }
]